# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

coyoteAdapter.accesslogFail=\u30a2\u30af\u30bb\u30b9\u30ed\u30b0\u306b\u30a8\u30f3\u30c8\u30ea\u3092\u8ffd\u52a0\u3059\u308b\u969b\u306e\u4f8b\u5916
coyoteAdapter.asyncDispatch=\u975e\u540c\u671f\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u51e6\u7406\u4e2d\u306e\u4f8b\u5916
coyoteAdapter.authenticate=\u30b3\u30cd\u30af\u30bf\u30fc\u304b\u3089\u8a8d\u8a3c\u6e08\u307f\u30e6\u30fc\u30b6\u30fc [{0}] \u3092\u53d6\u5f97\u3057\u307e\u3057\u305f\u3002
coyoteAdapter.authorize=Tomcat \u306eRealm\u3067\u30e6\u30fc\u30b6\u30fc [{0}] \u3092\u8a8d\u8a3c\u3057\u307e\u3059\u3002
coyoteAdapter.checkRecycled.request=\u30ea\u30b5\u30a4\u30af\u30eb\u3055\u308c\u3066\u3044\u306a\u3044\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u906d\u9047\u3057\u307e\u3057\u305f\u3002\u5f37\u5236\u7684\u306b\u30ea\u30b5\u30a4\u30af\u30eb\u3057\u307e\u3057\u305f\u3002
coyoteAdapter.checkRecycled.response=\u30ea\u30b5\u30a4\u30af\u30eb\u3055\u308c\u3066\u3044\u306a\u3044\u30ec\u30b9\u30dd\u30f3\u30b9\u304c\u767a\u751f\u3001\u5f37\u5236\u7684\u306b\u30ea\u30b5\u30a4\u30af\u30eb\u3055\u308c\u307e\u3057\u305f\u3002
coyoteAdapter.debug=\u5909\u6570[{0}]\u306b\u5024[{1}]\u304c\u3042\u308a\u307e\u3059
coyoteAdapter.nullRequest=\u975e\u540c\u671f\u30c7\u30a3\u30b9\u30d1\u30c3\u30c1\u306f\u3001\u65e2\u5b58\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u306e\u307f\u767a\u751f\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059

coyoteConnector.invalidEncoding=[{0}] \u306f JRE \u306e\u7406\u89e3\u3067\u304d\u306a\u3044\u7b26\u53f7\u5316\u65b9\u5f0f\u3067\u3059\u3002Connector \u306f [{1}] \u3067\u51e6\u7406\u3092\u7d9a\u884c\u3057\u307e\u3059\u3002
coyoteConnector.invalidPort=[{0}]\u306e\u6307\u5b9a\u3055\u308c\u305f\u30dd\u30fc\u30c8\u5024\u304c\u7121\u52b9\u3067\u3042\u308b\u305f\u3081\u3001\u30b3\u30cd\u30af\u30bf\u3092\u958b\u59cb\u3067\u304d\u307e\u305b\u3093
coyoteConnector.parseBodyMethodNoTrace=TRACE \u30e1\u30bd\u30c3\u30c9\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u306f\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u3092\u542b\u3081\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093 (RFC 2616 \u306e 9.6 \u7bc0\u3092\u53c2\u7167)\u3002
coyoteConnector.protocolHandlerDestroyFailed=\u30d7\u30ed\u30c8\u30b3\u30eb\u30cf\u30f3\u30c9\u30e9\u306e\u5ec3\u68c4\u306b\u5931\u6557\u3057\u307e\u3057\u305f
coyoteConnector.protocolHandlerInitializationFailed=\u30d7\u30ed\u30c8\u30b3\u30eb\u30cf\u30f3\u30c9\u30e9\u306e\u521d\u671f\u5316\u306b\u5931\u6557\u3057\u307e\u3057\u305f
coyoteConnector.protocolHandlerInstantiationFailed=\u30d7\u30ed\u30c8\u30b3\u30eb\u30cf\u30f3\u30c9\u30e9\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5316\u306b\u5931\u6557\u3057\u307e\u3057\u305f
coyoteConnector.protocolHandlerNoAprLibrary=\u69cb\u6210\u3055\u308c\u305f\u30d7\u30ed\u30c8\u30b3\u30eb[{0}]\u306b\u306f\u4f7f\u7528\u3067\u304d\u306a\u3044APR/native\u30e9\u30a4\u30d6\u30e9\u30ea\u304c\u5fc5\u8981\u3067\u3059\u3002
coyoteConnector.protocolHandlerNoAprListener=\u69cb\u6210\u3055\u308c\u305f\u30d7\u30ed\u30c8\u30b3\u30eb[{0}]\u306b\u306f\u3001\u4f7f\u7528\u3067\u304d\u306a\u3044AprLifecycleListener\u304c\u5fc5\u8981\u3067\u3059\u3002
coyoteConnector.protocolHandlerPauseFailed=\u30d7\u30ed\u30c8\u30b3\u30eb\u30cf\u30f3\u30c9\u30e9\u306e\u4e00\u6642\u505c\u6b62\u306b\u5931\u6557\u3057\u307e\u3057\u305f
coyoteConnector.protocolHandlerResumeFailed=\u30d7\u30ed\u30c8\u30b3\u30eb\u30cf\u30f3\u30c9\u30e9\u306e\u518d\u958b\u306b\u5931\u6557\u3057\u307e\u3057\u305f
coyoteConnector.protocolHandlerStartFailed=\u30d7\u30ed\u30c8\u30b3\u30eb\u30cf\u30f3\u30c9\u30e9\u306e\u8d77\u52d5\u306b\u5931\u6557\u3057\u307e\u3057\u305f
coyoteConnector.protocolHandlerStopFailed=\u30d7\u30ed\u30c8\u30b3\u30eb\u30cf\u30f3\u30c9\u30e9\u306e\u505c\u6b62\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002

coyoteInputStream.nbNotready=\u30ce\u30f3\u30d6\u30ed\u30c3\u30ad\u30f3\u30b0\u30e2\u30fc\u30c9\u3067\u306f\u3001\u4ee5\u524d\u306e\u8aad\u307f\u53d6\u308a\u304c\u5b8c\u4e86\u3057\u3066 isReady() \u304c true \u3092\u8fd4\u3059\u307e\u3067\u3001ServletInputStream \u304b\u3089\u8aad\u307f\u53d6\u308a\u3067\u304d\u307e\u305b\u3093\u3002

coyoteOutputStream.nbNotready=\u30ce\u30f3\u30d6\u30ed\u30c3\u30ad\u30f3\u30b0\u30e2\u30fc\u30c9\u3067\u306f\u76f4\u524d\u306e\u66f8\u304d\u8fbc\u307f\u304c\u5b8c\u4e86\u3057 isReady() \u304c true \u3092\u8fd4\u3059\u307e\u3067 ServletOutputStream \u3078\u306e\u66f8\u304d\u8fbc\u307f\u306f\u3067\u304d\u307e\u305b\u3093\u3002

coyoteRequest.alreadyAuthenticated=\u8a8d\u8a3c\u6e08\u307f\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u3059\u3002
coyoteRequest.attributeEvent=\u5c5e\u6027\u30a4\u30d9\u30f3\u30c8\u30ea\u30b9\u30ca\u306b\u3088\u3063\u3066\u4f8b\u5916\u304c\u6295\u3052\u3089\u308c\u307e\u3057\u305f
coyoteRequest.authenticate.ise=\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u30b3\u30df\u30c3\u30c8\u3057\u305f\u5f8c\u306f authenticate() \u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
coyoteRequest.changeSessionId=\u30bb\u30c3\u30b7\u30e7\u30f3 ID \u306f\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u3042\u308a\u307e\u305b\u3093\u3002
coyoteRequest.chunkedPostTooLarge=POST \u30c7\u30fc\u30bf\u304c\u5927\u304d\u3059\u304e\u308b\u305f\u3081\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u89e3\u6790\u3057\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30ea\u30af\u30a8\u30b9\u30c8\u306f\u30c1\u30e3\u30f3\u30af\u5316\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u51e6\u7406\u3092\u7d99\u7d9a\u3067\u304d\u307e\u305b\u3093\u3002\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u5927\u304d\u306a POST \u30c7\u30fc\u30bf\u3092\u53d7\u4fe1\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u306a\u3089\u3001Connector \u8981\u7d20\u306e maxPostSize \u5c5e\u6027\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
coyoteRequest.filterAsyncSupportUnknown=\u975e\u540c\u671f\u51e6\u7406\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u306a\u3044Filter\u304c\u3042\u308b\u304b\u3069\u3046\u304b\u3092\u5224\u65ad\u3067\u304d\u307e\u305b\u3093
coyoteRequest.getContextPath.ise=\u6a19\u6e96\u7684\u306a\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30d1\u30b9[{0}]\u3068\u30e6\u30fc\u30b6\u30fc\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8[{1}]\u306b\u3088\u3063\u3066\u63d0\u793a\u3055\u308c\u305fURI\u3068\u306e\u4e00\u81f4\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
coyoteRequest.getInputStream.ise=getReader()\u306f\u3053\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u5bfe\u3057\u3066\u65e2\u306b\u547c\u3073\u51fa\u3055\u308c\u3066\u3044\u307e\u3059
coyoteRequest.getReader.ise=getInputStream()\u306f\u3053\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u5bfe\u3057\u3066\u65e2\u306b\u547c\u3073\u51fa\u3055\u308c\u3066\u3044\u307e\u3059
coyoteRequest.gssLifetimeFail=\u30e6\u30fc\u30b6\u30fc\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb [{0}] \u306e\u6b8b\u308a\u306e\u5bff\u547d(\u79d2\u5358\u4f4d) \u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
coyoteRequest.maxPostSizeExceeded=\u30de\u30eb\u30c1\u30d1\u30fc\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u306f\u3001\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30b3\u30cd\u30af\u30bf\u3067\u8a2d\u5b9a\u3055\u308c\u305fmaxPostSize\u306e\u5236\u9650\u3092\u8d85\u3048\u305f\u30d1\u30e9\u30e1\u30fc\u30bf\u30c7\u30fc\u30bf\uff08\u30a2\u30c3\u30d7\u30ed\u30fc\u30c9\u3055\u308c\u305f\u30d5\u30a1\u30a4\u30eb\u3092\u9664\u304f\uff09\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3057\u305f\u3002
coyoteRequest.noAsync=\u51e6\u7406\u30c1\u30a7\u30fc\u30f3\u5185\u306e\u6b21\u306e\u30af\u30e9\u30b9\u304c\u975e\u540c\u671f\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u975e\u540c\u671f\u3092\u958b\u59cb\u3067\u304d\u307e\u305b\u3093\u3002[{0}]
coyoteRequest.noMultipartConfig=multi-part \u69cb\u6210\u304c\u63d0\u4f9b\u3055\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001part\u3092\u51e6\u7406\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093
coyoteRequest.parseParameters=POST \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u51e6\u7406\u4e2d\u306b\u4f8b\u5916\u3092\u6295\u3052\u307e\u3057\u305f\u3002
coyoteRequest.postTooLarge=POST\u3055\u308c\u305f\u30c7\u30fc\u30bf\u304c\u5927\u304d\u3059\u304e\u305f\u306e\u3067\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u69cb\u6587\u89e3\u6790\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u305d\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u5de8\u5927\u306aPOST\u3092\u53d7\u3051\u4ed8\u3051\u306d\u3070\u306a\u3089\u306a\u3044\u5834\u5408\u306b\u306f\u3001\u3053\u308c\u3092\u89e3\u6c7a\u3059\u308b\u305f\u3081\u306b\u30b3\u30cd\u30af\u30bf\u306emaxPostSize\u5c5e\u6027\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
coyoteRequest.sendfileNotCanonical=sendfile \u306b\u6307\u5b9a\u3055\u308c\u305f\u30d5\u30a1\u30a4\u30eb [{0}] \u306e\u6b63\u5f0f\u540d\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
coyoteRequest.sessionCreateCommitted=\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u30b3\u30df\u30c3\u30c8\u3057\u305f\u5f8c\u3067\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093
coyoteRequest.sessionEndAccessFail=\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u518d\u5229\u7528\u4e2d\u306b\u884c\u3063\u305f\u30bb\u30c3\u30b7\u30e7\u30f3\u3078\u306e\u30a2\u30af\u30bb\u30b9\u7d42\u4e86\u51e6\u7406\u3067\u4f8b\u5916\u304c\u9001\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
coyoteRequest.setAttribute.namenull=setAttribute\u3092\u540d\u524d\u3092\u6307\u5b9a\u305b\u305a\u306b\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
coyoteRequest.uploadCreate=\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8[{1}]\u306b\u5fc5\u8981\u306a\u4e00\u6642\u30a2\u30c3\u30d7\u30ed\u30fc\u30c9\u5834\u6240[{0}]\u3092\u4f5c\u6210\u3057\u307e\u3059\u3002
coyoteRequest.uploadCreateFail=\u30a2\u30c3\u30d7\u30ed\u30fc\u30c9\u5834\u6240[{0}]\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
coyoteRequest.uploadLocationInvalid=\u4e00\u6642\u7684\u306a\u30a2\u30c3\u30d7\u30ed\u30fc\u30c9\u5834\u6240[{0}]\u306f\u7121\u52b9\u3067\u3059

coyoteResponse.encoding.invalid=JRE \u306f\u6587\u5b57\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0 [{0}] \u3092\u7406\u89e3\u3057\u307e\u305b\u3093\u3002
coyoteResponse.getOutputStream.ise=getWriter()\u306f\u3053\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u5bfe\u3057\u3066\u65e2\u306b\u547c\u3073\u51fa\u3055\u308c\u3066\u3044\u307e\u3059
coyoteResponse.getWriter.ise=getOutputStream()\u306f\u3053\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u5bfe\u3057\u3066\u65e2\u306b\u547c\u3073\u51fa\u3055\u308c\u3066\u3044\u307e\u3059
coyoteResponse.reset.ise=\u30ec\u30b9\u30dd\u30f3\u30b9\u304c\u30b3\u30df\u30c3\u30c8\u3055\u308c\u305f\u5f8c\u3067reset()\u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
coyoteResponse.resetBuffer.ise=\u30ec\u30b9\u30dd\u30f3\u30b9\u304c\u30b3\u30df\u30c3\u30c8\u3055\u308c\u305f\u5f8c\u3067\u30d0\u30c3\u30d5\u30a1\u3092\u30ea\u30bb\u30c3\u30c8\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
coyoteResponse.sendError.ise=\u30ec\u30b9\u30dd\u30f3\u30b9\u304c\u30b3\u30df\u30c3\u30c8\u3055\u308c\u305f\u5f8c\u3067sendError()\u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
coyoteResponse.sendRedirect.ise=\u30ec\u30b9\u30dd\u30f3\u30b9\u304c\u30b3\u30df\u30c3\u30c8\u3055\u308c\u305f\u5f8c\u3067sendRedirect()\u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
coyoteResponse.sendRedirect.note=<html> <body> <p> <a href="{0}"> {0} </a>\u3078\u306e\u30ea\u30c0\u30a4\u30ec\u30af\u30c8</ p> </ body> </ html>
coyoteResponse.setBufferSize.ise=\u30c7\u30fc\u30bf\u304c\u65e2\u306b\u66f8\u304d\u8fbc\u307e\u308c\u305f\u5f8c\u3067\u30d0\u30c3\u30d5\u30a1\u30b5\u30a4\u30ba\u3092\u5909\u66f4\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093

inputBuffer.requiresNonBlocking=\u30ce\u30f3\u30d6\u30ed\u30c3\u30ad\u30f3\u30b0\u30e2\u30fc\u30c9\u3067\u306f\u5229\u7528\u3067\u304d\u307e\u305b\u3093\u3002
inputBuffer.streamClosed=\u30b9\u30c8\u30ea\u30fc\u30e0\u306f\u30af\u30ed\u30fc\u30ba\u3057\u3066\u3044\u307e\u3059

outputBuffer.writeNull=write(String, int, int) \u30e1\u30bd\u30c3\u30c9\u306e String \u578b\u306e\u5f15\u6570\u306b null \u3092\u6307\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002

request.asyncNotSupported=\u73fe\u5728\u306e\u30c1\u30a7\u30fc\u30f3\u306e\u30d5\u30a3\u30eb\u30bf\u307e\u305f\u306f\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u306f\u975e\u540c\u671f\u64cd\u4f5c\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
request.fragmentInDispatchPath=\u30c7\u30a3\u30b9\u30d1\u30c3\u30c1\u30d1\u30b9 [{0}] \u4e2d\u306e\u30d5\u30e9\u30b0\u30e1\u30f3\u30c8\u306f\u9664\u53bb\u3055\u308c\u307e\u3057\u305f
request.illegalWrap=\u30ea\u30af\u30a8\u30b9\u30c8\u30e9\u30c3\u30d1\u30fc\u306f getRequest() \u3067\u53d6\u5f97\u3057\u305f\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u30e9\u30c3\u30d7\u3057\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
request.notAsync=\u975e\u540c\u671f\u30e2\u30fc\u30c9\u3067\u306f\u306a\u3044\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u3053\u306e\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002(\u4f8b\u3048\u3070 isAsyncStarted() \u304c false \u3092\u8fd4\u3059\u5834\u5408)

requestFacade.nullRequest=\u30ea\u30af\u30a8\u30b9\u30c8\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u56de\u53ce\u3055\u308c\u3053\u306e\u30d5\u30a1\u30b5\u30fc\u30c9\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u306a\u304f\u306a\u308a\u307e\u3057\u305f\u3002

response.illegalWrap=\u30ec\u30b9\u30dd\u30f3\u30b9\u30e9\u30c3\u30d1\u30fc\u306f\u3001getResponse()\u304b\u3089\u53d6\u5f97\u3057\u305f\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u30e9\u30c3\u30d7\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
response.sendRedirectFail=[{0}] \u3078\u306e\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002

responseFacade.nullResponse=\u30ec\u30b9\u30dd\u30f3\u30b9\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u3059\u3067\u306b\u56de\u53ce\u3055\u308c\u305f\u305f\u3081\u3053\u306e\u30d5\u30a1\u30b5\u30fc\u30c9\u3068\u306f\u95a2\u9023\u4ed8\u3051\u304c\u3042\u308a\u307e\u305b\u3093\u3002
