# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

coyoteAdapter.accesslogFail=Excepci\u00f3n al intentar a\u00f1adir una entrada al historial de acceso
coyoteAdapter.checkRecycled.response=Se encontr\u00f3 una respuesta no reciclable y se crecicl\u00f3 a la fuerza
coyoteAdapter.debug=La variable [{0}] tiene el valor [{1}]

coyoteConnector.invalidEncoding=La codificaci\u00f3n  [{0}]  no esta reconocida por  JRE. El conector continuar\u00e1 usando [{1}]\n
coyoteConnector.invalidPort=El conector no puede inciar debido a que el valor del puerto especificado [{0}] no es v\u00e1lido
coyoteConnector.parseBodyMethodNoTrace=El m\u00e9todo TRACE NO DEBE DE incluir una entidad (vea RFC 2616 Secci\u00f3n 9.6)
coyoteConnector.protocolHandlerDestroyFailed=Fall\u00f3 la destrucci\u00f3n del manejador de protocolo
coyoteConnector.protocolHandlerInitializationFailed=Fall\u00f3 la inicializaci\u00f3n del manejador de protocolo
coyoteConnector.protocolHandlerInstantiationFailed=Fall\u00f3 la instanciaci\u00f3n del manejador de protocolo
coyoteConnector.protocolHandlerPauseFailed=Ha fallado la pausa del manejador de protocolo
coyoteConnector.protocolHandlerResumeFailed=Ha fallado el rearranque del manejador de protocolo
coyoteConnector.protocolHandlerStartFailed=Fall\u00f3 el arranque del manejador de protocolo
coyoteConnector.protocolHandlerStopFailed=Ocurri\u00f3 un fallo al detener el manejador del protocolo

coyoteInputStream.nbNotready=En modo non-blocking usted no puede leer desde ServletInputStream hasta que la lectura previa haya sido completada y  isReady() devuelva verdadero

coyoteRequest.alreadyAuthenticated=Este requerimiento ya ha sido autenticado
coyoteRequest.attributeEvent=Excepci\u00f3n lanzada mediante el escuchador de eventos de atributos
coyoteRequest.authenticate.ise=No puedo llamar a authenticate() tras haberse acometido la respuesta
coyoteRequest.changeSessionId=No se puede cambiar el ID de sesi\u00f3n. No hay sesi\u00f3n asociada con esta solicitud
coyoteRequest.chunkedPostTooLarge=No se han analizado los par\u00e1metros porque la medida de los datos enviados meiante "post" era demasiado grande. Debido a que este requerimiento es una parte del original, no puede ser procesado. Utiliza el atributo "maxPostSize" del conector para resolver esta situaci\u00f3n, en caso de que la aplicaci\u00f3n deba de aceptar POSTs mayores.
coyoteRequest.filterAsyncSupportUnknown=Imposible determinar si alg\u00fan filtro no soporta procesamiento asincr\u00f3nico
coyoteRequest.getInputStream.ise=getReader() ya ha sido llamado para este requerimiento
coyoteRequest.getReader.ise=getInputStream() ya ha sido llamado para este requerimiento
coyoteRequest.gssLifetimeFail=Fallo al obtener el tiempo de vida restante para el usuario principal [{0}]\n
coyoteRequest.noMultipartConfig=Imposible procesar partes debido a que se ha prove\u00eddo una configuraci\u00f3n no multipartes
coyoteRequest.parseParameters=Excepci\u00f3n lanzada al procesar par\u00e1metros POST
coyoteRequest.postTooLarge=No se analizaron los par\u00e1metros porque la medida de los datos enviados era demasiado grande. Usa el atributo maxPostSize del conector para resolver esto en caso de que la aplicaci\u00f3n debiera de aceptar POSTs m\u00e1s grandes.
coyoteRequest.sendfileNotCanonical=Incapaz de determinar el nombre can\u00f3nico del archivo  [{0}] especificado para ser usado con sendfile
coyoteRequest.sessionCreateCommitted=No puedo crear una sesi\u00f3n despu\u00e9s de llevar a cabo la respueta
coyoteRequest.sessionEndAccessFail=Excepci\u00f3n disparada acabando acceso a sesi\u00f3n mientras se reciclaba el requerimiento
coyoteRequest.setAttribute.namenull=No pudeo llamar a setAttribute con un nombre nulo
coyoteRequest.uploadLocationInvalid=No es v\u00e1lida la localizaci\u00f3n [{0}] de carga temporal

coyoteResponse.getOutputStream.ise=getWriter() ya ha sido llamado para esta respuesta
coyoteResponse.getWriter.ise=getOutputStream() ya ha sido llamado para esta respuesta
coyoteResponse.resetBuffer.ise=No puedo limpiar el b\u00fafer despu\u00e9s de que la respuesta ha sido llevada a cabo
coyoteResponse.sendError.ise=No puedo llamar a sendError() tras llevar a cabo la respuesta
coyoteResponse.sendRedirect.ise=No puedo llamar a sendRedirect() tras llevar a cabo la respuesta
coyoteResponse.setBufferSize.ise=No puedo cambiar la medida del b\u00fafer tras escribir los datos

inputBuffer.streamClosed=Flujo cerrado

requestFacade.nullRequest=El objeto de requerimiento ha sido reciclado y ya no est\u00e1 asociado con esta fachada

responseFacade.nullResponse=El objeto de respuesta ha sido reciclado y ya no est\u00e1 asociado con esta fachada
