# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

upgrade.sis.errorCloseFail=\u76f4\u524d\u306e\u30a8\u30e9\u30fc\u306e\u5f8c\u306b\u5b8c\u5168\u306bInputStream\u3092\u9589\u3058\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
upgrade.sis.isFinished.ise=\u30ce\u30f3\u30d6\u30ed\u30c3\u30ad\u30f3\u30b0\u30e2\u30fc\u30c9\u3067\u306f\u306a\u3044 ServletInputStream \u306e isFinished() \u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002(\u3059\u306a\u308f\u3061\u6700\u521d\u306b setReadListener() \u3092\u547c\u3073\u51fa\u3055\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002)
upgrade.sis.isReady.ise=ServletInputStream\u304c\u975e\u30d6\u30ed\u30c3\u30ad\u30f3\u30b0\u30e2\u30fc\u30c9\u3067\u306a\u3044\u5834\u5408\uff08\u3064\u307e\u308a\u3001\u6700\u521d\u306bsetReadListener()\u3092\u547c\u3073\u51fa\u3055\u306a\u3051\u308c\u3070\u306a\u3089\u306a\u3044\u5834\u5408\uff09isReady()\u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
upgrade.sis.onErrorFail=onError\u306f\u767b\u9332\u3055\u308c\u305fReadListener\u304c\u5f15\u304d\u8d77\u3053\u3057\u305f\u3055\u3089\u306a\u308b\u30a8\u30e9\u30fc\u3092\u98f2\u307f\u8fbc\u3093\u3067\u51e6\u7406\u3057\u3066\u3044\u307e\u3059
upgrade.sis.read.closed=InputStream \u306f\u3059\u3067\u306b\u5207\u65ad\u3055\u308c\u3066\u3044\u307e\u3059\u3002
upgrade.sis.read.ise=isReady()\u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u306b\u3088\u3063\u3066\u5229\u7528\u53ef\u80fd\u306a\u30c7\u30fc\u30bf\u304c\u3042\u308b\u3053\u3068\u3092\u6700\u521d\u306b\u30c1\u30a7\u30c3\u30af\u3059\u308b\u3053\u3068\u306a\u304f\u3001\u975e\u30d6\u30ed\u30c3\u30af\u30e2\u30fc\u30c9\u3067read()\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u4e0d\u6b63\u3067\u3059\u3002
upgrade.sis.readListener.null=setReadListener() \u306b\u306f null \u3092\u6307\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
upgrade.sis.readListener.set=\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3057\u305f\u30b3\u30cd\u30af\u30b7\u30e7\u30f3\u306b\u4f55\u5ea6\u3082 setReadListener() \u3092\u547c\u3073\u51fa\u3059\u306e\u306f\u4e0d\u6b63\u306a\u64cd\u4f5c\u3067\u3059\u3002
upgrade.sos.canWrite.ise=ServletOutputStream\u304c\u975e\u30d6\u30ed\u30c3\u30ad\u30f3\u30b0\u30e2\u30fc\u30c9\u3067\u306a\u3044\u5834\u5408\uff08\u3064\u307e\u308a\u3001setWriteListener()\u3092\u6700\u521d\u306b\u547c\u3073\u51fa\u3055\u306a\u3051\u308c\u3070\u306a\u3089\u306a\u3044\u5834\u5408\uff09\u3001canWrite()\u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
upgrade.sos.errorCloseFail=\u4ee5\u524d\u306e\u30a8\u30e9\u30fc\u306e\u5f8c\u306bOutputStream\u3092\u304d\u308c\u3044\u306b\u9589\u3058\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
upgrade.sos.onErrorFail=onError\u306f\u767b\u9332\u3055\u308c\u305fWriteListener\u304c\u5f15\u304d\u8d77\u3053\u3057\u305f\u3055\u3089\u306a\u308b\u30a8\u30e9\u30fc\u3092\u98f2\u307f\u8fbc\u3093\u3067\u51e6\u7406\u3057\u3066\u3044\u307e\u3059
upgrade.sos.write.closed=OutputStream\u306f\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f
upgrade.sos.write.ise=\u30ce\u30f3\u30d6\u30ed\u30c3\u30ad\u30f3\u30b0\u30e2\u30fc\u30c9\u3067\u306f\u521d\u3081\u306b isReady() \u3092\u547c\u3073\u51fa\u3057\u3066\u5229\u7528\u53ef\u80fd\u306a\u9818\u57df\u304c\u3042\u308b\u3053\u3068\u3092\u78ba\u304b\u3081\u306a\u3051\u308c\u3070\u3001\u3042\u3089\u3086\u308b write() \u30e1\u30bd\u30c3\u30c9\u306e\u547c\u3073\u51fa\u3057\u306f\u4e0d\u6b63\u306b\u306a\u308a\u307e\u3059\u3002
upgrade.sos.writeListener.null=setWriteListener() \u306b null \u3092\u6e21\u3059\u306e\u306f\u4e0d\u6b63\u306a\u64cd\u4f5c\u3067\u3059\u3002
upgrade.sos.writeListener.set=\u540c\u3058\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3055\u308c\u305f\u30b3\u30cd\u30af\u30b7\u30e7\u30f3\u306b\u5bfe\u3057\u3066setWriteListener()\u3092\u8907\u6570\u56de\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002

upgradeProcessor.isCloseFail=\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3055\u308c\u305f\u30b3\u30cd\u30af\u30b7\u30e7\u30f3\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u5165\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u3092\u9589\u3058\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
upgradeProcessor.osCloseFail=\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3055\u308c\u305f\u63a5\u7d9a\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u51fa\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u3092\u9589\u3058\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f
upgradeProcessor.requiredClose=\u30b9\u30c8\u30ea\u30fc\u30e0\u304ccloseRequired\u72b6\u614b\u306b\u306a\u3063\u305f\u305f\u3081\u3001\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3055\u308c\u305f\u63a5\u7d9a\u3092\u30af\u30ed\u30fc\u30ba\u3057\u3066\u3044\u307e\u3059\uff1a\u5165\u529b[{0}]\u3001\u51fa\u529b[{1}]
upgradeProcessor.stop=\u7740\u4fe1\u30bd\u30b1\u30c3\u30c8\u306e\u72b6\u614b\u304cSTOP\u3060\u3063\u305f\u306e\u3067\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3055\u308c\u305f\u30b3\u30cd\u30af\u30b7\u30e7\u30f3\u3092\u9589\u3058\u3066\u3044\u307e\u3059\u3002
upgradeProcessor.unexpectedState=\u30bd\u30b1\u30c3\u30c8\u306e\u72b6\u614b\u306f [{0}] \u3067\u3057\u305f\u304c\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3057\u305f\u30b3\u30cd\u30af\u30b7\u30e7\u30f3\u306f\u4e88\u671f\u305b\u306c\u7406\u7531\u3067\u5207\u65ad\u3057\u307e\u3057\u305f\u3002
