# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

abstractHttp11Protocol.alpnConfigured=Le connecteur [{0}] a \u00e9t\u00e9 configur\u00e9 pour supporter la n\u00e9gociation de [{1}] avec ALPN
abstractHttp11Protocol.alpnWithNoAlpn=Le gestionnaire de mise \u00e0 niveau [{0}] pour [{1}] ne supporte qu''une mise \u00e0 niveau via ALPN mais il a \u00e9t\u00e9 configur\u00e9 pour le connecteur [{2}] qui ne supporte pas ALPN
abstractHttp11Protocol.httpUpgradeConfigured=Le connecteur [{0}] a \u00e9t\u00e9 configur\u00e9 pour supporter la mise \u00e0 niveau de HTTP vers [{1}]

http11processor.fallToDebug=\ Note : les occurrences suivantes d'erreurs d'analyse de requ\u00eate HTTP seront enregistr\u00e9es au niveau DEBUG.
http11processor.header.parse=Erreur lors de l'analyse d'un en-t\u00eate de requ\u00eate HTTP
http11processor.request.finish=Erreur en terminant la requ\u00eate
http11processor.request.inconsistentHosts=L'h\u00f4te sp\u00e9cifi\u00e9 dans la ligne de requ\u00eate ne correspond pas \u00e0 celui de l'en-t\u00eate h\u00f4te
http11processor.request.invalidScheme=La requ\u00eate HTTP contenait une URi absolue avec un sch\u00e9ma invalide
http11processor.request.invalidTransferEncoding=La requ\u00eate HTTP contenait un en-t\u00eate Trasfer-Encoding invalide
http11processor.request.invalidUri=La requ\u00eate HTTP contenait un URI non valide
http11processor.request.invalidUserInfo=La requ\u00eate HTTP contenait un URI absolu avec un composant "userinfo" invalide
http11processor.request.multipleContentLength=La requ\u00eate contenait plusieurs en-t\u00eates content-length
http11processor.request.multipleHosts=La requ\u00eate contenait plusieurs en-t\u00eates h\u00f4tes
http11processor.request.noHostHeader=La requ6ete HTTP/1.1 ne contient pas d'en-t\u00eate host
http11processor.request.nonNumericContentLength=La requ\u00eate contenait un en-t\u00eate content-length avec une valeur non num\u00e9rique
http11processor.request.prepare=Echec de pr\u00e9paration de la requ\u00eate
http11processor.request.process=Erreur de traitement de la requ\u00eate
http11processor.response.finish=Erreur en finissant la r\u00e9ponse
http11processor.sendfile.error=Erreur d'envoi des donn\u00e9es avec sendfile, cela peut \u00eatre caus\u00e9 par des attributs de d\u00e9marrage ou de fin incorrects dans la requ\u00eate
http11processor.socket.info=Exception pendant la requ\u00eate d'information sur le socket.

iib.available.readFail=Une lecture non-bloquante a \u00e9chou\u00e9 lors de la d\u00e9termination pr\u00e9alable de donn\u00e9es disponibles
iib.eof.error=Fin de flux (EOF) inattendue \u00e0 la lecture sur la socket
iib.failedread.apr=Echec de lecteur avec le code d''erreur APR [{0}]
iib.filter.npe=Impossible d'ajouter un filtre null
iib.invalidHttpProtocol=Un caract\u00e8re invalide a \u00e9t\u00e9 trouv\u00e9 dans le protocole HTTP
iib.invalidPhase=Etape invalide de traitement [{0}] de la ligne de requ\u00eate
iib.invalidRequestTarget=Un caract\u00e8re invalide a \u00e9t\u00e9 trouv\u00e9 dans la cible de la requ\u00eate, les caract\u00e8res valides sont d\u00e9finis dans RFC 7230 et RFC 3986
iib.invalidheader=La ligne d''en-\u00eatre HTTP [{0}] n''est pas conforme \u00e0 la RFC 7230 et a \u00e9t\u00e9 ignor\u00e9e
iib.invalidmethod=Caract\u00e8re invalide trouv\u00e9 dans le nom de m\u00e9thode.  Les noms HTTP doivent \u00eatre des "token".
iib.parseheaders.ise.error=Etat inattendu, les en-\u00eatres ont d\u00e9j\u00e0 \u00e9t\u00e9 trait\u00e9s, il est possible que le buffer n'ait pas \u00e9t\u00e9 recycl\u00e9
iib.readtimeout=D\u00e9lai d'attente d\u00e9pass\u00e9 en lisant des donn\u00e9es du socket
iib.requestheadertoolarge.error=L'ent\u00eate de requ\u00eate est trop important

iob.failedwrite=Echec d'\u00e9criture
iob.failedwrite.ack=Echec d'envoi de la r\u00e9ponse HTTP 100 Continue
iob.responseheadertoolarge.error=Essai d'\u00e9criture de plus de donn\u00e9es dans les en-t^tes de r\u00e9ponse, qu'il n'y a de place disponible dans le tampon.  Augmentez maxHttpHeaderSize pour le connecteur, ou \u00e9crivez moins de donn\u00e9es dans les en-t\u00eates de r\u00e9ponse.
