# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

asyncChannelGroup.createFail=JavaEE\u30b3\u30f3\u30c6\u30ca\u306a\u3069\u306e\u8907\u96d1\u306a\u30af\u30e9\u30b9\u30ed\u30fc\u30c0\u74b0\u5883\u3067\u30e1\u30e2\u30ea\u30ea\u30fc\u30af\u3092\u9632\u3050\u305f\u3081\u306b\u5fc5\u8981\u306aWebSocket\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u5c02\u7528\u306eAsynchronousChannelGroup\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093

asyncChannelWrapperSecure.check.notOk=TLS\u30cf\u30f3\u30c9\u30b7\u30a7\u30a4\u30af\u304c\u4e88\u671f\u3057\u306a\u3044\u30b9\u30c6\u30fc\u30bf\u30b9\u3092\u8fd4\u3057\u307e\u3057\u305f[{0}]
asyncChannelWrapperSecure.check.unwrap=\u8aad\u307f\u8fbc\u307f\u4e2d\u306b\u30d0\u30a4\u30c8\u304c\u51fa\u529b\u306b\u66f8\u304d\u8fbc\u307e\u308c\u307e\u3057\u305f\u3002
asyncChannelWrapperSecure.check.wrap=\u66f8\u304d\u8fbc\u307f\u4e2d\u306b\u5165\u529b\u304b\u3089\u30d0\u30a4\u30c8\u304c\u6d88\u8cbb\u3055\u308c\u307e\u3057\u305f\u3002
asyncChannelWrapperSecure.closeFail=\u30c1\u30e3\u30f3\u30cd\u30eb\u3092\u304d\u308c\u3044\u306b\u9589\u3058\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f
asyncChannelWrapperSecure.concurrentRead=\u30b3\u30f3\u30ab\u30ec\u30f3\u30c8\u306a\u8aad\u307f\u53d6\u308a\u64cd\u4f5c\u3092\u884c\u3046\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
asyncChannelWrapperSecure.concurrentWrite=\u30b3\u30f3\u30ab\u30ec\u30f3\u30c8\u306a\u66f8\u304d\u8fbc\u307f\u64cd\u4f5c\u3092\u884c\u3046\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
asyncChannelWrapperSecure.eof=\u4e88\u671f\u305b\u306c\u4f4d\u7f6e\u306b\u30b9\u30c8\u30ea\u30fc\u30e0\u306e\u7d42\u7aef\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002
asyncChannelWrapperSecure.notHandshaking=TLS\u30cf\u30f3\u30c9\u30b7\u30a7\u30a4\u30af\u4e2d\u306b\u4e88\u671f\u3057\u306a\u3044\u72b6\u614b[NOT_HANDSHAKING]
asyncChannelWrapperSecure.statusUnwrap=unwrap()\u64cd\u4f5c\u5f8c\u306eSSLEngineResult\u306e\u4e88\u671f\u3057\u306a\u3044\u30b9\u30c6\u30fc\u30bf\u30b9
asyncChannelWrapperSecure.statusWrap=wrap()\u64cd\u4f5c\u5f8c\u306eSSLEngineResult\u306e\u4e88\u671f\u3057\u306a\u3044\u30b9\u30c6\u30fc\u30bf\u30b9\u3002
asyncChannelWrapperSecure.tooBig=Integer \u3068\u3057\u3066\u89e3\u91c8\u3059\u308b\u306b\u306f\u5927\u304d\u3059\u304e\u308b\u7d50\u679c [{0}] \u3067\u3059\u3002
asyncChannelWrapperSecure.wrongStateRead=\u8aad\u307f\u53d6\u308a\u64cd\u4f5c\u306e\u5b8c\u4e86\u4e2d\u306b\u8aad\u307f\u53d6\u308a\u4e2d\u3092\u610f\u5473\u3059\u308b\u30d5\u30e9\u30b0\u304c false \u306b\u306a\u3063\u3066\u3044\u308b\u3053\u3068\u3092\u691c\u51fa\u3057\u307e\u3057\u305f (true \u306b\u306a\u3063\u3066\u3044\u308b\u3079\u304d\u3067\u3059)\u3002
asyncChannelWrapperSecure.wrongStateWrite=\u66f8\u304d\u8fbc\u307f\u64cd\u4f5c\u3092\u5b8c\u4e86\u3057\u3088\u3046\u3068\u3059\u308b\u3068\u3001\u66f8\u304d\u8fbc\u307f\u304c\u9032\u884c\u4e2d\u3067\u3042\u308b\u3053\u3068\u3092\u793a\u3059\u30d5\u30e9\u30b0\u304cfalse\uff08true\u3067\u3042\u3063\u305f\u306f\u305a\u3067\u3059\uff09\u3067\u3042\u308b\u3053\u3068\u304c\u5224\u660e\u3057\u307e\u3057\u305f\u3002

backgroundProcessManager.processFailed=\u30d0\u30c3\u30af\u30b0\u30e9\u30a6\u30f3\u30c9\u51e6\u7406\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002

caseInsensitiveKeyMap.nullKey=null \u5024\u306f\u30ad\u30fc\u306b\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002

futureToSendHandler.timeout=\u5b8c\u4e86\u3092 [{0}] [{1}] \u5f85\u6a5f\u5f8c\u306b\u3001\u64cd\u4f5c\u304c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3057\u307e\u3057\u305f

perMessageDeflate.alreadyClosed=transformer \u306f\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u308c\u4ee5\u4e0a\u4f7f\u7528\u3055\u308c\u307e\u305b\u3093
perMessageDeflate.deflateFailed=\u5727\u7e2e\u3055\u308c\u305f WebSocket \u30d5\u30ec\u30fc\u30e0\u3092\u5c55\u958b\u3067\u304d\u307e\u305b\u3093\u3002
perMessageDeflate.duplicateParameter=[{0}]\u62e1\u5f35\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u91cd\u8907\u3057\u305f\u5b9a\u7fa9
perMessageDeflate.invalidState=\u4e0d\u6b63\u306a\u72b6\u614b\u3067\u3059\u3002
perMessageDeflate.invalidWindowSize=[{0}] \u306e\u30a6\u30a4\u30f3\u30c9\u30a6\u30b5\u30a4\u30ba\u306b\u4e0d\u6b63\u306a\u5024 [{1}] \u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002\u30a6\u30a4\u30f3\u30c9\u30a6\u30b5\u30a4\u30ba\u306f 8 \u4ee5\u4e0a 15 \u4ee5\u4e0b\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
perMessageDeflate.unknownParameter=\u672a\u77e5\u306e\u62e1\u5f35\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc [{0}] \u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002

transformerFactory.unsupportedExtension=\u672a\u5bfe\u5fdc\u306e\u62e1\u5f35 [{0}] \u3067\u3059\u3002

util.invalidMessageHandler=\u63d0\u4f9b\u3055\u308c\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u30cf\u30f3\u30c9\u30e9\u306bonMessage(Object)\u30e1\u30bd\u30c3\u30c9\u304c\u3042\u308a\u307e\u305b\u3093
util.invalidType=\u5024[{0}]\u3092\u30bf\u30a4\u30d7[{1}]\u306b\u5f37\u5236\u3067\u304d\u307e\u305b\u3093\u3002 \u3053\u306e\u30bf\u30a4\u30d7\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
util.notToken=\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u540d [{0}]\u3001\u5024 [{1}] \u306e\u4e0d\u6b63\u306a\u62e1\u5f35\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002
util.unknownDecoderType=\u30c7\u30b3\u30fc\u30c0\u30bf\u30a4\u30d7[{0}]\u306f\u8a8d\u8b58\u3055\u308c\u307e\u305b\u3093

wsFrame.alreadyResumed=\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u53d7\u4fe1\u306f\u65e2\u306b\u518d\u958b\u3055\u308c\u3066\u3044\u307e\u3059\u3002
wsFrame.alreadySuspended=\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u53d7\u4fe1\u306f\u65e2\u306b\u4e2d\u65ad\u3055\u308c\u3066\u3044\u307e\u3059\u3002
wsFrame.bufferTooSmall=\u975e\u540c\u671f\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u975e\u30b5\u30dd\u30fc\u30c8\u3068\u30d0\u30c3\u30d5\u30a1\u30fc\u304c\u5c0f\u3055\u3059\u304e\u307e\u3059\u3002 \u30d0\u30c3\u30d5\u30a1\u30b5\u30a4\u30ba\uff1a[{0}]\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u30b5\u30a4\u30ba\uff1a[{1}]
wsFrame.byteToLongFail=long \u3078\u5909\u63db\u3059\u308b\u305f\u3081\u306b\u5de8\u5927\u306a\u30d0\u30a4\u30c8\u5217 ([{0}]) \u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002
wsFrame.closed=\u9589\u3058\u305f\u30b3\u30f3\u30c8\u30ed\u30fc\u30d5\u30ec\u30fc\u30e0\u3067\u65b0\u3057\u3044\u30c7\u30fc\u30bf\u30d5\u30ec\u30fc\u30e0\u3092\u53d7\u4fe1\u3057\u307e\u3057\u305f\u3002
wsFrame.controlFragmented=\u65ad\u7247\u5316\u3055\u308c\u305f\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u30d5\u30ec\u30fc\u30e0\u304c\u53d7\u4fe1\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u30d5\u30ec\u30fc\u30e0\u306f\u65ad\u7247\u5316\u3055\u308c\u307e\u305b\u3093\u3002
wsFrame.controlNoFin=fin \u30d3\u30c3\u30c8\u304c\u30aa\u30d5\u306b\u306a\u3063\u3066\u3044\u308b\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u30d5\u30ec\u30fc\u30e0\u3092\u53d7\u4fe1\u3057\u307e\u3057\u305f\u3002\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u30d5\u30ec\u30fc\u30e0\u3092\u7d99\u7d9a\u30d5\u30ec\u30fc\u30e0\u3068\u3057\u3066\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
wsFrame.controlPayloadTooBig=\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u30d5\u30ec\u30fc\u30e0\u306f [{0}] \u30d0\u30a4\u30c8\u306e\u30da\u30a4\u30ed\u30fc\u30c9\u3067\u9001\u4fe1\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u9001\u4fe1\u53ef\u80fd\u306a\u6700\u5927\u5024\u306e 125 \u30d0\u30a4\u30c8\u3092\u8d8a\u3048\u3066\u3044\u307e\u3059\u3002
wsFrame.illegalReadState=\u4e88\u671f\u3057\u306a\u3044\u8aad\u307f\u53d6\u308a\u72b6\u614b[{0}]
wsFrame.invalidOpCode=\u672a\u77e5\u306e opCode [{0}] \u306e WebSocket \u30d5\u30ec\u30fc\u30e0\u3092\u53d7\u4fe1\u3057\u307e\u3057\u305f\u3002
wsFrame.invalidUtf8=\u7121\u52b9\u306a\u30d0\u30a4\u30c8\u30b7\u30fc\u30b1\u30f3\u30b9\u304c\u542b\u307e\u308c\u3066\u3044\u305f\u305f\u3081\u3001UTF-8\u306b\u30c7\u30b3\u30fc\u30c9\u3067\u304d\u306a\u304b\u3063\u305fWebSocket\u30c6\u30ad\u30b9\u30c8\u30d5\u30ec\u30fc\u30e0\u304c\u53d7\u4fe1\u3055\u308c\u307e\u3057\u305f\u3002
wsFrame.invalidUtf8Close=WebSocket \u306f\u4e0d\u6b63\u306a UTF-8 \u30d0\u30a4\u30c8\u5217\u3092\u542b\u3080\u3053\u3068\u3092\u539f\u56e0\u3068\u3059\u308b\u30af\u30ed\u30fc\u30ba\u30d5\u30ec\u30fc\u30e0\u3092\u53d7\u4fe1\u3057\u307e\u3057\u305f\u3002
wsFrame.ioeTriggeredClose=\u56de\u5fa9\u4e0d\u80fd\u306aIOException \u304c\u767a\u751f\u3057\u305f\u305f\u3081\u30b3\u30cd\u30af\u30b7\u30e7\u30f3\u3092\u5207\u65ad\u3057\u307e\u3059\u3002
wsFrame.messageTooBig=\u30e1\u30c3\u30bb\u30fc\u30b8\u306f[{0}]\u30d0\u30a4\u30c8\u306e\u9577\u3055\u3067\u3057\u305f\u304c\u3001MessageHandler\u306b\u306f[{1}]\u30d0\u30a4\u30c8\u306e\u5236\u9650\u304c\u3042\u308a\u307e\u3059\u3002
wsFrame.noContinuation=continuation \u30d5\u30ec\u30fc\u30e0\u304c\u4e88\u60f3\u3055\u308c\u305f\u3068\u304d\u306b\u65b0\u3057\u3044\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u958b\u59cb\u3055\u308c\u307e\u3057\u305f\u3002
wsFrame.notMasked=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u30d5\u30ec\u30fc\u30e0\u306f\u30de\u30b9\u30af\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u304c\u3001\u5168\u3066\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u30d5\u30ec\u30fc\u30e0\u306f\u30de\u30b9\u30af\u3057\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
wsFrame.oneByteCloseCode=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306f\u6709\u52b9\u3067\u306f\u306a\u3044\u5358\u4e00\u30d0\u30a4\u30c8\u306e\u30da\u30a4\u30ed\u30fc\u30c9\u3092\u542b\u3080\u30af\u30ed\u30fc\u30ba\u30d5\u30ec\u30fc\u30e0\u3092\u9001\u4fe1\u3057\u307e\u3057\u305f\u3002
wsFrame.partialHeaderComplete=WebSocket \u30d5\u30ec\u30fc\u30e0\u3092\u53d7\u4fe1\u3057\u307e\u3057\u305f\u3002fin [{0}]\u3001rsv [{1}]\u3001OpCode [{2}]\u3001\u30da\u30a4\u30ed\u30fc\u30c9\u9577 [{3}]
wsFrame.sessionClosed=\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u65e2\u306b\u9589\u3058\u3089\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30c7\u30fc\u30bf\u3092\u51e6\u7406\u3067\u304d\u307e\u305b\u3093\u3002
wsFrame.suspendRequested=\u3059\u3067\u306b\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u53d7\u4fe1\u4e2d\u65ad\u3092\u8981\u6c42\u3057\u3066\u3044\u307e\u3059\u3002
wsFrame.textMessageTooBig=\u30c7\u30b3\u30fc\u30c9\u3055\u308c\u305f\u30c6\u30ad\u30b9\u30c8\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u51fa\u529b\u30d0\u30c3\u30d5\u30a1\u306b\u3068\u3063\u3066\u5927\u304d\u3059\u304e\u307e\u3059\u3002\u3055\u3089\u306b\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u304c\u90e8\u5206\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
wsFrame.wrongRsv=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30d5\u30ec\u30fc\u30e0\u306f opCode [{1}] \u3067\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3059\u308b\u305f\u3081 [{0}] \u306e\u4e88\u7d04\u30d3\u30c3\u30c8\u3092\u8a2d\u5b9a\u3057\u307e\u3057\u305f\u304c\u3001\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u306f\u5bfe\u5fdc\u3057\u3066\u3044\u307e\u305b\u3093\u3002

wsFrameClient.ioe=\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u9001\u4fe1\u3055\u308c\u305f\u30c7\u30fc\u30bf\u3092\u8aad\u307f\u53d6\u308b\u969b\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002

wsHandshakeRequest.invalidUri=\u6587\u5b57\u5217 [{0}] \u306f\u6b63\u5e38\u306a URI \u306b\u542b\u3081\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
wsHandshakeRequest.unknownScheme=\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u30b9\u30ad\u30fc\u30e0[{0}]\u304c\u8a8d\u8b58\u3055\u308c\u307e\u305b\u3093

wsRemoteEndpoint.acquireTimeout=\u6307\u5b9a\u3057\u305f\u6642\u9593\u5185\u306b\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
wsRemoteEndpoint.changeType=\u30d5\u30e9\u30b0\u30e1\u30f3\u30c8\u5316\u3055\u308c\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3059\u308b\u5834\u5408\u3001\u3059\u3079\u3066\u306e\u30d5\u30e9\u30b0\u30e1\u30f3\u30c8\u306f\u540c\u3058\u30bf\u30a4\u30d7\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
wsRemoteEndpoint.closed=WebSocket \u30bb\u30c3\u30b7\u30e7\u30f3\u306f\u5207\u65ad\u6e08\u307f\u306e\u305f\u3081\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3057\u307e\u305b\u3093\u3002
wsRemoteEndpoint.closedDuringMessage=WebSocket \u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u5207\u65ad\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u6b8b\u308a\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u9001\u4fe1\u3067\u304d\u307e\u305b\u3093\u3002
wsRemoteEndpoint.closedOutputStream=\u3053\u306e\u30e1\u30bd\u30c3\u30c9\u306f\u3001OutputStream\u304c\u9589\u3058\u3089\u308c\u305f\u3068\u304d\u306b\u547c\u3073\u51fa\u3055\u308c\u306a\u3044\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002
wsRemoteEndpoint.closedWriter=Writer\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u3053\u306e\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
wsRemoteEndpoint.flushOnCloseFailed=\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u9589\u3058\u3089\u308c\u305f\u5f8c\u306b\u307e\u3060\u53ef\u80fd\u3067\u3042\u3063\u305f\u30d0\u30c3\u30c1\u30e1\u30c3\u30bb\u30fc\u30b8\u3002 \u6b8b\u308a\u306e\u30d0\u30c3\u30c1\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u30d5\u30e9\u30c3\u30b7\u30e5\u3067\u304d\u307e\u305b\u3093\u3002
wsRemoteEndpoint.invalidEncoder=\u6307\u5b9a\u3055\u308c\u305f\u30bf\u30a4\u30d7[{0}]\u306e\u30a8\u30f3\u30b3\u30fc\u30c0\u3092\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5316\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
wsRemoteEndpoint.noEncoder=\u30af\u30e9\u30b9 [{0}] \u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30a8\u30f3\u30b3\u30fc\u30c0\u30fc\u304c\u672a\u6307\u5b9a\u3067\u3059\u3002
wsRemoteEndpoint.nullData=\u7121\u52b9\u306aNull\u30c7\u30fc\u30bf\u5f15\u6570
wsRemoteEndpoint.nullHandler=\u7121\u52b9\u306anull\u30cf\u30f3\u30c9\u30e9\u5f15\u6570
wsRemoteEndpoint.sendInterrupt=\u540c\u671f\u9001\u4fe1\u306e\u5b8c\u4e86\u5f85\u3061\u30b9\u30ec\u30c3\u30c9\u306b\u5272\u308a\u8fbc\u307f\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
wsRemoteEndpoint.tooMuchData=Ping \u304a\u3088\u3073 Pong \u306f 125 \u30d0\u30a4\u30c8\u4ee5\u4e0a\u9001\u4fe1\u3067\u304d\u307e\u305b\u3093\u3002
wsRemoteEndpoint.writeTimeout=\u30d6\u30ed\u30c3\u30ad\u30f3\u30b0\u66f8\u304d\u8fbc\u307f\u306e\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
wsRemoteEndpoint.wrongState=\u30ea\u30e2\u30fc\u30c8\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u306e\u72b6\u614b [{0}] \u306f\u547c\u3073\u51fa\u3057\u305f\u30e1\u30bd\u30c3\u30c9\u306b\u5bfe\u3057\u3066\u4e0d\u6b63\u306a\u72b6\u614b\u3067\u3059\u3002

wsSession.closed=WebSocket \u30bb\u30c3\u30b7\u30e7\u30f3 [{0}] \u3092\u5207\u65ad\u3057\u307e\u3057\u305f\u3002\u5207\u65ad\u6e08\u307f\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u306b close() \u4ee5\u5916\u306e\u30e1\u30bd\u30c3\u30c9\u547c\u3073\u51fa\u3057\u3092\u3059\u308b\u3053\u3068\u306f\u3042\u308a\u307e\u305b\u3093\u3002
wsSession.created=WebSocket \u30bb\u30c3\u30b7\u30e7\u30f3 [{0}] \u3092\u4f5c\u6210\u3057\u307e\u3057\u305f\u3002
wsSession.doClose=WebSocket \u30bb\u30c3\u30b7\u30e7\u30f3 [{1}] \u3092\u5207\u65ad\u3057\u307e\u3059\u3002
wsSession.duplicateHandlerBinary=\u30d0\u30a4\u30ca\u30ea\u30e1\u30c3\u30bb\u30fc\u30b8\u30cf\u30f3\u30c9\u30e9\u306f\u65e2\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
wsSession.duplicateHandlerPong=pong\u30e1\u30c3\u30bb\u30fc\u30b8\u30cf\u30f3\u30c9\u30e9\u306f\u65e2\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
wsSession.duplicateHandlerText=\u30c6\u30ad\u30b9\u30c8\u30e1\u30c3\u30bb\u30fc\u30b8\u30cf\u30f3\u30c9\u30e9\u306f\u3059\u3067\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u307e\u3059\u3002
wsSession.flushFailOnClose=\u30bb\u30c3\u30b7\u30e7\u30f3\u5207\u65ad\u6642\u306b\u30d0\u30c3\u30c1\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u30d5\u30e9\u30c3\u30b7\u30e5\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
wsSession.instanceNew=\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u767b\u9332\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
wsSession.invalidHandlerTypePong=pong\u30e1\u30c3\u30bb\u30fc\u30b8\u30cf\u30f3\u30c9\u30e9\u306fMessageHandler.Whole\u3092\u5b9f\u88c5\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
wsSession.messageFailed=WebSocket \u30b3\u30cd\u30af\u30b7\u30e7\u30f3\u304c\u5207\u65ad\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u5b8c\u4e86\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3067\u304d\u307e\u305b\u3093\u3002
wsSession.removeHandlerFailed=\u30bb\u30c3\u30b7\u30e7\u30f3\u306b\u767b\u9332\u3055\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u30cf\u30f3\u30c9\u30e9\u30fc [{0}] \u3092\u89e3\u9664\u3067\u304d\u307e\u305b\u3093\u3002
wsSession.sendCloseFail=\u30bb\u30c3\u30b7\u30e7\u30f3[{0}]\u306e\u30af\u30ed\u30fc\u30ba\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u30ea\u30e2\u30fc\u30c8\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u306b\u9001\u4fe1\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
wsSession.timeout=WebSocket\u30bb\u30c3\u30b7\u30e7\u30f3[{0}]\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u304c\u5207\u308c\u307e\u3057\u305f\u3002
wsSession.unknownHandler=\u8a8d\u8b58\u3067\u304d\u306a\u3044\u30bf\u30a4\u30d7[{1}]\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u30cf\u30f3\u30c9\u30e9[{0}]\u3092\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3002
wsSession.unknownHandlerType=\u8a8d\u8b58\u3067\u304d\u306a\u3044\u578b[{1}]\u3068\u3057\u3066\u30e9\u30c3\u30d7\u3055\u308c\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u30cf\u30f3\u30c9\u30e9[{0}]\u3092\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3002

wsWebSocketContainer.asynchronousSocketChannelFail=\u30b5\u30fc\u30d0\u30fc\u3078\u306e\u63a5\u7d9a\u3092\u958b\u59cb\u3067\u304d\u307e\u305b\u3093\u3002
wsWebSocketContainer.defaultConfiguratorFail=\u65e2\u5b9a\u306e\u30b3\u30f3\u30d5\u30a3\u30b0\u30ec\u30fc\u30bf\u751f\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
wsWebSocketContainer.endpointCreateFail=\u30af\u30e9\u30b9 [{0}] \u306e\u30ed\u30fc\u30ab\u30eb\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
wsWebSocketContainer.failedAuthentication=HTTP\u5fdc\u7b54\u30b3\u30fc\u30c9[{0}]\u3092\u51e6\u7406\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u8a8d\u8a3c\u30d8\u30c3\u30c0\u30fc\u304c\u30b5\u30fc\u30d0\u30fc\u306b\u3088\u3063\u3066\u53d7\u3051\u5165\u308c\u3089\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
wsWebSocketContainer.httpRequestFailed=WebSocket\u63a5\u7d9a\u3092\u958b\u59cb\u3059\u308bHTTP\u30ea\u30af\u30a8\u30b9\u30c8\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
wsWebSocketContainer.invalidExtensionParameters=\u30b5\u30fc\u30d0\u30fc\u306f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u89e3\u91c8\u3067\u304d\u306a\u3044\u62e1\u5f35\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3067\u5fdc\u7b54\u3057\u307e\u3057\u305f\u3002
wsWebSocketContainer.invalidHeader=\u30d8\u30c3\u30c0\u30fc\u540d\u3068\u5024\u306e\u533a\u5207\u308a\u6587\u5b57(\u30b3\u30ed\u30f3)\u304c\u306a\u3044 HTTP \u30d8\u30c3\u30c0\u30fc [{0}] \u306f\u89e3\u91c8\u3067\u304d\u306a\u3044\u305f\u3081\u7121\u8996\u3057\u307e\u3059\u3002
wsWebSocketContainer.invalidStatus=\u30b5\u30fc\u30d0\u30fc[{0}]\u304b\u3089\u306eHTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u304cWebSocket\u3078\u306eHTTP\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3092\u8a31\u53ef\u3057\u307e\u305b\u3093\u3067\u3057\u305f\u3002
wsWebSocketContainer.invalidSubProtocol=WebSocket\u30b5\u30fc\u30d0\u30fc\u306f\u3001Sec-WebSocket-Protocol\u30d8\u30c3\u30c0\u30fc\u306b\u8907\u6570\u306e\u5024\u3092\u8fd4\u3057\u307e\u3057\u305f\u3002
wsWebSocketContainer.maxBuffer=\u3053\u306e\u5b9f\u88c5\u306f\u30d0\u30c3\u30d5\u30a1\u306e\u6700\u5927\u30b5\u30a4\u30ba\u3092Integer.MAX_VALUE\u306b\u5236\u9650\u3057\u307e\u3059\u3002
wsWebSocketContainer.missingAnnotation=POJO\u30af\u30e9\u30b9[{0}]\u306f@ClientEndpoint\u3067\u30a2\u30ce\u30c6\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002
wsWebSocketContainer.missingLocationHeader=HTTP \u30ec\u30b9\u30dd\u30f3\u30b9\u30b3\u30fc\u30c9 [{0}] \u3092\u51e6\u7406\u3067\u304d\u307e\u305b\u3093\u3002\u30ec\u30b9\u30dd\u30f3\u30b9\u306b Location \u30d8\u30c3\u30c0\u30fc\u304c\u3042\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
wsWebSocketContainer.missingWWWAuthenticateHeader=HTTP \u5fdc\u7b54\u30b3\u30fc\u30c9 [{0}] \u3092\u51e6\u7406\u3067\u304d\u307e\u305b\u3093\u3002\u5fdc\u7b54\u30d8\u30c3\u30c0\u30fc\u306b WWW-Authenticate \u30d8\u30c3\u30c0\u30fc\u304c\u3042\u308a\u307e\u305b\u3093\u3002
wsWebSocketContainer.pathNoHost=URI\u306b\u30db\u30b9\u30c8\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093
wsWebSocketContainer.pathWrongScheme=\u30b9\u30ad\u30fc\u30de[{0}]\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u30b9\u30ad\u30fc\u30de\u306fws\u3068wss\u3067\u3059
wsWebSocketContainer.proxyConnectFail=\u8a2d\u5b9a\u3055\u308c\u305f\u30d7\u30ed\u30ad\u30b7[{0}]\u306b\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30b3\u30fc\u30c9\u306f[{1}]\u3067\u3057\u305f\u3002
wsWebSocketContainer.redirectThreshold=Location\u30d8\u30c3\u30c0\u30fc [{0}] \u306e\u5faa\u74b0\u3092\u691c\u51fa\u3001\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u56de\u6570 [{1}] \u304c\u4e0a\u9650\u5024 [{2}] \u3092\u8d85\u904e\u3057\u307e\u3057\u305f\u3002
wsWebSocketContainer.sessionCloseFail=ID [{0}] \u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u306f\u6b63\u5e38\u306b\u5207\u65ad\u3057\u307e\u305b\u3093\u3067\u3057\u305f\u3002
wsWebSocketContainer.shutdown=Web\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u505c\u6b62\u4e2d\u3067\u3059
wsWebSocketContainer.sslEngineFail=SSL/TLS \u63a5\u7d9a\u306e\u305f\u3081\u306e SSL \u30a8\u30f3\u30b8\u30f3\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
wsWebSocketContainer.unsupportedAuthScheme=HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30b3\u30fc\u30c9[{0}]\u3092\u51e6\u7406\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u8a8d\u8a3c\u30b9\u30ad\u30fc\u30e0[{1}]\u304c\u30ec\u30b9\u30dd\u30f3\u30b9\u3067\u8fd4\u3055\u308c\u307e\u3057\u305f\u3002
