# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

domainFilterInterceptor.member.refused=\u30e1\u30f3\u30d0\u30fc\u306f\u30af\u30e9\u30b9\u30bf\u30fc [{0}] \u3078\u306e\u53c2\u52a0\u3092\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\u3002
domainFilterInterceptor.message.refused=\u30af\u30e9\u30b9\u30bf\u30fc [{0}] \u304b\u3089\u53d7\u4fe1\u3057\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\u3002

encryptInterceptor.algorithm.required=\u6697\u53f7\u5316\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u304c\u5fc5\u8981\u3067\u3059\u3002\u5b8c\u5168\u6307\u5b9a\u3002 AES/CBC/PKCS5Padding
encryptInterceptor.algorithm.unsupported-mode=EncryptInterceptor\u306f\u30d6\u30ed\u30c3\u30af\u6697\u53f7\u30e2\u30fc\u30c9 [{0}]\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
encryptInterceptor.decrypt.error.short-message=\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u5fa9\u53f7\u306b\u5931\u6557: \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u672b\u5c3e\u304c\u9014\u5207\u308c\u3066\u3044\u307e\u3059
encryptInterceptor.decrypt.failed=\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u5fa9\u53f7\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
encryptInterceptor.encrypt.failed=\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u6697\u53f7\u5316\u3067\u304d\u307e\u305b\u3093\u3002
encryptInterceptor.init.failed=EncryptInterceptor\u306e\u521d\u671f\u5316\u306b\u5931\u6557\u3057\u307e\u3057\u305f
encryptInterceptor.key.required=\u6697\u53f7\u5316\u30ad\u30fc\u304c\u5fc5\u8981\u3067\u3059\u3002
encryptInterceptor.tcpFailureDetector.ordering=EncryptInterceptor\u306fTcpFailureDetector\u306e\u4e0a\u6d41\u306b\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002 \u30c1\u30e3\u30cd\u30eb\u30a4\u30f3\u30bf\u30fc\u30bb\u30d7\u30bf\u30fc\u30d1\u30a4\u30d7\u30e9\u30a4\u30f3\u306eTcpFailureDetector\u306e\u524d\u306b\u30ea\u30b9\u30c8\u3055\u308c\u308b\u3088\u3046\u306bEncryptInterceptor\u3092\u518d\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002

fragmentationInterceptor.fragments.missing=\u30d5\u30e9\u30b0\u30e1\u30f3\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
fragmentationInterceptor.heartbeat.failed=fragmentationInterceptor\u3067\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u3092\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3002

gzipInterceptor.compress.failed=\u30d0\u30a4\u30c8\u30c7\u30fc\u30bf\u3092\u5727\u7e2e\u3067\u304d\u307e\u305b\u3093\u3002
gzipInterceptor.decompress.failed=\u5727\u7e2e\u3055\u308c\u305f\u30d0\u30a4\u30c8\u30c7\u30fc\u30bf\u3092\u5c55\u958b\u3067\u304d\u307e\u305b\u3093\u3002

messageDispatchInterceptor.AsyncMessage.failed=\u975e\u540c\u671f\u30e1\u30c3\u30bb\u30fc\u30b8\u51e6\u7406\u4e2d\u306e\u30a8\u30e9\u30fc
messageDispatchInterceptor.completeMessage.failed=\u5b8c\u4e86\u3057\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u5831\u544a\u3067\u304d\u307e\u305b\u3093\u3002
messageDispatchInterceptor.errorMessage.failed=\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8fd4\u3059\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
messageDispatchInterceptor.queue.full=\u975e\u540c\u671f\u30ad\u30e5\u30fc\u304c\u6e80\u676f\u3067\u3059\u3002\u73fe\u5728\u306f [{1}] \u30d0\u30a4\u30c8\u3067\u4e0a\u9650\u306e [{0}] \u30d0\u30a4\u30c8\u306b\u9054\u3057\u3066\u3044\u307e\u3059\u3002
messageDispatchInterceptor.unableAdd.queue=\u975e\u540c\u671f\u30ad\u30e5\u30fc\u306b\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u767b\u9332\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30ad\u30e5\u30fc\u306e\u4e0d\u5177\u5408\u304b\u3082\u3057\u308c\u307e\u305b\u3093\u3002
messageDispatchInterceptor.warning.optionflag=\u8b66\u544a: \u975e\u540c\u671f\u30aa\u30d7\u30b7\u30e7\u30f3\u30d5\u30e9\u30b0\u3092\u4e0a\u66f8\u304d\u3057\u305f\u305f\u3081\u3001\u4ed6\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u4f7f\u7528\u3059\u308b\u53ef\u80fd\u6027\u306e\u3042\u308b Channel.SEND_OPTIONS_ASYNCHRONOUS \u306f\u7121\u52b9\u5316\u3055\u308c\u307e\u3059\u3002

nonBlockingCoordinator.electionMessage.sendfailed=\u30e1\u30f3\u30d0\u30fc [{0}] \u306b\u8abf\u505c\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3067\u304d\u307e\u305b\u3093\u3002
nonBlockingCoordinator.heartbeat.failed=\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u3092\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3002
nonBlockingCoordinator.heartbeat.inconsistency=\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u304c\u4e0d\u4e00\u81f4\u3092\u767a\u898b\u3057\u3001\u30a4\u30ec\u30af\u30b7\u30e7\u30f3\u3092\u518d\u958b\u3057\u307e\u3059\u3002
nonBlockingCoordinator.memberAdded.failed=\u30e1\u30f3\u30d0\u30fc\u304c\u8ffd\u52a0\u3055\u308c\u305f\u3068\u304d\u306b\u30a4\u30ec\u30af\u30b7\u30e7\u30f3\u3092\u958b\u59cb\u3067\u304d\u307e\u305b\u3093\u3002
nonBlockingCoordinator.memberAlive.failed=\u52d5\u4f5c\u30c1\u30a7\u30c3\u30af\u304c\u5b9f\u884c\u3067\u304d\u306a\u304b\u3063\u305f\u305f\u3081\u3001\u30e1\u30f3\u30d0\u30fc\u306f\u505c\u6b62\u3057\u3066\u3044\u308b\u3082\u306e\u3068\u3057\u3066\u6271\u3044\u307e\u3059\u3002
nonBlockingCoordinator.memberDisappeared.failed=\u30e1\u30f3\u30d0\u30fc\u304c\u524a\u9664\u3055\u308c\u305f\u3068\u304d\u306b\u30a4\u30ec\u30af\u30b7\u30e7\u30f3\u3092\u958b\u59cb\u3067\u304d\u307e\u305b\u3093\u3002
nonBlockingCoordinator.processCoordinationMessage.failed=\u8abf\u505c\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u51e6\u7406\u4e2d\u306e\u30a8\u30e9\u30fc\u3002\u81f4\u547d\u7684\u306a\u554f\u984c\u304c\u767a\u751f\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002

orderInterceptor.messageAdded.sameCounter=\u540c\u3058\u30ab\u30a6\u30f3\u30bf\u306b\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u8ffd\u52a0\u3055\u308c\u307e\u3057\u305f\u3002\u540c\u671f\u30d0\u30b0\u304c\u3042\u308a\u307e\u3059\u3002 Order \u30a4\u30f3\u30bf\u30fc\u30bb\u30d7\u30bf\u3092\u7121\u52b9\u306b\u3057\u3066\u4e0b\u3055\u3044\u3002

staticMembershipInterceptor.no.failureDetector=TcpFailureDetector \u304c\u3042\u308a\u307e\u305b\u3093\u3002\u9759\u7684\u30e1\u30f3\u30d0\u30fc\u306e\u81ea\u52d5\u691c\u51fa\u6a5f\u80fd\u306f\u6b63\u5e38\u306b\u52d5\u4f5c\u3057\u307e\u305b\u3093\u3002TcpFailureDetector \u914d\u4e0b\u306b StaticMembershipInterceptor \u3092\u5b9a\u7fa9\u3059\u308c\u3070\u3001\u9759\u7684\u30e1\u30f3\u30d0\u30fc\u306e\u81ea\u52d5\u691c\u51fa\u6a5f\u80fd\u304c\u52d5\u4f5c\u3059\u308b\u3067\u3057\u3087\u3046\u3002
staticMembershipInterceptor.no.pingInterceptor=TcpPingInterceptor\u304c\u5b58\u5728\u3057\u306a\u3044\u305f\u3081\u3001\u9759\u7684\u30e1\u30f3\u30d0\u30fc\u306e\u30d8\u30eb\u30b9\u30c1\u30a7\u30c3\u30af\u306f\u6b63\u5e38\u306b\u6a5f\u80fd\u3057\u307e\u305b\u3093\u3002TcpPingInterceptor\u3092\u5b9a\u7fa9\u3059\u308c\u3070\u6a5f\u80fd\u3059\u308b\u3067\u3057\u3087\u3046\u3002
staticMembershipInterceptor.sendLocalMember.failed=\u30ed\u30fc\u30ab\u30eb\u30e1\u30f3\u30d0\u30fc\u306e\u901a\u77e5\u306f\u5931\u6557\u3057\u307e\u3057\u305f\u3002
staticMembershipInterceptor.sendShutdown.failed=\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u901a\u77e5\u304c\u5931\u6557\u3057\u307e\u3057\u305f

tcpFailureDetector.already.disappeared=\u691c\u8a3c\u5b8c\u4e86\u3002\u30e1\u30f3\u30d0\u30fc\u306f\u3059\u3067\u306b\u96e2\u8131\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u307e\u3057\u305f [{0}]
tcpFailureDetector.failureDetection.failed=\u6545\u969c\u691c\u51fa\u30c1\u30a7\u30c3\u30af\u304c\u5b9f\u884c\u3067\u304d\u306a\u3044\u305f\u3081\u3001\u30e1\u30f3\u30d0\u30fc\u304c\u505c\u6b62\u3057\u3066\u3044\u308b\u3082\u306e\u3068\u3057\u3066\u6271\u3044\u307e\u3059\u3002
tcpFailureDetector.heartbeat.failed=TcpFailureDetector \u306e\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u30c1\u30a7\u30c3\u30af\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
tcpFailureDetector.member.disappeared=\u30e1\u30f3\u30d0\u691c\u8a3c\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002 \u30e1\u30f3\u30d0\u30fc\u304c\u6d88\u3048\u307e\u3057\u305f[{0}]
tcpFailureDetector.memberDisappeared.verify=memberDisappeared[{0}]\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u53d7\u4fe1\u3057\u307e\u3057\u305f\u3002 \u30e1\u30f3\u30d0\u691c\u8a3c\u3057\u307e\u3059\u3002
tcpFailureDetector.performBasicCheck.memberAdded=\u79c1\u305f\u3061\u306b\u901a\u77e5\u3055\u308c\u306a\u304b\u3063\u305f\u306b\u3082\u304b\u304b\u308f\u3089\u305a\u3001\u30e1\u30f3\u30d0\u30fc\u304c\u8ffd\u52a0\u3055\u308c\u307e\u3057\u305f\uff1a[{0}]
tcpFailureDetector.still.alive=\u6545\u969c\u691c\u51fa\u30c1\u30a7\u30c3\u30af\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002\u30e1\u30f3\u30d0\u30fc [{0}] \u306f\u6b63\u5e38\u3067\u3059\u3002
tcpFailureDetector.suspectMember.alive=\u7591\u308f\u3057\u3044\u30af\u30e9\u30b9\u30bf\u30e1\u30f3\u30d0\u30fc\u306e\u751f\u5b58\u3092\u78ba\u8a8d\u3057\u307e\u3057\u305f\u3002 [{0}]
tcpFailureDetector.suspectMember.dead=\u7591\u7fa9\u30e1\u30f3\u30d0\u304c\u6b7b\u4ea1\u3057\u305f\u3053\u3068\u304c\u78ba\u8a8d\u3055\u308c\u307e\u3057\u305f\u3002[{0}]

tcpPingInterceptor.ping.failed=TCP \u306e ping \u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
tcpPingInterceptor.pingFailed.pingThread=TCP ping\u30b9\u30ec\u30c3\u30c9\u304b\u3089ping\u3092\u9001\u4fe1\u3067\u304d\u307e\u305b\u3093\u3002

throughputInterceptor.report=ThroughputInterceptor Report[\n\
\        \u9001\u4fe1\u30e1\u30c3\u30bb\u30fc\u30b8 (Tx Msg):{0} messages\n\
\        \u9001\u4fe1\u6e08\u307f (Sent):{1} MB (total)\n\
\        \u9001\u4fe1\u6e08\u307f (Sent):{2} MB (application)\n\
\        \u6642\u9593 (Time):{3} seconds\n\
\        \u9001\u4fe1\u901f\u5ea6 (Tx Speed):{4} MB/sec (total)\n\
\        \u9001\u4fe1\u901f\u5ea6 (Tx Speed):{5} MB/sec (application)\n\
\        \u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8 (Error Msg):{6}\n\
\        \u53d7\u4fe1\u30e1\u30c3\u30bb\u30fc\u30b8 (Rx Msg):{7} messages\n\
\        \u53d7\u4fe1\u901f\u5ea6 (Rx Speed):{8} MB/sec (since 1st msg)\n\
\        \u53d7\u4fe1\u6e08\u307f (Received):{9} MB]

twoPhaseCommitInterceptor.heartbeat.failed=TwoPhaseCommit \u30a4\u30f3\u30bf\u30fc\u30bb\u30d7\u30bf\u30fc\u306e\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
twoPhaseCommitInterceptor.originalMessage.missing=\u78ba\u8a8d\u3092\u53d7\u4fe1\u3057\u307e\u3057\u305f\u304c\u3001\u5143\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u3042\u308a\u307e\u305b\u3093\u3002 Id\uff1a[{0}]
