# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

webappClassLoader.addExportsJavaIo=Java 9 \ub610\ub294 \uc774\ud6c4 \ubc84\uc804\uc744 \uc0ac\uc6a9\ud560 \ub54c\uc5d0\ub294, "--add-opens=java.base/java.io={0}" \uc744(\ub97c) JVM \uba85\ub839\ud589 \uc544\uaddc\uba3c\ud2b8\ub4e4\uc5d0 \ucd94\uac00\ud574\uc11c, ObjectStream \uce90\uc2dc \uba54\ubaa8\ub9ac \ub9ad \ubc29\uc9c0 \uc635\uc158\uc744 \ud65c\uc131\ud654\ud560 \ud544\uc694\uac00 \uc788\uc2b5\ub2c8\ub2e4. \ub610\ub294 \uc6d0\ud558\uc2dc\ub294 \uacbd\uc6b0, ObjectStream \ud074\ub798\uc2a4 \uce90\uc2dc \uba54\ubaa8\ub9ac \ub9ad \ubc29\uc9c0 \uc635\uc158\uc744 \ube44\ud65c\uc131\ud654\ud574\uc11c \uc774 \uacbd\uace0 \uba54\uc2dc\uc9c0\ub97c \uc5c6\uc568 \uc218\ub3c4 \uc788\uc2b5\ub2c8\ub2e4.
webappClassLoader.addExportsRmi=Java 9\uc5d0\uc11c \uc2e4\ud589\ud558\uba74\uc11c RMI Target \uba54\ubaa8\ub9ac \ub204\uc218 \ud0d0\uc9c0\ub97c \uc0ac\uc6a9 \uac00\ub2a5\ud558\uac8c \ud558\ub824\uba74, "--add-opens=java.rmi/sun.rmi.transport=ALL-UNNAMED"\ub97c JVM \uba85\ub839 \ud589 \uc544\uaddc\uba3c\ud2b8\uc5d0 \ucd94\uac00\ud574\uc57c \ud569\ub2c8\ub2e4. \ub610\ub294, RMI Target \uba54\ubaa8\ub9ac \ub204\uc218 \ud0d0\uc9c0\ub97c \uc0ac\uc6a9\ubd88\ub2a5 \uc0c1\ud0dc\ub85c \uc124\uc815\ud568\uc73c\ub85c\uc368, \uc774 \uacbd\uace0\ub97c \uc5c6\uc568 \uc218\ub3c4 \uc788\uc2b5\ub2c8\ub2e4.
webappClassLoader.addExportsThreadLocal=Java 9 \ud658\uacbd\uc5d0\uc11c \uc2e4\ud589\ud560 \ub54c\uc5d0\ub294, ThreadLocal \uba54\ubaa8\ub9ac \ub204\uc218 \ud0d0\uc9c0\ub97c \uc704\ud558\uc5ec, "--add-opens=java.base/java.lang=ALL-UNNAMED"\ub97c JVM \uba85\ub839 \ud589 \uc544\uaddc\uba3c\ud2b8\ub4e4\uc5d0 \ucd94\uac00\ud574\uc57c \ud569\ub2c8\ub2e4. \ub610\ub294, ThreadLocal \uba54\ubaa8\ub9ac \ub204\uc218 \ud0d0\uc9c0\ub97c \uc0ac\uc6a9\ubd88\ub2a5 \uc0c1\ud0dc\ub85c \uc124\uc815\ud568\uc73c\ub85c\uc368, \uc774 \uacbd\uace0 \uba54\uc2dc\uc9c0\ub97c \uc5c6\uc568 \uc218\ub3c4 \uc788\uc2b5\ub2c8\ub2e4.
webappClassLoader.addPermissionNoCanonicalFile=URL [{0}](\uc73c)\ub85c\ubd80\ud130 canonical \ud30c\uc77c \uacbd\ub85c\ub97c \uc5bb\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
webappClassLoader.addPermissionNoProtocol=URL [{1}] \ub0b4\uc758 \ud504\ub85c\ud1a0\ucf5c [{0}]\uc740(\ub294) \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc73c\ubbc0\ub85c, \uc774 URL\uc758 \ub9ac\uc18c\uc2a4\uc5d0 \ub300\ud55c \uc77d\uae30\uac00 \uc2b9\uc778\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
webappClassLoader.addTransformer=\ud074\ub798\uc2a4 \ud30c\uc77c Transformer [{0}]\uc744(\ub97c) \uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{1}]\uc5d0 \ucd94\uac00\ud588\uc2b5\ub2c8\ub2e4.
webappClassLoader.addTransformer.duplicate=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{1}]\uc5d0 \ud074\ub798\uc2a4 \ud30c\uc77c \ubcc0\ud658\uae30 [{0}]\uc744(\ub97c) \ucd94\uac00\ud558\uae30 \uc704\ud55c, \uc911\ubcf5\ub41c \ud638\ucd9c\uc744 \ubb34\uc2dc\ud569\ub2c8\ub2e4.
webappClassLoader.addTransformer.illegalArgument=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{0}]\uc774(\uac00) \ub110\uc778, \ud074\ub798\uc2a4 \ud30c\uc77c Transformer\uc744 \ucd94\uac00\ud558\ub824 \uc2dc\ub3c4\ud588\uc2b5\ub2c8\ub2e4.
webappClassLoader.checkThreadLocalsForLeaks=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{0}]\uc774(\uac00), \ud0c0\uc785 [{1}]\uc778 \ud0a4\uc640 (\uac12: [{2}]) \ud0c0\uc785 [{3}]\uc778 \uac12\uc744 (\uac12: [{4}]) \uc0ac\uc6a9\ud558\uc5ec ThreadLocal \uac1d\uccb4\ub97c \uc0dd\uc131\ud588\uc9c0\ub9cc, \uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc774 \uc911\uc9c0\ub420 \ub54c \uadf8\uac83\uc744 \uc81c\uac70\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4. \ud639\uc2dc \uc788\uc744 \ubc95\ud55c \uba54\ubaa8\ub9ac \ub204\uc218\ub97c \ubc29\uc9c0\ud558\uae30 \uc704\ud558\uc5ec, \uc2dc\uac04\uc744 \ub450\uace0 \uc4f0\ub808\ub4dc\ub4e4\uc744 \uc7ac\uc0dd\uc131\ud560 \uac83\uc785\ub2c8\ub2e4.
webappClassLoader.checkThreadLocalsForLeaks.badKey=\ud0c0\uc785\uc774 [{0}]\uc778 \ud0a4\uc758 \ubb38\uc790\uc5f4 representation\uc744 \uacb0\uc815\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
webappClassLoader.checkThreadLocalsForLeaks.badValue=\ud0c0\uc785\uc774 [{0}]\uc778 \uac12\uc758 \ubb38\uc790\uc5f4 representation\uc744 \uacb0\uc815\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
webappClassLoader.checkThreadLocalsForLeaks.unknown=\uc54c \uc218 \uc5c6\uc74c
webappClassLoader.checkThreadLocalsForLeaksFail=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{0}]\uc744(\ub97c) \uc704\ud55c ThreadLocal \ucc38\uc870\ub4e4\uc5d0 \ub300\ud55c \uc810\uac80\uc774 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
webappClassLoader.checkThreadLocalsForLeaksNone=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{0}]\uc774(\uac00), \ud0c0\uc785 [{1}]\uc758 \ud0a4(\uac12: [{2}])\uc640 \ud0c0\uc785 [{3}]\uc758 \uac12(\uac12: [{4}])\uc744 \uc0ac\uc6a9\ud558\uc5ec, ThreadLocal Map\uc744 \uc0dd\uc131\ud588\uc2b5\ub2c8\ub2e4. \ud574\ub2f9 ThreadLocal Map\uc740 weak \ud0a4\ub4e4\uc744 \uc720\uc9c0\ud558\uace0 \uc788\uae30 \ub54c\ubb38\uc5d0, \uc774\ub294 \uba54\ubaa8\ub9ac \ub204\uc218\uac00 \uc544\ub2d9\ub2c8\ub2e4.
webappClassLoader.checkThreadLocalsForLeaksNull=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{0}]\uc774(\uac00), \ud0c0\uc785 [{1}]\uc778 \ud0a4\ub97c (\uac12: [{2}]) \uc0ac\uc6a9\ud558\uc5ec ThreadLocal \uac1d\uccb4\ub97c \uc0dd\uc131\ud588\uc2b5\ub2c8\ub2e4. \ud574\ub2f9 ThreadLocal \uac1d\uccb4\uac00 \uc62c\ubc14\ub974\uac8c \ub110\ub85c \uc124\uc815\ub418\uc5c8\uc73c\ubbc0\ub85c, \ud574\ub2f9 \ud0a4\ub294 GC\uc5d0 \uc758\ud574 \uc81c\uac70 \ub420 \uac83\uc785\ub2c8\ub2e4.
webappClassLoader.checkThreadsHttpClient=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 \ud074\ub798\uc2a4\ub85c\ub354\ub97c \uc0ac\uc6a9\ud558\ub294 HttpClient keep-alive \uc4f0\ub808\ub4dc\ub97c \ubc1c\uacac\ud588\uc2b5\ub2c8\ub2e4. \uc4f0\ub808\ub4dc\uc758 \ud074\ub798\uc2a4\ub85c\ub354\ub97c \ubd80\ubaa8 \ud074\ub798\uc2a4\ub85c\ub354\ub85c \uc804\ud658\uc2dc\ucf30\uc2b5\ub2c8\ub2e4.
webappClassLoader.clearJdbc=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{0}]\uc774(\uac00) JDBC \ub4dc\ub77c\uc774\ubc84 [{1}]\uc744(\ub97c) \ub4f1\ub85d\ud588\uc9c0\ub9cc, \uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc774 \uc911\uc9c0\ub420 \ub54c, \ud574\ub2f9 JDBC \ub4dc\ub77c\uc774\ubc84\uc758 \ub4f1\ub85d\uc744 \uc81c\uac70\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4. \uba54\ubaa8\ub9ac \ub204\uc218\ub97c \ubc29\uc9c0\ud558\uae30 \uc704\ud558\uc5ec, \ub4f1\ub85d\uc744 \uac15\uc81c\ub85c \uc81c\uac70\ud588\uc2b5\ub2c8\ub2e4.
webappClassLoader.clearObjectStreamClassCachesFail=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{0}]\uc744(\ub97c) \uc704\ud574, ObjectStreamClass$Caches\ub85c\ubd80\ud130 soft references\ub97c \ud3d0\uae30\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
webappClassLoader.clearRmi=\uc2a4\ud141 \ud074\ub798\uc2a4 [{0}]\uc640(\uacfc) \uac12 [{1}]\uc744(\ub97c) \uac00\uc9c4 RMI Target\uc744 \ubc1c\uacac\ud588\uc2b5\ub2c8\ub2e4. \uc774 RMI Target\uc740 \uba54\ubaa8\ub9ac \ub204\uc218\ub97c \ubc29\uc9c0\ud558\uae30 \uc704\ud558\uc5ec \uac15\uc81c\ub85c \uc81c\uac70\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
webappClassLoader.clearRmiFail=sun.rmi.transport.Target\uc73c\ub85c\ubd80\ud130 \ucc38\uc870\ub41c \ucee8\ud14d\uc2a4\ud2b8 \ud074\ub798\uc2a4\ub85c\ub354\ub97c, \uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{0}]\uc744(\ub97c) \uc704\ud574, \ud3d0\uae30\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
webappClassLoader.clearRmiInfo=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{0}]\uc744(\ub97c) \uc704\ud55c \ucee8\ud14d\uc2a4\ud2b8 \ud074\ub798\uc2a4\ub85c\ub354\ub97c \ud3d0\uae30\ud558\uae30 \uc704\ud55c, \ud074\ub798\uc2a4 sun.rmi.transport.Target\uc744 \ucc3e\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4. \uc774\ub294 Sun JVM\ub4e4\uc774 \uc544\ub2cc \ud658\uacbd\uc5d0\uc11c \ubc1c\uc0dd\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
webappClassLoader.getThreadGroupError=ThreadGroup [{0}]\uc758 \ubd80\ubaa8 ThreadGroup\uc744 \uc5bb\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc7a0\uc7ac\uc801\uc778 \uba54\ubaa8\ub9ac \ub204\uc218 \ubb38\uc81c\ub97c \ucc3e\uae30 \uc704\ud574 \ubaa8\ub4e0 \uc4f0\ub808\ub4dc\ub4e4\uc744 \uc810\uac80\ud558\ub294 \uac83\uc774 \ubd88\uac00\ub2a5\ud569\ub2c8\ub2e4.
webappClassLoader.jarsAdded=\ud558\ub098 \uc774\uc0c1\uc758 JAR\ub4e4\uc774 \uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{0}]\uc5d0 \ucd94\uac00\ub410\uc2b5\ub2c8\ub2e4.
webappClassLoader.jarsModified=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{0}]\uc5d0\uc11c \ud558\ub098 \uc774\uc0c1\uc758 JAR \ud30c\uc77c(\ub4e4)\uc774 \ubcc0\uacbd\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
webappClassLoader.jarsRemoved=\ud558\ub098 \uc774\uc0c1\uc758 JAR\ub4e4\uc774 \uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{0}](\uc73c)\ub85c\ubd80\ud130 \uc81c\uac70\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
webappClassLoader.javaseClassLoaderNull=j2seClassLoader \uc18d\uc131\uc774 \ub110\uc774\uc5b4\uc11c\ub294 \uc548\ub429\ub2c8\ub2e4.
webappClassLoader.jdbcRemoveFailed=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{0}]\uc744(\ub97c) \uc704\ud55c JDBC \ub4dc\ub77c\uc774\ubc84\uc758 \ub4f1\ub85d\uc744 \uc81c\uac70\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
webappClassLoader.loadedByThisOrChildFail=\ucee8\ud14d\uc2a4\ud2b8 [{1}]\uc5d0\uc11c \uc7a0\uc7ac\uc801 \uba54\ubaa8\ub9ac \ub204\uc218\ub97c \ubc29\uc9c0\ud558\uae30 \uc704\ud574, [{0}] \ud074\ub798\uc2a4\uc758 \uc778\uc2a4\ud134\uc2a4 \ub0b4\uc5d0 \uc788\ub294 \uc5d4\ud2b8\ub9ac\ub4e4\uc744 \ubaa8\ub450 \uc810\uac80\ud558\ub824\ub294 \uc2dc\ub3c4\uac00 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
webappClassLoader.readError=\ub9ac\uc18c\uc2a4 \uc77d\uae30 \uc624\ub958 : [{0}]\uc744(\ub97c) \ub85c\ub4dc\ud560 \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.
webappClassLoader.removeTransformer=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{1}](\uc73c)\ub85c\ubd80\ud130 \ud074\ub798\uc2a4 \ud30c\uc77c Transformer [{0}]\uc744(\ub97c) \uc81c\uac70\ud588\uc2b5\ub2c8\ub2e4.
webappClassLoader.resourceModified=\ub9ac\uc18c\uc2a4 [{0}]\uc774(\uac00) \ubcc0\uacbd\ub41c \uc801\uc774 \uc788\uc2b5\ub2c8\ub2e4. \ucd5c\uc885 \ubcc0\uacbd \uc2dc\uac04\uc774 [{1}]\uc774\uc5c8\ub294\ub370, \uc774\uc81c [{2}](\uc73c)\ub85c \ubc14\ub00c\uc5c8\uc2b5\ub2c8\ub2e4.
webappClassLoader.stackTrace=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{0}]\uc774(\uac00) [{1}](\uc774)\ub77c\ub294 \uc774\ub984\uc758 \uc4f0\ub808\ub4dc\ub97c \uc2dc\uc791\uc2dc\ud0a8 \uac83\uc73c\ub85c \ubcf4\uc774\uc9c0\ub9cc, \ud574\ub2f9 \uc4f0\ub808\ub4dc\ub97c \uc911\uc9c0\uc2dc\ud0a4\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4. \uc774\ub294 \uba54\ubaa8\ub9ac \ub204\uc218\ub97c \uc720\ubc1c\ud560 \uac00\ub2a5\uc131\uc774 \ud07d\ub2c8\ub2e4. \ud574\ub2f9 \uc4f0\ub808\ub4dc\uc758 \uc2a4\ud0dd \ud2b8\ub808\uc774\uc2a4:{2}
webappClassLoader.stackTraceRequestThread=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{0}]\uc774(\uac00) \uc5ec\uc804\ud788 \uc644\ub8cc\ub418\uc9c0 \uc54a\uc740 \uc694\uccad\uc744 \ucc98\ub9ac\ud558\uace0 \uc788\uc2b5\ub2c8\ub2e4. \uc774\ub294 \uba54\ubaa8\ub9ac \ub204\uc218\ub97c \uc720\ubc1c\ud560 \uac00\ub2a5\uc131\uc774 \ub192\uc2b5\ub2c8\ub2e4. \ud45c\uc900 \ucee8\ud14d\uc2a4\ud2b8 \uad6c\ud604\uc758 unloadDelay \uc18d\uc131\uc744 \uc774\uc6a9\ud558\uc5ec, \uc694\uccad \uc644\ub8cc \ud5c8\uc6a9 \uc2dc\uac04\uc744 \ud1b5\uc81c\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \uc694\uccad \ucc98\ub9ac \uc4f0\ub808\ub4dc\uc758 \uc2a4\ud0dd \ud2b8\ub808\uc774\uc2a4:[{2}]
webappClassLoader.stopThreadFail=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{1}]\uc744 \uc704\ud55c, [{0}](\uc774)\ub77c\ub294 \uc774\ub984\uc758 \uc4f0\ub808\ub4dc\ub97c \uc885\ub8cc\uc2dc\ud0a4\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
webappClassLoader.stopTimerThreadFail=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{1}]\uc744(\ub97c) \uc704\ud55c, [{0}](\uc774)\ub77c\ub294 \uc774\ub984\uc758 TimerThread\ub97c \uc885\ub8cc\uc2dc\ud0a4\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
webappClassLoader.stopped=\ubd88\ud5c8\ub418\ub294 \uc811\uadfc: \uc774 \uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 \uc778\uc2a4\ud134\uc2a4\ub294 \uc774\ubbf8 \uc911\uc9c0\ub418\uc5c8\uc2b5\ub2c8\ub2e4. [{0}]\uc744(\ub97c) \ub85c\ub4dc\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \ub514\ubc84\uadf8 \ubaa9\uc801 \ubc0f \ubd88\ud5c8\ub418\ub294 \uc811\uadfc\uc744 \ubc1c\uc0dd\uc2dc\ud0a8 \ud574\ub2f9 \uc4f0\ub808\ub4dc\ub97c \uc885\ub8cc\uc2dc\ud0a4\uae30 \uc704\ud55c \uc2dc\ub3c4\ub85c\uc11c, \ub2e4\uc74c \uc2a4\ud0dd \ud2b8\ub808\uc774\uc2a4\uac00 \uc0dd\uc131\ub429\ub2c8\ub2e4.
webappClassLoader.superCloseFail=\ubd80\ubaa8 \ud074\ub798\uc2a4\uc758 close() \ud638\ucd9c \uc2dc \uc2e4\ud328 \ubc1c\uc0dd
webappClassLoader.transformError=Instrumentation \uc624\ub958: \ud074\ub798\uc2a4 \ud30c\uc77c \ud3ec\ub9f7\uc774 \uaddc\uc57d\uc744 \ub530\ub974\uc9c0 \uc54a\uae30 \ub54c\ubb38\uc5d0, \ud074\ub798\uc2a4 [{0}]\uc744(\ub97c) \ubcc0\ud658\uc2dc\ud0ac \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.
webappClassLoader.warnTimerThread=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 [{0}]\uc774(\uac00) java.util.Timer API\ub97c \ud1b5\ud574 [{1}](\uc774)\ub77c\ub294 \uc774\ub984\uc744 \uac00\uc9c4 TimerThread\ub97c \uc2dc\uc791\ud55c \uac83\uc73c\ub85c \ubcf4\uc774\uc9c0\ub9cc, \uadf8 \uc4f0\ub808\ub4dc\ub97c \uc911\uc9c0\uc2dc\ud0a4\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4. \uba54\ubaa8\ub9ac \ub204\uc218\ub97c \ubc29\uc9c0\ud558\uae30 \uc704\ud574, \ud0c0\uc774\uba38\uac00 (\uc5f0\uad00\ub41c \uc4f0\ub808\ub4dc\uc640 \ud568\uaed8) \uac15\uc81c\ub85c \ucde8\uc18c\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
webappClassLoader.wrongVersion=(\ud074\ub798\uc2a4 [{0}]\uc744(\ub97c) \ub85c\ub4dc\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4)

webappClassLoaderParallel.registrationFailed=org.apache.catalina.loader.ParallelWebappClassLoader\ub97c \ubcd1\ub82c \ud074\ub798\uc2a4 \ub85c\ub529\uc774 \uac00\ub2a5\ud558\uac8c \ub4f1\ub85d\ud558\ub824 \ud588\uc9c0\ub9cc \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.

webappLoader.deploy=\uc791\uc5c5 \ub514\ub809\ud1a0\ub9ac [{0}]\uc5d0 \ud074\ub798\uc2a4 \ub808\ud30c\uc9c0\ud1a0\ub9ac\ub4e4\uc744 \ubc30\uce58\ud569\ub2c8\ub2e4.
webappLoader.reloadable=reloadable \ud504\ub85c\ud37c\ud2f0\ub97c [{0}](\uc73c)\ub85c \uc124\uc815\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
webappLoader.setContext.ise=\uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158 \ub85c\ub354\uac00 \uc2dc\uc791\ub418\uace0 \uc788\ub294 \ub3d9\uc548, \ucee8\ud14d\uc2a4\ud2b8\ub97c \uc124\uc815\ud558\ub294 \uac83\uc740 \ud5c8\uc6a9\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
webappLoader.starting=\uc774 \ub85c\ub354\ub97c \uc2dc\uc791\ud569\ub2c8\ub2e4.
webappLoader.stopping=\uc774 \ub85c\ub354\ub97c \uc911\uc9c0\uc2dc\ud0a4\ub294 \uc911
