# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

channel.nio.interrupted=\u73fe\u5728\u306e\u30b9\u30ec\u30c3\u30c9\u304c\u4e2d\u65ad\u3055\u308c\u307e\u3057\u305f
channel.nio.ssl.appInputNotEmpty=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u5165\u529b\u30d0\u30c3\u30d5\u30a1\u306b\u306f\u30c7\u30fc\u30bf\u304c\u6b8b\u3063\u3066\u3044\u307e\u3059\u3002\u6b8b\u3063\u305f\u30c7\u30fc\u30bf\u306f\u5931\u308f\u308c\u307e\u3059\u3002
channel.nio.ssl.appOutputNotEmpty=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u51fa\u529b\u30d0\u30c3\u30d5\u30a1\u306b\u306f\u307e\u3060\u30c7\u30fc\u30bf\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002 \u30c7\u30fc\u30bf\u306f\u5931\u308f\u308c\u307e\u3057\u305f\u3002
channel.nio.ssl.closeSilentError=\u30b3\u30cd\u30af\u30b7\u30e7\u30f3\u3092\u5b8c\u5168\u306b\u5207\u65ad\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
channel.nio.ssl.closing=\u30c1\u30e3\u30cd\u30eb\u306f\u30af\u30ed\u30fc\u30b8\u30f3\u30b0\u72b6\u614b\u3067\u3059
channel.nio.ssl.eofDuringHandshake=\u30cf\u30f3\u30c9\u30b7\u30a7\u30a4\u30af\u4e2d\u306eEOF\u3002
channel.nio.ssl.expandNetInBuffer=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u5165\u529b\u30d0\u30c3\u30d5\u30a1\u3092[{0}]\u30d0\u30a4\u30c8\u306b\u62e1\u5f35\u3057\u3066\u3044\u307e\u3059
channel.nio.ssl.expandNetOutBuffer=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u51fa\u529b\u30d0\u30c3\u30d5\u30a1\u3092[{0}]\u30d0\u30a4\u30c8\u306b\u62e1\u5f35\u3057\u307e\u3059
channel.nio.ssl.foundHttp=\u6697\u53f7\u5316\u3055\u308c\u305f TLS \u63a5\u7d9a\u304b\u3089\u5e73\u6587\u306e HTTP \u30ea\u30af\u30a8\u30b9\u30c8\u3092\u53d7\u4fe1\u3057\u307e\u3057\u305f\u3002
channel.nio.ssl.handshakeError=\u30cf\u30f3\u30c9\u30b7\u30a7\u30a4\u30af\u30a8\u30e9\u30fc
channel.nio.ssl.incompleteHandshake=\u30cf\u30f3\u30c9\u30b7\u30a7\u30a4\u30af\u304c\u4e0d\u5b8c\u5168\u3067\u3059\u3002\u30c7\u30fc\u30bf\u3092\u8aad\u307f\u53d6\u308b\u524d\u306b\u30cf\u30f3\u30c9\u30b7\u30a7\u30a4\u30af\u3092\u5b8c\u4e86\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
channel.nio.ssl.invalidCloseState=\u7121\u52b9\u306a\u30af\u30ed\u30fc\u30ba\u72b6\u614b\u3067\u3001\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30c7\u30fc\u30bf\u3092\u9001\u4fe1\u3057\u307e\u305b\u3093\u3002
channel.nio.ssl.invalidStatus=\u4e88\u671f\u3057\u306a\u3044\u30b9\u30c6\u30fc\u30bf\u30b9[{0}]\u3002
channel.nio.ssl.netInputNotEmpty=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u5165\u529b\u30d0\u30c3\u30d5\u30a1\u306b\u306f\u307e\u3060\u30c7\u30fc\u30bf\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002 \u30cf\u30f3\u30c9\u30b7\u30a7\u30a4\u30af\u306f\u5931\u6557\u3057\u307e\u3059\u3002
channel.nio.ssl.netOutputNotEmpty=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u51fa\u529b\u30d0\u30c3\u30d5\u30a1\u306b\u306f\u307e\u3060\u30c7\u30fc\u30bf\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002 \u30cf\u30f3\u30c9\u30b7\u30a7\u30a4\u30af\u306f\u5931\u6557\u3057\u307e\u3059\u3002
channel.nio.ssl.notHandshaking=\u30cf\u30f3\u30c9\u30b7\u30a7\u30a4\u30af\u4e2d\u306bNOT_HANDSHAKING
channel.nio.ssl.pendingWriteDuringClose=\u66f8\u304d\u8fbc\u307f\u3092\u4fdd\u7559\u3057\u3066\u3044\u308b\u305f\u3081\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d0\u30c3\u30d5\u30a1\u30fc\u306b\u30c7\u30fc\u30bf\u304c\u6b8b\u3063\u3066\u3044\u307e\u3059\u3002SSL \u5207\u65ad\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3067\u304d\u307e\u305b\u3093\u3002\u4ee3\u308f\u308a\u306b close(true) \u3067\u5f37\u5236\u7684\u306b\u5207\u65ad\u3057\u3066\u304f\u3060\u3055\u3044\u3002
channel.nio.ssl.remainingDataDuringClose=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d0\u30c3\u30d5\u30a1\u5185\u306b\u30c7\u30fc\u30bf\u304c\u6b8b\u3063\u3066\u3044\u3066\u3001SSL\u30af\u30ed\u30fc\u30ba\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3067\u304d\u307e\u305b\u3093\u3002\u4ee3\u308f\u308a\u306bclose(true)\u3067\u30af\u30ed\u30fc\u30ba\u3057\u307e\u3059\u3002
channel.nio.ssl.sniDefault=\u8981\u6c42\u3055\u308c\u305f SNI \u30db\u30b9\u30c8\u540d\u3092\u53d6\u5f97\u3059\u308b\u305f\u3081\u306b\u5341\u5206\u306a\u30c7\u30fc\u30bf\u3092\u84c4\u7a4d\u3067\u304d\u306a\u3044\u305f\u3081\u65e2\u5b9a\u5024\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
channel.nio.ssl.sniHostName=\u30b3\u30cd\u30af\u30b7\u30e7\u30f3 [{0}] \u304b\u3089\u53d6\u5f97\u3057\u305f SNI \u30db\u30b9\u30c8\u540d\u306f [{1}] \u3067\u3059\u3002
channel.nio.ssl.timeoutDuringHandshake=\u30cf\u30f3\u30c9\u30b7\u30a7\u30a4\u30af\u304c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3057\u307e\u3057\u305f\u3002
channel.nio.ssl.unexpectedStatusDuringUnwrap=UNWRAP\u30cf\u30f3\u30c9\u30b7\u30a7\u30a4\u30af\u4e2d\u306b\u4e88\u671f\u3057\u306a\u3044\u30b9\u30c6\u30fc\u30bf\u30b9[{0}]\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
channel.nio.ssl.unexpectedStatusDuringWrap=\u30cf\u30f3\u30c9\u30b7\u30a7\u30a4\u30afWRAP\u4e2d\u306b\u4e88\u671f\u3057\u306a\u3044\u30b9\u30c6\u30fc\u30bf\u30b9[{0}]\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
channel.nio.ssl.unwrapFail=\u30c7\u30fc\u30bf\u3092\u30a2\u30f3\u30e9\u30c3\u30d7\u3067\u304d\u307e\u305b\u3093\u3001\u7121\u52b9\u306a\u30b9\u30c6\u30fc\u30bf\u30b9[{0}]
channel.nio.ssl.unwrapFailResize=\u30d0\u30c3\u30d5\u30a1\u304c\u5c0f\u3055\u3059\u304e\u308b\u305f\u3081\u30c7\u30fc\u30bf\u3092\u30a2\u30f3\u30e9\u30c3\u30d7\u3067\u304d\u307e\u305b\u3093\u3002\u7121\u52b9\u306a\u30b9\u30c6\u30fc\u30bf\u30b9[{0}]
channel.nio.ssl.wrapException=\u30e9\u30c3\u30d7\u4e2d\u306b\u30cf\u30f3\u30c9\u30b7\u30a7\u30a4\u30af\u306b\u5931\u6557\u3057\u307e\u3057\u305f
channel.nio.ssl.wrapFail=\u30c7\u30fc\u30bf\u3092\u30e9\u30c3\u30d7\u3067\u304d\u307e\u305b\u3093\u3002\u7121\u52b9\u306a\u30b9\u30c6\u30fc\u30bf\u30b9[{0}]

endpoint.accept.fail=\u30bd\u30b1\u30c3\u30c8\u53d7\u3051\u4ed8\u3051\u5931\u6557
endpoint.alpn.fail=[{0}]\u3092\u4f7f\u7528\u3057\u3066ALPN\u306e\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
endpoint.alpn.negotiated=ALPN\u3092\u4f7f\u7528\u3057\u3066\u4ea4\u6e09\u3055\u308c\u305f[{0}]\u30d7\u30ed\u30c8\u30b3\u30eb
endpoint.apr.applyConf=OpenSSLConfCmd\u3092 SSL context\u306b\u9069\u7528\u3057\u307e\u3059\u3002
endpoint.apr.checkConf=OpenSSLConf\u306e\u78ba\u8a8d\u4e2d
endpoint.apr.errApplyConf=OpenSSLConf\u3092SSL\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306b\u9069\u7528\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
endpoint.apr.errCheckConf=OpenSSLConf\u30c1\u30a7\u30c3\u30af\u4e2d\u306e\u30a8\u30e9\u30fc
endpoint.apr.errMakeConf=OpenSSLConf\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
endpoint.apr.failSslContextMake=SSLContext\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002 SSLEngine\u304cAprLifecycleListener\u3067\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u3053\u3068\u3001AprLifecycleListener\u304c\u6b63\u3057\u304f\u521d\u671f\u5316\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3001\u6709\u52b9\u306aSSLProtocol\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u4e0b\u3055\u3044
endpoint.apr.invalidSslProtocol=SSLProtocol\u5c5e\u6027\u306b\u7121\u52b9\u306a\u5024[{0}]\u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f
endpoint.apr.maxConnections.running=APR \u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u306f\u5b9f\u884c\u4e2d\u306b maxConnection \u306e\u5024\u3092\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002\u73fe\u5728\u306e\u5024 [{0}] \u3092\u305d\u306e\u307e\u307e\u4f7f\u7528\u3057\u307e\u3059\u3002
endpoint.apr.maxConnections.unlimited=APR\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u306f\u3001\u7121\u5236\u9650\u306e\u63a5\u7d9a\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002 [{0}]\u306e\u65e2\u5b58\u306e\u5024\u306f\u5f15\u304d\u7d9a\u304d\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
endpoint.apr.noSendfileWithSSL=SSL\u304c\u6709\u52b9\u306a\u5834\u5408\u3001APR /native\u30b3\u30cd\u30af\u30bf\u3067Sendfile\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
endpoint.apr.pollAddInvalid=\u30bd\u30b1\u30c3\u30c8 [{0}] \u3092\u30dd\u30fc\u30e9\u30fc\u306b\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
endpoint.apr.pollError=Poller\u306f\u30a8\u30e9\u30fc[{0}]\u3067\u5931\u6557\u3057\u307e\u3057\u305f\uff1a[{1}]
endpoint.apr.pollMergeEvents=\u30bd\u30b1\u30c3\u30c8[{0}]\u306epoller \u30a4\u30d9\u30f3\u30c8[{1}]\u3092\u30de\u30fc\u30b8\u3057\u3066\u3001\u30de\u30fc\u30b8\u30a4\u30d9\u30f3\u30c8[{2}]\u3092\u4f5c\u6210\u3002
endpoint.apr.pollUnknownEvent=\u8a8d\u8b58\u3067\u304d\u306a\u3044\u30a4\u30d9\u30f3\u30c8[{0}]\u3092\u6301\u3064\u30bd\u30b1\u30c3\u30c8\u304cPoller\u304b\u3089\u8fd4\u3055\u308c\u307e\u3057\u305f\u3002
endpoint.apr.remoteport=APR \u30bd\u30b1\u30c3\u30c8 [{0}] \u306f\u30ea\u30e2\u30fc\u30c8\u30dd\u30fc\u30c8 [{1}] \u3078\u63a5\u7d9a\u3057\u307e\u3057\u305f\u3002
endpoint.apr.tooManyCertFiles=Apr \u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u306b\u51e6\u7406\u3067\u304d\u308b\u3088\u308a\u591a\u3044\u8a3c\u660e\u66f8\u30d5\u30a1\u30a4\u30eb\u304c\u69cb\u6210\u3055\u308c\u3066\u3044\u307e\u3059\u3002
endpoint.debug.channelCloseFail=\u30c1\u30e3\u30f3\u30cd\u30eb\u3092\u5207\u65ad\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
endpoint.debug.destroySocket=\u30bd\u30b1\u30c3\u30c8 [{0}] \u3092\u7834\u68c4\u3057\u307e\u3059\u3002
endpoint.debug.pollerAdd=addList\u306b\u8ffd\u52a0\u3001\u30bd\u30b1\u30c3\u30c8[{0}]\u3001\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8[{1}]\u3001\u30d5\u30e9\u30b0[{2}]
endpoint.debug.pollerAddDo=Poller\u30bd\u30b1\u30c3\u30c8[{0}]\u306b\u8ffd\u52a0
endpoint.debug.pollerProcess=\u30a4\u30d9\u30f3\u30c8[{1}]\u306e\u30bd\u30b1\u30c3\u30c8[{0}]\u306e\u51e6\u7406\u4e2d
endpoint.debug.pollerRemove=Poller\u304b\u3089[{0}]\u3092\u53d6\u308a\u9664\u3053\u3046\u3068\u3057\u3066\u3044\u307e\u3059\u3002
endpoint.debug.pollerRemoved=poller \u304b\u3089 [{0}] \u3092\u524a\u9664\u3057\u307e\u3057\u305f\u3002
endpoint.debug.registerRead=[{0}] \u306b\u5bfe\u3059\u308b\u8aad\u307f\u8fbc\u307f\u306e\u76e3\u8996\u3092\u767b\u9332\u3057\u307e\u3057\u305f
endpoint.debug.registerWrite=[{0}] \u306b\u5bfe\u3059\u308b\u66f8\u304d\u8fbc\u307f\u306e\u76e3\u8996\u3092\u767b\u9332\u3057\u307e\u3057\u305f
endpoint.debug.socket=\u30bd\u30b1\u30c3\u30c8[{0}]
endpoint.debug.socketCloseFail=\u30bd\u30b1\u30c3\u30c8\u3092\u5207\u65ad\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
endpoint.debug.socketTimeout=\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8 [{0}]
endpoint.debug.unlock.fail=port [{0}]\u306eaccept \u3092\u30ed\u30c3\u30af\u89e3\u9664\u3057\u3088\u3046\u3057\u305f\u969b\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
endpoint.debug.unlock.localFail=[{0}]\u306e\u30ed\u30fc\u30ab\u30eb\u30a2\u30c9\u30ec\u30b9\u3092\u7279\u5b9a\u3067\u304d\u307e\u305b\u3093
endpoint.debug.unlock.localNone=\u30ed\u30fc\u30ab\u30eb\u30a2\u30c9\u30ec\u30b9\u304c\u5229\u7528\u3067\u304d\u306a\u304b\u3063\u305f\u305f\u3081\u3001[{0}]\u306e\u30a2\u30af\u30bb\u30d7\u30bf\u306e\u30ed\u30c3\u30af\u3092\u89e3\u9664\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
endpoint.duplicateSslHostName=\u30db\u30b9\u30c8\u540d[{0}]\u306b\u8907\u6570\u306eSSLHostConfig\u8981\u7d20\u304c\u63d0\u4f9b\u3055\u308c\u307e\u3057\u305f\u3002 \u30db\u30b9\u30c8\u540d\u306f\u4e00\u610f\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
endpoint.err.close=\u30bd\u30b1\u30c3\u30c8\u3092\u30af\u30ed\u30fc\u30ba\u3057\u3088\u3046\u3068\u3057\u305f\u969b\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f
endpoint.err.handshake=\u30cf\u30f3\u30c9\u30b7\u30a7\u30a4\u30af\u5931\u6557
endpoint.err.unexpected=\u30bd\u30b1\u30c3\u30c8\u51e6\u7406\u4e2d\u306e\u4e88\u671f\u305b\u306c\u30a8\u30e9\u30fc
endpoint.executor.fail=\u30a8\u30b0\u30bc\u30ad\u30e5\u30fc\u30bf\u306f\u51e6\u7406\u3059\u308b\u30bd\u30b1\u30c3\u30c8[{0}]\u3092\u62d2\u5426\u3057\u307e\u3057\u305f\u3002
endpoint.getAttribute=[{0}]\u306f[{1}]\u3067\u3059
endpoint.init.bind=\u30bd\u30b1\u30c3\u30c8\u30d0\u30a4\u30f3\u30c9\u306b\u5931\u6557\u3057\u307e\u3057\u305f\uff1a[{0}] [{1}]
endpoint.init.bind.inherited=\u30b3\u30cd\u30af\u30bf\u304c1\u3064\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u9593\u3001\u7d99\u627f\u3055\u308c\u305f\u30c1\u30e3\u30cd\u30eb\u306f\u3042\u308a\u307e\u305b\u3093\u3002
endpoint.init.listen=\u30bd\u30b1\u30c3\u30c8\u306e\u5f85\u3061\u53d7\u3051\u3092\u958b\u59cb\u3067\u304d\u307e\u305b\u3093: [{0}] [{1}]
endpoint.init.notavail=APR\u306f\u5229\u7528\u3067\u304d\u307e\u305b\u3093
endpoint.invalidJmxNameSslHost=\u30db\u30b9\u30c8 [{0}] \u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f SSLHostConfig \u306b\u6709\u52b9\u306a JMX \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u540d\u3092\u751f\u6210\u3067\u304d\u307e\u305b\u3093\u3002
endpoint.invalidJmxNameSslHostCert=\u30db\u30b9\u30c8\u540d [{0}]\u3001\u8a3c\u660e\u66f8\u30bf\u30a4\u30d7 [{1}] \u306e SSLHostConfigCertificate \u306e\u305f\u3081\u306e\u6b63\u5e38\u306a JMX \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u540d\u3092\u751f\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
endpoint.jmxRegistrationFailed=\u540d\u524d [{0}] \u306e JMX \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u767b\u9332\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
endpoint.jsse.noSslContext=\u30db\u30b9\u30c8\u540d[{0}]\u306eSSLContext\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f
endpoint.launch.fail=new Runnable\u306e\u8d77\u52d5\u306b\u5931\u6557\u3057\u307e\u3057\u305f
endpoint.nio.registerFail=Poller\u304b\u3089\u30bd\u30b1\u30c3\u30c8\u306e\u30bb\u30ec\u30af\u30bf\u306b\u767b\u9332\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
endpoint.nio.selectorCloseFail=Poller\u3092\u9589\u3058\u308b\u3068\u304d\u306b\u30bb\u30ec\u30af\u30bf\u30fc\u3092\u9589\u3058\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
endpoint.nio.stopLatchAwaitFail=Poller\u306f\u4e88\u60f3\u3055\u308c\u305f\u6642\u9593\u5185\u306b\u6b62\u307e\u308a\u307e\u305b\u3093\u3067\u3057\u305f
endpoint.nio.stopLatchAwaitInterrupted=\u3053\u306e\u30b9\u30ec\u30c3\u30c9\u306fPoller\u304c\u505c\u6b62\u3059\u308b\u306e\u3092\u5f85\u3064\u9593\u306b\u4e2d\u65ad\u3055\u308c\u307e\u3057\u305f
endpoint.nio.timeoutCme=\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306e\u51e6\u7406\u4e2d\u306e\u4f8b\u5916\u3002 \u30b3\u30fc\u30c9\u306f\u7e70\u308a\u8fd4\u3057\u30c1\u30a7\u30c3\u30af\u3055\u308c\u3066\u304a\u308a\u3001\u540c\u6642\u306b\u5909\u66f4\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u3053\u306e\u30a8\u30e9\u30fc\u3092\u7e70\u308a\u8fd4\u3059\u3053\u3068\u304c\u3067\u304d\u308b\u5834\u5408\u306f\u3001Tomcat\u306e\u30d0\u30b0\u3092\u958b\u3044\u3066\u3001\u518d\u73fe\u624b\u9806\u3092\u63d0\u793a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
endpoint.nio2.exclusiveExecutor=NIO2\u30b3\u30cd\u30af\u30bf\u306f\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u6642\u306b\u6392\u4ed6\u7684\u30a8\u30b0\u30bc\u30ad\u30e5\u30fc\u30bf\u3092\u6b63\u3057\u304f\u52d5\u4f5c\u3055\u305b\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
endpoint.noSslHostConfig=\u30b3\u30cd\u30af\u30bf[{1}]\u306edefaultSSLHostConfigName \u306b\u4e00\u81f4\u3059\u308bSSLHostConfig\u8981\u7d20\u304chostName [{0}]\u3067\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f
endpoint.noSslHostName=SSL \u306e\u30db\u30b9\u30c8\u8a2d\u5b9a\u306b\u30db\u30b9\u30c8\u540d\u304c\u3042\u308a\u307e\u305b\u3093\u3002
endpoint.poll.error=\u4e88\u671f\u305b\u306c poller \u30a8\u30e9\u30fc
endpoint.poll.fail=\u91cd\u5927\u306aPoller\u969c\u5bb3\uff08Poller\u306e\u518d\u59cb\u52d5\uff09\uff1a[{0}] [{1}]
endpoint.poll.initfail=Poller\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
endpoint.poll.limitedpollsize=\u30b5\u30a4\u30ba [{0}] \u306e Poller \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
endpoint.process.fail=\u30bd\u30b1\u30c3\u30c8\u30d7\u30ed\u30bb\u30c3\u30b5\u30fc\u306e\u5272\u308a\u5f53\u3066\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
endpoint.processing.fail=\u30bd\u30b1\u30c3\u30c8\u30d7\u30ed\u30bb\u30c3\u30b5\u306e\u5b9f\u884c\u4e2d\u30a8\u30e9\u30fc
endpoint.removeDefaultSslHostConfig=\u65e2\u5b9a\u306eSSLHostConfig\uff08[{0}]\uff09\u306f\u524a\u9664\u3067\u304d\u307e\u305b\u3093
endpoint.sendfile.addfail=Sendfile \u5931\u6557: [{0}] [{1}]
endpoint.sendfile.error=\u4e88\u671f\u305b\u306c sendfile \u30a8\u30e9\u30fc
endpoint.serverSocket.closeFailed=[{0}] \u306b\u3088\u308a\u30b5\u30fc\u30d0\u30fc\u30bd\u30b1\u30c3\u30c8\u306e\u5207\u65ad\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
endpoint.setAttribute=[{0}]\u3092[{1}]\u306b\u8a2d\u5b9a
endpoint.timeout.err=\u30bd\u30b1\u30c3\u30c8\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u51e6\u7406\u4e2d\u306e\u30a8\u30e9\u30fc
endpoint.unknownSslHostName=SSL \u30db\u30b9\u30c8\u540d [{0}] \u306f\u3053\u306e\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u304b\u3089\u8a8d\u8b58\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
endpoint.warn.executorShutdown=\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb [{0}] \u3068\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30a8\u30b0\u30bc\u30ad\u30e5\u30fc\u30bf\u30fc\u306f\u5b8c\u5168\u306b\u505c\u6b62\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u3044\u304f\u3064\u304b\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b9\u30ec\u30c3\u30c9\u306f\u307e\u3060\u52d5\u4f5c\u3057\u7d9a\u3051\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
endpoint.warn.incorrectConnectionCount=\u4e0d\u6b63\u306a\u30b3\u30cd\u30af\u30b7\u30e7\u30f3\u6570\u3002\u8907\u6570\u306esocket.close\u304c\u540c\u3058\u30bd\u30b1\u30c3\u30c8\u3067\u547c\u3073\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
endpoint.warn.noLocalAddr=\u30bd\u30b1\u30c3\u30c8 [{0}] \u306e\u30ed\u30fc\u30ab\u30eb\u30a2\u30c9\u30ec\u30b9\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
endpoint.warn.noLocalName=\u30bd\u30b1\u30c3\u30c8 [{0}] \u306e\u30ed\u30fc\u30ab\u30eb\u30db\u30b9\u30c8\u540d\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
endpoint.warn.noLocalPort=\u30bd\u30b1\u30c3\u30c8 [{0}] \u306e\u30ed\u30fc\u30ab\u30eb\u30dd\u30fc\u30c8\u304c\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
endpoint.warn.noRemoteAddr=\u30bd\u30b1\u30c3\u30c8 [{0}] \u306e\u30ea\u30e2\u30fc\u30c8\u30a2\u30c9\u30ec\u30b9\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
endpoint.warn.noRemoteHost=\u30bd\u30b1\u30c3\u30c8 [{0}] \u306e\u30ea\u30e2\u30fc\u30c8\u30db\u30b9\u30c8\u540d\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
endpoint.warn.noRemotePort=\u30bd\u30b1\u30c3\u30c8[{0}] \u306e\u30ea\u30e2\u30fc\u30c8\u30dd\u30fc\u30c8\u756a\u53f7\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
endpoint.warn.unlockAcceptorFailed=Acceptor \u30b9\u30ec\u30c3\u30c9[{0}]\u306e\u30ed\u30c3\u30af\u3092\u89e3\u9664\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u5f37\u5236\u7684\u306b\u30cf\u30fc\u30c9\u30bd\u30b1\u30c3\u30c8\u3092\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u3057\u307e\u3059\u3002

sniExtractor.clientHelloInvalid=ClientHello\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u6b63\u3057\u304f\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
sniExtractor.clientHelloTooBig=ClientHello\u306f\u5358\u4e00\u306eTLS\u30ec\u30b3\u30fc\u30c9\u306b\u306f\u8868\u793a\u3055\u308c\u306a\u3044\u305f\u3081\u3001SNI\u60c5\u5831\u306f\u62bd\u51fa\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f

socket.apr.clientAbort=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306f\u30b3\u30cd\u30af\u30b7\u30e7\u30f3\u3092\u5207\u65ad\u3057\u307e\u3057\u305f\u3002
socket.apr.closed=\u30b3\u30cd\u30af\u30b7\u30e7\u30f3\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30bd\u30b1\u30c3\u30c8 [{0}] \u306f\u3059\u3067\u306b\u5207\u65ad\u3055\u308c\u3066\u3044\u307e\u3059\u3002
socket.apr.read.error=\u30e9\u30c3\u30d1\u30fc[2]\u3067APR /\u30cd\u30a4\u30c6\u30a3\u30d6\u30bd\u30b1\u30c3\u30c8[{1}]\u304b\u3089\u306e\u30c7\u30fc\u30bf\u8aad\u307f\u8fbc\u307f\u3067\u4e88\u671f\u3057\u306a\u3044\u30a8\u30e9\u30fc[{0}]\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
socket.apr.write.error=\u30e9\u30c3\u30d1\u30fc [{2}] \u7d4c\u7531\u3067 APR/native \u30bd\u30b1\u30c3\u30c8 [{1}] \u3078\u30c7\u30fc\u30bf\u3092\u66f8\u304d\u8fbc\u307f\u4e2d\u306b\u4e88\u671f\u305b\u306c\u30a8\u30e9\u30fc [{0}] \u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
socket.closed=\u3053\u306e\u30b3\u30cd\u30af\u30b7\u30e7\u30f3\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30bd\u30b1\u30c3\u30c8\u306f\u9589\u3058\u3089\u308c\u307e\u3057\u305f\u3002
socket.sslreneg=SSL\u30b3\u30cd\u30af\u30b7\u30e7\u30f3\u306e\u518d\u30cd\u30b4\u30b7\u30a8\u30fc\u30b7\u30e7\u30f3\u6642\u306e\u4f8b\u5916

sslHostConfig.certificate.notype=\u6307\u5b9a\u3055\u308c\u305f\u8907\u6570\u306e\u8a3c\u660e\u66f8\u306e\u4e2d\u306b\u3001\u5c11\u306a\u304f\u3068\u30821\u3064\u306f\u5fc5\u9808\u8981\u7d20\u306e\u5b58\u5728\u3057\u306a\u3044\u8a3c\u660e\u66f8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
sslHostConfig.certificateVerificationInvalid=\u8a3c\u660e\u66f8\u691c\u8a3c\u5024[{0}]\u304c\u8a8d\u8b58\u3055\u308c\u307e\u305b\u3093
sslHostConfig.fileNotFound=\u69cb\u6210\u30d5\u30a1\u30a4\u30eb[{0}]\u306f\u5b58\u5728\u3057\u307e\u305b\u3093
sslHostConfig.invalid_truststore_password=\u63d0\u4f9b\u3055\u308c\u305f\u30c8\u30e9\u30b9\u30c8\u30b9\u30c8\u30a2\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u3001\u30c8\u30e9\u30b9\u30c8\u30b9\u30c8\u30a2\u306e\u30ed\u30c3\u30af\u89e3\u9664\u304a\u3088\u3073\u691c\u8a3c\u306b\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u691c\u8a3c\u3092\u30b9\u30ad\u30c3\u30d7\u3059\u308bnull\u30d1\u30b9\u30ef\u30fc\u30c9\u3067\u30c8\u30e9\u30b9\u30c8\u30b9\u30c8\u30a2\u306b\u30a2\u30af\u30bb\u30b9\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
sslHostConfig.mismatch=[{0}]\u30d7\u30ed\u30d1\u30c6\u30a3\u306f[{1}]\u3068\u3044\u3046\u540d\u524d\u306eSSLHostConfig\u3067\u8a2d\u5b9a\u3055\u308c\u3001[{2}]\u69cb\u6210\u69cb\u6587\u7528\u3067\u3059\u304c\u3001[{3}]\u69cb\u6210\u69cb\u6587\u3067SSLHostConfig\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
sslHostConfig.opensslconf.alreadyset=\u5225\u306eOpenSSLConf\u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3059\u308b\u8a66\u307f\u304c\u7121\u8996\u3055\u308c\u307e\u3059\u3002
sslHostConfig.opensslconf.null=Null OpenSSLConf\u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u7121\u8996\u3055\u308c\u307e\u3057\u305f
sslHostConfig.prefix_missing=[{1}]\u3068\u3044\u3046SSLHostConfig\u306e\u30d7\u30ed\u30c8\u30b3\u30eb\u306e\u30ea\u30b9\u30c8\u306b\u30d7\u30ed\u30c8\u30b3\u30eb[{0}]\u304c\u8ffd\u52a0\u3055\u308c\u307e\u3057\u305f\u3002 +/-\u63a5\u982d\u8f9e\u304c\u306a\u3044\u304b\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

sslHostConfigCertificate.mismatch=\u30d7\u30ed\u30d1\u30c6\u30a3[{0}]\u306f[{1}]\u3068\u3044\u3046\u540d\u524d\u306eSSLHostConfigCertificate\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u304a\u308a\u3001\u8a3c\u660e\u66f8\u306e\u683c\u7d0d\u30bf\u30a4\u30d7[{2}]\u7528\u3067\u3059\u304c\u3001\u8a3c\u660e\u66f8\u306f[{3}]\u30bf\u30a4\u30d7\u306e\u30b9\u30c8\u30ec\u30fc\u30b8\u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002

sslImplementation.cnfe=\u30af\u30e9\u30b9 [{0}] \u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092 SSLImplementation \u3068\u3057\u3066\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002

sslUtilBase.active=\u30a2\u30af\u30c6\u30a3\u30d6\u306a[{0}]\u306f\u6b21\u306e\u3068\u304a\u308a\u3067\u3059\uff1a[{1}]
sslUtilBase.alias_no_key_entry=\u5225\u540d [{0}] \u306f\u30ad\u30fc\u30a8\u30f3\u30c8\u30ea\u3092\u767a\u898b\u3067\u304d\u307e\u305b\u3093
sslUtilBase.invalidTrustManagerClassName=[{0}]\u304c\u63d0\u4f9b\u3059\u308btrustManagerClassName\u306fjavax.net.ssl.TrustManager\u3092\u5b9f\u88c5\u3057\u3066\u3044\u307e\u305b\u3093\u3002
sslUtilBase.keystore_load_failed=[{0}] \u306e\u30ad\u30fc\u30b9\u30c8\u30a2 [{1}] \u306e\u8aad\u307f\u8fbc\u307f\u306f [{2}] \u306b\u3088\u308a\u5931\u6557\u3057\u307e\u3057\u305f\u3002
sslUtilBase.noCertFile=SSL\u30b3\u30cd\u30af\u30bf\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001SSLHostConfig\u306ecertificateFile\u5c5e\u6027\u3092\u5b9a\u7fa9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
sslUtilBase.noCrlSupport=\u30c8\u30e9\u30b9\u30c8\u30b9\u30c8\u30a2\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc [{0}] \u306f\u8a2d\u5b9a\u9805\u76ee certificateRevocationFile \u306b\u5bfe\u5fdc\u3057\u3066\u3044\u307e\u305b\u3093\u3002
sslUtilBase.noKeys=\u30ad\u30fc\u30b9\u30c8\u30a2\u3067\u898b\u3064\u304b\u3063\u305f\u79d8\u5bc6\u30ad\u30fc\u306e\u30a8\u30a4\u30ea\u30a2\u30b9\u304c\u3042\u308a\u307e\u305b\u3093\u3002
sslUtilBase.noVerificationDepth=\u30c8\u30e9\u30b9\u30c8\u30b9\u30c8\u30a2\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc [{0}] \u306f\u8a2d\u5b9a\u9805\u76ee certificateVerificationDepth \u306b\u672a\u5bfe\u5fdc\u3067\u3059\u3002
sslUtilBase.noneSupported=\u6307\u5b9a\u3055\u308c\u305f[{0}]\u306e\u3069\u308c\u3082SSL\u30a8\u30f3\u30b8\u30f3\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\uff1a[{1}]
sslUtilBase.skipped=\u6307\u5b9a\u3055\u308c\u305f[{0}]\u306e\u4e00\u90e8\u306fSSL\u30a8\u30f3\u30b8\u30f3\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u304a\u3089\u305a\u3001\u30b9\u30ad\u30c3\u30d7\u3055\u308c\u3066\u3044\u307e\u3059\uff1a[{1}]
sslUtilBase.ssl3=SSLv3 \u304c\u660e\u793a\u7684\u306b\u6709\u52b9\u5316\u5316\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u30d7\u30ed\u30c8\u30b3\u30eb\u306f\u5b89\u5168\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
sslUtilBase.tls13.auth=JSSE TLS 1.3\u5b9f\u88c5\u306f\u3001\u521d\u671f\u30cf\u30f3\u30c9\u30b7\u30a7\u30a4\u30af\u5f8c\u306e\u8a8d\u8a3c\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8a8d\u8a3c\u3068\u4e92\u63db\u6027\u304c\u3042\u308a\u307e\u305b\u3093\u3002
sslUtilBase.trustedCertNotChecked=\u30a8\u30a4\u30ea\u30a2\u30b9[{0}]\u3092\u6301\u3064\u4fe1\u983c\u3067\u304d\u308b\u8a3c\u660e\u66f8\u306e\u6709\u52b9\u671f\u9650\u306f\u3001\u8a3c\u660e\u66f8\u304c\u4e0d\u660e\u306a\u578b\u3067\u3042\u308b\u305f\u3081\u30c1\u30a7\u30c3\u30af\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
sslUtilBase.trustedCertNotValid=\u30a8\u30a4\u30ea\u30a2\u30b9[{0}]\u3068DN [{1}]\u3092\u6301\u3064\u4fe1\u983c\u3067\u304d\u308b\u8a3c\u660e\u66f8\u304c[{2}]\u306e\u305f\u3081\u306b\u7121\u52b9\u3067\u3059\u3002 \u3053\u306e\u4fe1\u983c\u3067\u304d\u308b\u8a3c\u660e\u66f8\u3067\u7f72\u540d\u3055\u308c\u305f\u8a3c\u660e\u66f8\u304c\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u3067\u3057\u3087\u3046
