# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

accessLogValve.alreadyExists=[{0}]\u304b\u3089[{1}]\u3078\u306e\u30a2\u30af\u30bb\u30b9\u30ed\u30b0\u306e\u540d\u524d\u306e\u5909\u66f4\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30d5\u30a1\u30a4\u30eb\u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002
accessLogValve.closeFail=\u30a2\u30af\u30bb\u30b9\u30ed\u30b0\u306e\u30af\u30ed\u30fc\u30ba\u306b\u5931\u6557\u3057\u307e\u3057\u305f
accessLogValve.deleteFail=\u53e4\u3044\u30a2\u30af\u30bb\u30b9\u30ed\u30b0[{0}]\u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
accessLogValve.invalidLocale=[{0}] \u3092\u30ed\u30b1\u30fc\u30eb\u306b\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
accessLogValve.invalidPortType=\u4e0d\u6b63\u306a\u30dd\u30fc\u30c8\u7a2e\u985e [{0}] \u306e\u4ee3\u308f\u308a\u306b\u30b5\u30fc\u30d0\u30fc\u306e\u30ed\u30fc\u30ab\u30eb\u30dd\u30fc\u30c8\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
accessLogValve.openDirFail=\u30a2\u30af\u30bb\u30b9\u30ed\u30b0\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea[{0}]\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f
accessLogValve.openFail=\u30a2\u30af\u30bb\u30b9\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb [{0}] \u3092\u958b\u3051\u307e\u305b\u3093\u3002
accessLogValve.renameFail=[{0}]\u304b\u3089[{1}]\u3078\u306e\u30a2\u30af\u30bb\u30b9\u30ed\u30b0\u306e\u540d\u524d\u306e\u5909\u66f4\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
accessLogValve.rotateFail=\u30a2\u30af\u30bb\u30b9\u30ed\u30b0\u306e\u30ed\u30fc\u30c6\u30fc\u30b7\u30e7\u30f3\u306b\u5931\u6557\u3057\u307e\u3057\u305f
accessLogValve.unsupportedEncoding=\u6587\u5b57\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u306b [{0}] \u3092\u6307\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002\u30b7\u30b9\u30c6\u30e0\u306e\u65e2\u5b9a\u5024\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
accessLogValve.writeFail=\u30ed\u30b0\u30e1\u30c3\u30bb\u30fc\u30b8[{0}]\u306e\u66f8\u304d\u8fbc\u307f\u306b\u5931\u6557\u3057\u307e\u3057\u305f

errorReportValve.description=\u8aac\u660e
errorReportValve.exception=\u4f8b\u5916
errorReportValve.exceptionReport=\u4f8b\u5916\u5831\u544a
errorReportValve.message=\u30e1\u30c3\u30bb\u30fc\u30b8
errorReportValve.noDescription=\u8aac\u660e\u306f\u3042\u308a\u307e\u305b\u3093
errorReportValve.note=\u6ce8\u610f
errorReportValve.rootCause=\u6839\u672c\u539f\u56e0
errorReportValve.rootCauseInLogs=\u539f\u56e0\u306e\u3059\u3079\u3066\u306e\u30b9\u30bf\u30c3\u30af\u30c8\u30ec\u30fc\u30b9\u306f\u3001\u30b5\u30fc\u30d0\u306e\u30ed\u30b0\u306b\u8a18\u9332\u3055\u308c\u3066\u3044\u307e\u3059
errorReportValve.statusHeader=HTTP\u30b9\u30c6\u30fc\u30bf\u30b9 {0} \u2013 {1}
errorReportValve.statusReport=\u30b9\u30c6\u30fc\u30bf\u30b9\u30ec\u30dd\u30fc\u30c8
errorReportValve.type=\u30bf\u30a4\u30d7
errorReportValve.unknownReason=\u672a\u77e5\u306e\u7406\u7531

extendedAccessLogValve.badXParam=\u7121\u52b9\u306ax\u30d1\u30e9\u30e1\u30fc\u30bf\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u3067\u3059\u3002 'x-#(...)\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
extendedAccessLogValve.badXParamValue=\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u30ea\u30af\u30a8\u30b9\u30c8[{0}]\u306e\u7121\u52b9\u306ax\u30d1\u30e9\u30e1\u30fc\u30bf\u5024
extendedAccessLogValve.decodeError=[{0}]\u3067\u59cb\u307e\u308b\u6b8b\u308a\u306e\u6587\u5b57\u3092\u30c7\u30b3\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093
extendedAccessLogValve.emptyPattern=\u30d1\u30bf\u30fc\u30f3\u6587\u5b57\u5217\u304c\u7a7a\u3067\u3059\u3002\u3082\u3057\u304f\u306f\u7a7a\u767d\u3060\u3051\u3067\u69cb\u6210\u3055\u308c\u3066\u3044\u307e\u3059\u3002
extendedAccessLogValve.noClosing=\u7d42\u4e86\uff09\u304c\u30c7\u30b3\u30fc\u30c9\u3067\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
extendedAccessLogValve.patternParseError=\u30d1\u30bf\u30fc\u30f3\u6587\u5b57\u5217 [{0}] \u3092\u89e3\u6790\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002

http.400.desc=\u30b5\u30fc\u30d0\u306f\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30a8\u30e9\u30fc\uff08\u4f8b\u3048\u3070\u3001\u4e0d\u6b63\u306a\u30ea\u30af\u30a8\u30b9\u30c8\u69cb\u6587\u3001\u7121\u52b9\u306a\u30ea\u30af\u30a8\u30b9\u30c8\u30e1\u30c3\u30bb\u30fc\u30b8\u30d5\u30ec\u30fc\u30df\u30f3\u30b0\u3001\u307e\u305f\u306f\u4e0d\u6b63\u306a\u30ea\u30af\u30a8\u30b9\u30c8\u30eb\u30fc\u30c6\u30a3\u30f3\u30b0\uff09\u3067\u3042\u308b\u3068\u8003\u3048\u3089\u308c\u308b\u305f\u3081\u306b\u3001\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u51e6\u7406\u3067\u304d\u306a\u3044\u3001\u307e\u305f\u306f\u51e6\u7406\u3057\u307e\u305b\u3093\u3002
http.400.reason=Bad Request
http.401.desc=\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u306f\u5bfe\u8c61\u30ea\u30bd\u30fc\u30b9\u306e\u6709\u52b9\u306a\u8a8d\u8a3c\u8cc7\u683c\u304c\u306a\u3044\u305f\u3081\u3001\u9069\u7528\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
http.401.reason=Unauthorized
http.402.desc=\u3053\u306e\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9\u306f\u3001\u5c06\u6765\u306e\u4f7f\u7528\u306e\u305f\u3081\u306b\u4e88\u7d04\u3055\u308c\u3066\u3044\u307e\u3059
http.402.reason=Payment Required
http.403.desc=\u30b5\u30fc\u30d0\u30fc\u306f\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u8a8d\u8a3c\u3092\u62d2\u5426\u3057\u307e\u3057\u305f\u3002
http.403.reason=Forbidden
http.404.desc=\u30aa\u30ea\u30b8\u30f3\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u30ea\u30bd\u30fc\u30b9\u306e\u73fe\u5728\u306e\u8868\u73fe\u3092\u898b\u3064\u3051\u3089\u308c\u306a\u304b\u3063\u305f\u304b\u3001\u307e\u305f\u306f\u305d\u308c\u304c\u5b58\u5728\u3059\u308b\u3053\u3068\u3092\u958b\u793a\u3059\u308b\u3064\u3082\u308a\u306f\u3042\u308a\u307e\u305b\u3093\u3002
http.404.reason=\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
http.405.desc=\u30ea\u30af\u30a8\u30b9\u30c8\u30e9\u30a4\u30f3\u3067\u53d7\u4fe1\u3055\u308c\u305f\u30e1\u30bd\u30c3\u30c9\u306f\u3001\u30aa\u30ea\u30b8\u30f3\u30b5\u30fc\u30d0\u30fc\u306b\u3088\u3063\u3066\u8a8d\u8b58\u3055\u308c\u307e\u3059\u304c\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u30ea\u30bd\u30fc\u30b9\u306b\u3088\u3063\u3066\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
http.405.reason=Method Not Allowed
http.406.desc=\u30bf\u30fc\u30b2\u30c3\u30c8\u30ea\u30bd\u30fc\u30b9\u306f\u3001\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u53d7\u3051\u53d6\u3063\u305f\u30d7\u30ed\u30a2\u30af\u30c6\u30a3\u30d6\u306a\u30cd\u30b4\u30b7\u30a8\u30fc\u30b7\u30e7\u30f3\u30d8\u30c3\u30c0\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u5f93\u3063\u3066\u3001\u30e6\u30fc\u30b6\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u304c\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u73fe\u5728\u306e\u8868\u73fe\u3092\u6301\u305f\u305a\u3001\u30b5\u30fc\u30d0\u306f\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u8868\u73fe\u3092\u63d0\u4f9b\u3059\u308b\u3053\u3068\u3092\u671b\u307e\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
http.406.reason=Not Acceptable
http.407.desc=\u3053\u306e\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9\u306f401\uff08Unauthorized\uff09\u306b\u4f3c\u3066\u3044\u307e\u3059\u304c\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304c\u30d7\u30ed\u30ad\u30b7\u3092\u4f7f\u7528\u3059\u308b\u305f\u3081\u306b\u81ea\u8eab\u3092\u8a8d\u8a3c\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u3053\u3068\u3092\u793a\u3057\u307e\u3059\u3002
http.407.reason=\u30d7\u30ed\u30ad\u30b7\u8a8d\u8a3c\u304c\u5fc5\u8981\u3067\u3059\u3002
http.408.desc=\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u5f85\u6a5f\u7528\u306b\u6e96\u5099\u3055\u308c\u305f\u6642\u9593\u5185\u306b\u5b8c\u5168\u306a\u30ea\u30af\u30a8\u30b9\u30c8\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u53d7\u4fe1\u3057\u307e\u305b\u3093\u3067\u3057\u305f\u3002
http.408.reason=\u30ea\u30af\u30a8\u30b9\u30c8\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
http.409.desc=\u30bf\u30fc\u30b2\u30c3\u30c8\u30ea\u30bd\u30fc\u30b9\u306e\u73fe\u5728\u306e\u72b6\u614b\u3068\u306e\u7af6\u5408\u306e\u305f\u3081\u306b\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u5b8c\u4e86\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
http.409.reason=Conflict
http.410.desc=\u30aa\u30ea\u30b8\u30f3\u30b5\u30fc\u30d0\u30fc\u3067\u30bf\u30fc\u30b2\u30c3\u30c8\u30ea\u30bd\u30fc\u30b9\u3078\u306e\u30a2\u30af\u30bb\u30b9\u304c\u5229\u7528\u3067\u304d\u306a\u304f\u306a\u308a\u3001\u3053\u306e\u72b6\u614b\u304c\u6c38\u7d9a\u7684\u306b\u306a\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
http.410.reason=Gone
http.411.desc=\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u5b9a\u7fa9\u3055\u308c\u305fContent-Length\u306a\u3057\u3067\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u53d7\u3051\u5165\u308c\u308b\u3053\u3068\u3092\u62d2\u5426\u3057\u307e\u3059\u3002
http.411.reason=Length Required
http.412.desc=\u30ea\u30af\u30a8\u30b9\u30c8\u30d8\u30c3\u30c0\u30fc\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u6307\u5b9a\u3055\u308c\u305f1\u3064\u4ee5\u4e0a\u306e\u6761\u4ef6\u304c\u3001\u30b5\u30fc\u30d0\u30fc\u4e0a\u3067\u30c6\u30b9\u30c8\u3055\u308c\u305f\u3068\u304d\u306bfalse\u306b\u8a55\u4fa1\u3055\u308c\u307e\u3057\u305f\u3002
http.412.reason=\u524d\u63d0\u6761\u4ef6\u5931\u6557
http.413.desc=\u30ea\u30af\u30a8\u30b9\u30c8\u30da\u30a4\u30ed\u30fc\u30c9\u304c\u30b5\u30fc\u30d0\u30fc\u304c\u51e6\u7406\u3067\u304d\u308b\u3001\u307e\u305f\u306f\u51e6\u7406\u3067\u304d\u308b\u3088\u308a\u3082\u5927\u304d\u3044\u305f\u3081\u3001\u30b5\u30fc\u30d0\u30fc\u306f\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u51e6\u7406\u3092\u62d2\u5426\u3057\u3066\u3044\u307e\u3059\u3002
http.413.reason=Payload Too Large
http.414.desc=\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u5bfe\u8c61\u304c\u30b5\u30fc\u30d0\u30fc\u304c\u89e3\u91c8\u3057\u3088\u3046\u3068\u3059\u308b\u3088\u308a\u3082\u9577\u3044\u305f\u3081\u3001\u30b5\u30fc\u30d0\u30fc\u306f\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u30b5\u30fc\u30d3\u30b9\u3092\u62d2\u5426\u3057\u3066\u3044\u307e\u3059\u3002
http.414.reason=URI Too Long
http.415.desc=\u30da\u30a4\u30ed\u30fc\u30c9\u304c\u30bf\u30fc\u30b2\u30c3\u30c8\u30ea\u30bd\u30fc\u30b9\u4e0a\u306e\u3053\u306e\u30e1\u30bd\u30c3\u30c9\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u5f62\u5f0f\u3067\u3042\u308b\u305f\u3081\u3001\u30aa\u30ea\u30b8\u30f3\u30b5\u30fc\u30d0\u30fc\u306f\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u51e6\u7406\u3059\u308b\u3053\u3068\u3092\u62d2\u5426\u3057\u3066\u3044\u307e\u3059\u3002
http.415.reason=\u672a\u5bfe\u5fdc\u306e\u30e1\u30c7\u30a3\u30a2\u30bf\u30a4\u30d7\u3067\u3059\u3002
http.416.desc=\u30ea\u30af\u30a8\u30b9\u30c8\u306eRange\u30d8\u30c3\u30c0\u30fc\u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u7bc4\u56f2\u306e\u3044\u305a\u308c\u3082\u3001\u9078\u629e\u3055\u308c\u305f\u30ea\u30bd\u30fc\u30b9\u306e\u73fe\u5728\u306e\u30a8\u30af\u30b9\u30c6\u30f3\u30c8\u3068\u91cd\u8907\u3057\u306a\u3044\u304b\u3001\u7121\u52b9\u306a\u7bc4\u56f2\u307e\u305f\u306f\u5c0f\u3055\u3059\u304e\u308b\u7bc4\u56f2\u307e\u305f\u306f\u91cd\u8907\u3059\u308b\u7bc4\u56f2\u306e\u904e\u5270\u306a\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u305f\u3081\u306b\u30ea\u30af\u30a8\u30b9\u30c8\u3055\u308c\u305f\u7bc4\u56f2\u306e\u96c6\u5408\u304c\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\u3002
http.416.reason=Range Not Satisfiable
http.417.desc=\u30ea\u30af\u30a8\u30b9\u30c8\u306eExpect\u30d8\u30c3\u30c0\u30fc\u30d5\u30a3\u30fc\u30eb\u30c9\u3067\u6307\u5b9a\u3055\u308c\u305f\u671f\u5f85\u5024\u304c\u3001\u5c11\u306a\u304f\u3068\u30821\u3064\u306e\u30a4\u30f3\u30d0\u30a6\u30f3\u30c9\u30b5\u30fc\u30d0\u30fc\u3067\u6e80\u305f\u3055\u308c\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
http.417.reason=Expectation Failed
http.421.desc=\u30ea\u30af\u30a8\u30b9\u30c8\u306f\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u751f\u6210\u3067\u304d\u306a\u3044\u30b5\u30fc\u30d0\u30fc\u306b\u5411\u3051\u3089\u308c\u307e\u3057\u305f\u3002
http.421.reason=Misdirected Request
http.422.desc=\u30b5\u30fc\u30d0\u30fc\u306f\u30ea\u30af\u30a8\u30b9\u30c8\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u30bf\u30a4\u30d7\u3092\u7406\u89e3\u3057\u3066\u304a\u308a\u3001\u30ea\u30af\u30a8\u30b9\u30c8\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u306e\u69cb\u6587\u306f\u6b63\u3057\u3044\u3082\u306e\u306e\u3001\u542b\u307e\u308c\u3066\u3044\u308b\u547d\u4ee4\u3092\u51e6\u7406\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
http.422.reason=Unprocessable Entity
http.423.desc=\u30e1\u30bd\u30c3\u30c9\u547c\u3073\u51fa\u3057\u306e\u4f9d\u983c\u5143\u30ea\u30bd\u30fc\u30b9\u3001\u3042\u308b\u3044\u306f\u4f9d\u983c\u5148\u30ea\u30bd\u30fc\u30b9\u306f\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u307e\u3059\u3002
http.423.reason=\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u307e\u3059
http.424.desc=\u8981\u6c42\u3055\u308c\u305f\u30a2\u30af\u30b7\u30e7\u30f3\u304c\u5225\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u306b\u4f9d\u5b58\u3057\u3001\u305d\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u304c\u5931\u6557\u3057\u305f\u305f\u3081\u3001\u3053\u306e\u30e1\u30bd\u30c3\u30c9\u306f\u30ea\u30bd\u30fc\u30b9\u4e0a\u3067\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
http.424.reason=Failed Dependency
http.426.desc=\u30b5\u30fc\u30d0\u30fc\u306f\u73fe\u5728\u306e\u30d7\u30ed\u30c8\u30b3\u30eb\u3092\u4f7f\u7528\u3057\u3066\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u5b9f\u884c\u3059\u308b\u3053\u3068\u3092\u62d2\u5426\u3057\u307e\u3059\u304c\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304c\u5225\u306e\u30d7\u30ed\u30c8\u30b3\u30eb\u306b\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3057\u305f\u5f8c\u306b\u305d\u306e\u8981\u6c42\u3092\u5b9f\u884c\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
http.426.reason=\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u304c\u5fc5\u8981\u3067\u3059\u3002
http.428.desc=\u30aa\u30ea\u30b8\u30f3\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u8981\u6c42\u304c\u6761\u4ef6\u4ed8\u304d\u3067\u3042\u308b\u3053\u3068\u3092\u8981\u6c42\u3057\u307e\u3059\u3002
http.428.reason=Precondition Required
http.429.desc=\u30e6\u30fc\u30b6\u30fc\u304c\u6307\u5b9a\u3057\u305f\u6642\u9593\u5185\u306b\u591a\u304f\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u9001\u4fe1\u3057\u307e\u3057\u305f\uff08\u30ec\u30fc\u30c8\u5236\u9650\uff09\u3002
http.429.reason=\u5927\u91cf\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u304c\u767a\u751f\u3057\u3066\u3044\u307e\u3059\u3002
http.431.desc=\u30d8\u30c3\u30c0\u30fc\u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u5927\u304d\u3059\u304e\u308b\u305f\u3081\u3001\u30b5\u30fc\u30d0\u30fc\u306f\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u3059\u3059\u3093\u3067\u51e6\u7406\u3057\u307e\u305b\u3093\u3002
http.431.reason=\u30ea\u30af\u30a8\u30b9\u30c8\u30d8\u30c3\u30c0\u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u5927\u304d\u904e\u304e\u307e\u3059\u3002
http.451.desc=\u30b5\u30fc\u30d0\u30fc\u306f\u3053\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u6cd5\u7684\u7406\u7531\u3067\u62d2\u5426\u3057\u307e\u3057\u305f\u3002
http.451.reason=Unavailable For Legal Reasons
http.500.desc=\u30b5\u30fc\u30d0\u30fc\u306f\u4e88\u671f\u3057\u306a\u3044\u6761\u4ef6\u306b\u906d\u9047\u3057\u307e\u3057\u305f\u3002\u305d\u308c\u306f\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u5b9f\u884c\u3092\u59a8\u3052\u307e\u3059\u3002
http.500.reason=Internal Server Error
http.501.desc=\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u5b9f\u884c\u3059\u308b\u305f\u3081\u306b\u5fc5\u8981\u306a\u6a5f\u80fd\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
http.501.reason=Not Implemented
http.502.desc=\u30b2\u30fc\u30c8\u30a6\u30a7\u30a4\u3042\u308b\u3044\u306f\u30d7\u30ed\u30ad\u30b7\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u8a66\u307f\u305f\u5185\u90e8\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u4e0d\u6b63\u306a\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u53d7\u4fe1\u3057\u307e\u3057\u305f\u3002
http.502.reason=Bad Gateway
http.503.desc=\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u4e00\u6642\u7684\u306a\u904e\u8ca0\u8377\u307e\u305f\u306f\u5b9a\u671f\u4fdd\u5b88\u306e\u305f\u3081\u306b\u73fe\u5728\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u51e6\u7406\u3067\u304d\u307e\u305b\u3093\u3002\u9045\u308c\u3066\u7de9\u548c\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
http.503.reason=Service Unavailable
http.504.desc=\u30b2\u30fc\u30c8\u30a6\u30a7\u30a4\u307e\u305f\u306f\u30d7\u30ed\u30ad\u30b7\u3068\u3057\u3066\u6a5f\u80fd\u3057\u3066\u3044\u308b\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u5b8c\u4e86\u3059\u308b\u305f\u3081\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u5fc5\u8981\u306e\u3042\u308b\u4e0a\u6d41\u306e\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u30bf\u30a4\u30e0\u30ea\u30fc\u306a\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u53d7\u4fe1\u3057\u307e\u305b\u3093\u3067\u3057\u305f\u3002
http.504.reason=\u30b2\u30fc\u30c8\u30a6\u30a7\u30a4\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
http.505.desc=\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u30ea\u30af\u30a8\u30b9\u30c8\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u4f7f\u7528\u3055\u308c\u305f\u30e1\u30b8\u30e3\u30fc\u30d0\u30fc\u30b8\u30e7\u30f3\u306eHTTP\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u306a\u3044\u304b\u3001\u307e\u305f\u306f\u30b5\u30dd\u30fc\u30c8\u3092\u62d2\u5426\u3057\u3066\u3044\u307e\u3059\u3002
http.505.reason=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044HTTP\u30d0\u30fc\u30b8\u30e7\u30f3
http.506.desc=\u30b5\u30fc\u30d0\u30fc\u306b\u306f\u5185\u90e8\u69cb\u6210\u30a8\u30e9\u30fc\u304c\u3042\u308a\u307e\u3059\u3002\u9078\u629e\u3055\u308c\u305f\u53ef\u5909\u30ea\u30bd\u30fc\u30b9\u306f\u900f\u904e\u7684\u306a\u30b3\u30f3\u30c6\u30f3\u30c4\u30cd\u30b4\u30b7\u30a8\u30fc\u30b7\u30e7\u30f3\u81ea\u4f53\u306b\u95a2\u4e0e\u3059\u308b\u3088\u3046\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u30cd\u30b4\u30b7\u30a8\u30fc\u30b7\u30e7\u30f3\u30d7\u30ed\u30bb\u30b9\u306e\u9069\u5207\u306a\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
http.506.reason=Variant Also Negotiates
http.507.desc=\u30b5\u30fc\u30d0\u30fc\u304c\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u6b63\u5e38\u306b\u5b8c\u4e86\u3059\u308b\u306e\u306b\u5fc5\u8981\u306a\u8868\u73fe\u3092\u4fdd\u7ba1\u3067\u304d\u306a\u3044\u305f\u3081\u3001\u3053\u306e\u30e1\u30bd\u30c3\u30c9\u3092\u30ea\u30bd\u30fc\u30b9\u306b\u5bfe\u3057\u3066\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
http.507.reason=\u30b9\u30c8\u30ec\u30fc\u30b8\u306b\u5145\u5206\u306a\u7a7a\u304d\u5bb9\u91cf\u304c\u3042\u308a\u307e\u305b\u3093\u3002
http.508.desc=\u30b5\u30fc\u30d0\u30fc\u306f\u3001 "Depth\uff1ainfinity"\u3067\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u51e6\u7406\u3057\u3066\u3044\u308b\u9593\u306b\u7121\u9650\u30eb\u30fc\u30d7\u3092\u691c\u51fa\u3057\u305f\u305f\u3081\u3001\u64cd\u4f5c\u3092\u7d42\u4e86\u3057\u307e\u3057\u305f\u3002
http.508.reason=Loop Detected
http.510.desc=\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u30ea\u30bd\u30fc\u30b9\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u305f\u3081\u306e\u30dd\u30ea\u30b7\u30fc\u304c\u6e80\u305f\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
http.510.reason=Not Extended
http.511.desc=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306f\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30a2\u30af\u30bb\u30b9\u3092\u53d6\u5f97\u3059\u308b\u305f\u3081\u306b\u8a8d\u8a3c\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
http.511.reason=Network Authentication Required

jdbcAccessLogValve.close=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30af\u30ed\u30fc\u30ba\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
jdbcAccessLogValve.exception=\u30a2\u30af\u30bb\u30b9\u30a8\u30f3\u30c8\u30ea\u306e\u633f\u5165\u3092\u5b9f\u884c\u4e2d\u306e\u4f8b\u5916\u3067\u3059

remoteCidrValve.invalid="[{0}]" \u306b\u4e0d\u6b63\u306a\u5024\u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002\u8a73\u7d30\u306f\u524d\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
remoteCidrValve.noRemoteIp=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e IP \u30a2\u30c9\u30ec\u30b9\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u62d2\u5426\u3057\u307e\u3059\u3002

remoteIpValve.invalidHostHeader=HTTP \u30d8\u30c3\u30c0 [{1}] \u4e2d\u306e Host \u306b\u7121\u52b9\u306a\u5024 [{0}] \u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f
remoteIpValve.invalidHostWithPort=HTTP \u30d8\u30c3\u30c0 [{1}] \u4e2d\u306e Host \u306e\u5024 [{0}] \u306f\u30dd\u30fc\u30c8\u756a\u53f7\u3092\u542b\u3093\u3067\u3044\u307e\u3059\u304c\u7121\u8996\u3055\u308c\u307e\u3059
remoteIpValve.invalidPortHeader=HTTP \u30d8\u30c3\u30c0\u30fc [{1}] \u306b\u4e0d\u6b63\u306a\u30dd\u30fc\u30c8\u756a\u53f7 [{0}] \u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002

requestFilterValve.configInvalid=Valve\u3068\u305d\u306e\u89aa\u30b3\u30f3\u30c6\u30ca\u306e\u8d77\u52d5\u3092\u59a8\u3052\u305fRemote [Addr | Host] Valve\u306b1\u3064\u4ee5\u4e0a\u306e\u7121\u52b9\u306a\u69cb\u6210\u8a2d\u5b9a\u304c\u63d0\u4f9b\u3055\u308c\u307e\u3057\u305f\u3002
requestFilterValve.deny=\u30d7\u30ed\u30d1\u30c6\u30a3 [{1}] \u306b\u3088\u308a [{0}] \u3078\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u62d2\u5426\u3057\u307e\u3057\u305f\u3002

sslValve.certError=java.security.cert.X509Certificate\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u751f\u6210\u3059\u308b\u305f\u3081\u306e\u8a3c\u660e\u66f8\u6587\u5b57\u5217[{0}]\u306e\u51e6\u7406\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
sslValve.invalidProvider=\u30ea\u30af\u30a8\u30b9\u30c8 [{0}] \u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30b3\u30cd\u30af\u30bf\u30fc\u306b\u6307\u5b9a\u3055\u308c\u305f SSL \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306f\u4e0d\u6b63\u3067\u3059\u3002\u8a3c\u660e\u66f8\u30c7\u30fc\u30bf\u3092\u51e6\u7406\u3067\u304d\u307e\u305b\u3093\u3002

stuckThreadDetectionValve.notifyStuckThreadCompleted=\u30b9\u30ec\u30c3\u30c9[{0}]\uff08id = [{3}]\uff09\u306f\u4ee5\u524d\u306b\u30b9\u30bf\u30c3\u30af\u3055\u308c\u3066\u3044\u308b\u3068\u5831\u544a\u3055\u308c\u307e\u3057\u305f\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002\u305d\u308c\u306f\u304a\u3088\u305d[{1}]\u30df\u30ea\u79d2\u306e\u9593\u30a2\u30af\u30c6\u30a3\u30d6\u3060\u3063\u305f\u3002\n\
\ {2,choice,0#|0< \u3053\u306e\u30d0\u30eb\u30d6\u306b\u3088\u3063\u3066\u76e3\u8996\u3055\u308c\u3066\u3044\u308b\u30b9\u30ec\u30c3\u30c9 [{2}] \u306f\u6b8b\u3063\u3066\u3044\u307e\u3059\u304c\u3001\u30b9\u30bf\u30c3\u30af\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002}
stuckThreadDetectionValve.notifyStuckThreadDetected=\u30b9\u30ec\u30c3\u30c9[{0}]\uff08ID = [{6}]\uff09\u306f[{1}]\u30df\u30ea\u79d2\uff08[{2}\u4ee5\u964d\uff09\u304b\u3089[{4}]\u306b\u5bfe\u3059\u308b\u540c\u3058\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u51e6\u7406\u3059\u308b\u305f\u3081\u306b\u30a2\u30af\u30c6\u30a3\u30d6\u3067\u3042\u308a\u3001\u30b9\u30bf\u30c3\u30af\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059(\u3053\u306eStuckThreadDetectionValve\u306e\u8a2d\u5b9a\u3055\u308c\u305f\u3057\u304d\u3044\u5024(threshold )\u306f[{5}]\u79d2\u3067\u3059\uff09\u3002\u3053\u306eValve\u306b\u3088\u3063\u3066\u76e3\u8996\u3055\u308c\u3066\u3044\u308b\u30b9\u30ec\u30c3\u30c9\u306f\u5408\u8a08\u3067[{3}]\u500b\u3042\u308a\u3001\u30b9\u30bf\u30c3\u30af\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
stuckThreadDetectionValve.notifyStuckThreadInterrupted=\u30b9\u30ec\u30c3\u30c9 [{0}] (id=[{5}]) \u306b\u5272\u308a\u8fbc\u307f\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002[{3}] \u306b\u5bfe\u3059\u308b\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u51e6\u7406\u6642\u9593\u304c [{1}] \u30df\u30ea\u79d2 ([{2}] \u304b\u3089\u958b\u59cb) \u3092\u8d85\u904e\u3057\u305f\u305f\u3081\u51e6\u7406\u304c\u9032\u307e\u306a\u304f\u306a\u3063\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002StuckThreadDetectionValve \u306b\u306f\u5272\u308a\u8fbc\u307f\u304c\u767a\u751f\u3059\u308b\u307e\u3067\u306e\u6642\u9593 [{4}] \u79d2\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
