# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

accessLogValve.alreadyExists=\uc811\uadfc \ub85c\uadf8 \ud30c\uc77c\uc744 [{0}]\uc5d0\uc11c [{1}](\uc73c)\ub85c \uc774\ub984\uc744 \ubcc0\uacbd\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4. \ud30c\uc77c\uc774 \uc774\ubbf8 \uc874\uc7ac\ud569\ub2c8\ub2e4.
accessLogValve.closeFail=\uc811\uadfc \ub85c\uadf8 \ud30c\uc77c\uc744 \ub2eb\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
accessLogValve.deleteFail=\uc774\uc804 \uc811\uadfc \ub85c\uadf8 \ud30c\uc77c [{0}]\uc744(\ub97c) \uc0ad\uc81c\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
accessLogValve.invalidLocale=\ub85c\ucf00\uc77c\uc744 [{0}](\uc73c)\ub85c \uc124\uc815\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
accessLogValve.invalidPortType=\uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \ud3ec\ud2b8 \ud0c0\uc785 [{0}]. \uc11c\ubc84 (\ub85c\uceec) \ud3ec\ud2b8\ub97c \uc0ac\uc6a9\ud569\ub2c8\ub2e4.
accessLogValve.openDirFail=\uc811\uadfc \ub85c\uadf8 \ud30c\uc77c(\ub4e4)\uc744 \uc704\ud55c \ub514\ub809\ud1a0\ub9ac [{0}]\uc744(\ub97c) \uc0dd\uc131\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
accessLogValve.openFail=\uc811\uadfc \ub85c\uadf8 \ud30c\uc77c [{0}]\uc744(\ub97c) \uc5f4\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
accessLogValve.renameFail=\uc811\uadfc \ub85c\uadf8 \ud30c\uc77c\uc744 [{0}]\uc5d0\uc11c [{1}](\uc73c)\ub85c \uc774\ub984\uc744 \ubcc0\uacbd\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
accessLogValve.rotateFail=\uc811\uadfc \ub85c\uadf8\ub97c \uc21c\ud658\uc2dc\ud0a4\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
accessLogValve.unsupportedEncoding=\uc778\ucf54\ub529\uc744 [{0}](\uc73c)\ub85c \uc124\uc815\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4. \uc2dc\uc2a4\ud15c \uae30\ubcf8 \ubb38\uc790\uc14b\uc744 \uc0ac\uc6a9\ud560 \uac83\uc785\ub2c8\ub2e4.
accessLogValve.writeFail=\ub2e4\uc74c \ub85c\uadf8 \uba54\uc2dc\uc9c0\ub97c \uc4f0\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4: [{0}]

errorReportValve.description=\uc124\uba85
errorReportValve.exception=\uc608\uc678
errorReportValve.exceptionReport=\uc608\uc678 \ubcf4\uace0
errorReportValve.message=\uba54\uc2dc\uc9c0
errorReportValve.noDescription=\uc124\uba85\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
errorReportValve.note=\ube44\uace0
errorReportValve.rootCause=\uadfc\ubcf8 \uc6d0\uc778 (root cause)
errorReportValve.rootCauseInLogs=\uadfc\ubcf8 \uc6d0\uc778(root cause)\uc758 \ud480 \uc2a4\ud0dd \ud2b8\ub808\uc774\uc2a4\ub97c, \uc11c\ubc84 \ub85c\uadf8\ub4e4\uc5d0\uc11c \ud655\uc778\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
errorReportValve.statusHeader=HTTP \uc0c1\ud0dc {0} \u2013 {1}
errorReportValve.statusReport=\uc0c1\ud0dc \ubcf4\uace0
errorReportValve.type=\ud0c0\uc785
errorReportValve.unknownReason=\uc54c \uc218 \uc5c6\ub294 \uc0ac\uc720

extendedAccessLogValve.badXParam=\uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 x \ud30c\ub77c\ubbf8\ud130 \ud3ec\ub9f7. \ud3ec\ub9f7\uc740 'x-#(...) \uc774\uc5b4\uc57c \ud569\ub2c8\ub2e4.
extendedAccessLogValve.badXParamValue=\uc11c\ube14\ub9bf \uc694\uccad\uc744 \uc704\ud574 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 x \ud30c\ub77c\ubbf8\ud130 \uac12: [{0}]
extendedAccessLogValve.decodeError=[{0}](\uc73c)\ub85c \uc2dc\uc791\ud558\ub294 \ubb38\uc790\ub4e4\uc758 \ub098\uba38\uc9c0 \ubd80\ubd84\uc744 \ub514\ucf54\ub4dc\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
extendedAccessLogValve.emptyPattern=\ud328\ud134\uc774 \uadf8\uc800 \ube48 \ubb38\uc790\uc5f4\uc774\uc5c8\uac70\ub098, \uacf5\ubc31 \ubb38\uc790\ub85c\ub9cc \ucc44\uc6cc\uc9c4 \ubb38\uc790\uc5f4\uc774\uc5c8\uc2b5\ub2c8\ub2e4.
extendedAccessLogValve.noClosing=\ub514\ucf54\ub4dc\ub41c \uc811\uadfc \ub85c\uadf8 \ud589\uc5d0\uc11c \ub2eb\ub294 \uc911\uad04\ud638, '')'', \uac00 \uc5c6\uc2b5\ub2c8\ub2e4.
extendedAccessLogValve.patternParseError=\ud328\ud134 [{0}]\uc744(\ub97c) \ud30c\uc2f1\ud558\ub294 \uc911 \uc624\ub958 \ubc1c\uc0dd

http.400.desc=\ud074\ub77c\uc774\uc5b8\ud2b8 \uc624\ub958\ub85c\uc11c \uc778\uc9c0\ub41c \uc5b4\ub5a4 \ubb38\uc81c\ub85c \uc778\ud558\uc5ec, \uc11c\ubc84\uac00 \ud574\ub2f9 \uc694\uccad\uc744 \ucc98\ub9ac\ud560 \uc218 \uc5c6\uac70\ub098, \ucc98\ub9ac\ud558\uc9c0 \uc54a\uc744 \uac83\uc785\ub2c8\ub2e4. (\uc608: \uc798\ubabb\ub41c \uc694\uccad \ubb38\ubc95, \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \uc694\uccad \uba54\uc2dc\uc9c0 framing, \ub610\ub294 \uc2e0\ub8b0\ud560 \uc218 \uc5c6\ub294 \uc694\uccad \ub77c\uc6b0\ud305).
http.400.reason=\uc798\ubabb\ub41c \uc694\uccad
http.401.desc=\ub300\uc0c1 \ub9ac\uc18c\uc2a4\uc5d0 \uc811\uadfc\ud558\uae30 \uc704\ud55c \uc720\ud6a8\ud55c \uc778\uc99d credentials\uac00 \uc5c6\uae30 \ub54c\ubb38\uc5d0, \uc694\uccad\uc5d0 \uc801\uc6a9\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
http.401.reason=\uc778\uac00 \uc548\ub428
http.402.desc=\uc774 \uc0c1\ud0dc \ucf54\ub4dc\ub294 \ubbf8\ub798\uc758 \uc0ac\uc6a9\uc744 \uc704\ud574 \uc608\uc57d\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
http.402.reason=\uc9c0\ubd88\uc774 \uc694\uad6c\ub428
http.403.desc=\uc11c\ubc84\uac00 \uc694\uccad\uc744 \uc774\ud574\ud588\uc73c\ub098 \uc2b9\uc778\uc744 \uac70\ubd80\ud569\ub2c8\ub2e4.
http.403.reason=\uae08\uc9c0\ub428
http.404.desc=Origin \uc11c\ubc84\uac00 \ub300\uc0c1 \ub9ac\uc18c\uc2a4\ub97c \uc704\ud55c \ud604\uc7ac\uc758 representation\uc744 \ucc3e\uc9c0 \ubabb\ud588\uac70\ub098, \uadf8\uac83\uc774 \uc874\uc7ac\ud558\ub294\uc9c0\ub97c \ubc1d\ud788\ub824 \ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
http.404.reason=\ucc3e\uc744 \uc218 \uc5c6\uc74c
http.405.desc=\uc694\uccad \ud589\uc5d0 \ud3ec\ud568\ub41c \ud574\ub2f9 \uba54\uc18c\ub4dc\ub294, origin \uc11c\ubc84\uc5d0 \uc758\ud574 \uc778\uc9c0\ub418\uc5c8\uc73c\ub098, \ub300\uc0c1 \ub9ac\uc18c\uc2a4\uc5d0 \uc758\ud574 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
http.405.reason=\ud5c8\uc6a9\ub418\uc9c0 \uc54a\ub294 \uba54\uc18c\ub4dc
http.406.desc=\uc694\uccad\uc73c\ub85c\ubd80\ud130 \ubc1b\uc740 proactive negotiation \ud5e4\ub354\uc5d0 \ub530\ub974\uba74, \ub300\uc0c1 \ub9ac\uc18c\uc2a4\ub294 \ud574\ub2f9 user agent\uac00 \ubc1b\uc544\ub4e4\uc77c\ub9cc\ud55c \ud604\uc7ac\uc758 representation\uc774 \uc5c6\uace0, \uc11c\ubc84 \ub610\ud55c \uae30\ubcf8 representation\uc744 \uc81c\uacf5\ud558\uc9c0 \uc54a\uc73c\ub824 \ud569\ub2c8\ub2e4.
http.406.reason=\ubc1b\uc544\ub4e4\uc77c \uc218 \uc5c6\uc74c
http.407.desc=\uc774 \uc0c1\ud0dc \ucf54\ub4dc\ub294 401 (\uc778\uc99d \uc548\ub428)\uacfc \uc720\uc0ac\ud558\ub098, \uc774\ub294 \ud074\ub77c\uc774\uc5b8\ud2b8\uac00 \ud504\ub85d\uc2dc\ub97c \uc0ac\uc6a9\ud558\uae30 \uc704\ud558\uc5ec \uc2a4\uc2a4\ub85c\ub97c \uc778\uc99d\ud560 \ud544\uc694\uac00 \uc788\uc74c\uc744 \uc54c\ub824\uc90d\ub2c8\ub2e4.
http.407.reason=\ud504\ub85d\uc2dc \uc778\uc99d\uc774 \uc694\uad6c\ub428
http.408.desc=\ub300\uae30\ud558\ub3c4\ub85d \uc900\ube44\ub41c \uc2dc\uac04 \uc774\ub0b4\uc5d0, \uc11c\ubc84\uac00 \uc644\uc804\ud55c \uc694\uccad \uba54\uc2dc\uc9c0\ub97c \uc218\uc2e0\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
http.408.reason=\uc694\uccad \uc81c\ud55c \uc2dc\uac04 \ucd08\uacfc
http.409.desc=\ub300\uc0c1 \ub9ac\uc18c\uc2a4\uc758 \ud604\uc7ac \uc0c1\ud0dc\uc640\uc758 \ucda9\ub3cc \ub54c\ubb38\uc5d0, \uc694\uccad\uc774 \uc644\ub8cc\ub420 \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.
http.409.reason=\ucda9\ub3cc\ub428
http.410.desc=\ub300\uc0c1 \ub9ac\uc18c\uc2a4\uc5d0 \ub300\ud55c \uc811\uadfc\uc774 \ud574\ub2f9 origin \uc11c\ubc84\uc5d0\uc11c \ub354\uc774\uc0c1 \uac00\uc6a9\ud558\uc9c0 \uc54a\uc73c\uba70, \uc774\ub7ec\ud55c \uc870\uac74\uc740 \uc544\ub9c8\ub3c4 \uc601\uad6c\uc801\uc77c \uac83\uc73c\ub85c \ubcf4\uc785\ub2c8\ub2e4.
http.410.reason=\uc0ac\ub77c\uc84c\uc74c
http.411.desc=Content-Length\uac00 \uc815\uc758\ub418\uc9c0 \uc54a\uc740 \uc694\uccad\uc744, \uc11c\ubc84\uac00 \ubc1b\uc544\ub4e4\uc774\uae30\ub97c \uac70\ubd80\ud588\uc2b5\ub2c8\ub2e4.
http.411.reason=Length\uac00 \uc694\uad6c\ub428
http.412.desc=\uc11c\ubc84\uc5d0\uc11c \uac80\uc0ac\ub420 \ub54c, \uc694\uccad \ud5e4\ub354 \ud544\ub4dc\ub4e4 \ub0b4\uc5d0 \uc8fc\uc5b4\uc9c4 \ud558\ub098 \uc774\uc0c1\uc758 \uc870\uac74(\ub4e4)\uc774, false\ub85c \ud3c9\uac00\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
http.412.reason=\uc0ac\uc804 \uc870\uac74 \ucda9\uc871 \uc2e4\ud328
http.413.desc=\uc694\uccad\uc758 payload\uac00 \uc11c\ubc84\uac00 \ucc98\ub9ac\ud558\ub824 \ud558\uac70\ub098 \ucc98\ub9ac\ud560 \uc218 \uc788\ub294 \uac83 \ubcf4\ub2e4 \ud06c\uae30 \ub54c\ubb38\uc5d0, \uc11c\ubc84\uac00 \uc694\uccad \ucc98\ub9ac\ub97c \uac70\ubd80\ud569\ub2c8\ub2e4.
http.413.reason=Payload\uac00 \ub108\ubb34 \ud07d\ub2c8\ub2e4.
http.414.desc=\uc11c\ubc84\uac00 \ucc98\ub9ac\ud560 \uc218 \uc788\ub294 \uac83\ubcf4\ub2e4 request-target\uc774 \ub354 \uae38\uae30 \ub54c\ubb38\uc5d0, \uc694\uccad\uc5d0 \ub300\ud55c \uc11c\ube44\uc2a4\ub97c \uac70\ubd80\ud569\ub2c8\ub2e4.
http.414.reason=URI\uac00 \ub108\ubb34 \uae41\ub2c8\ub2e4.
http.415.desc=Payload\uac00 \ub300\uc0c1 \ub9ac\uc18c\uc2a4\uc5d0 \ub300\ud55c \uc774 \uba54\uc18c\ub4dc\uc5d0 \uc758\ud574 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\ub294 \ud3ec\ub9f7\uc774\uae30 \ub54c\ubb38\uc5d0, Origin \uc11c\ubc84\uac00 \uc694\uccad\uc744 \uc11c\ube44\uc2a4\ud558\uae30\ub97c \uac70\ubd80\ud569\ub2c8\ub2e4.
http.415.reason=\uc9c0\uc6d0\ub418\uc9c0 \uc54a\ub294 Media Type
http.416.desc=\uc694\uccad\uc758 Range \ud5e4\ub354 \ud544\ub4dc \ub0b4\uc758 \ubc94\uc704\ub4e4 \uc911 \uc5b4\ub290 \uac83\ub3c4, \uc120\ud0dd\ub41c \ub9ac\uc18c\uc2a4\uc758 \ud604\uc7ac \ubc94\uc704\uc640 \uacb9\uce58\uc9c0 \uc54a\uac70\ub098, \uc694\uccad\ub41c \ubc94\uc704\ub4e4\uc758 \uc9d1\ud569\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \ubc94\uc704\ub4e4, \ub610\ub294 \uacfc\ub3c4\ud558\uac8c \uc791\uac70\ub098 \uacb9\uce58\ub294 \ubc94\uc704\ub4e4\uc774\uae30 \ub54c\ubb38\uc5d0 \uac70\uc808\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
http.416.reason=\ucda9\uc871\ub420 \uc218 \uc5c6\ub294 \ubc94\uc704
http.417.desc=\uc694\uccad\uc758 Expect \ud5e4\ub354 \ud544\ub4dc\uc5d0 \uc8fc\uc5b4\uc9c4 expectation\uc774, \uc801\uc5b4\ub3c4 \ud558\ub098 \uc774\uc0c1\uc758 inbound \uc11c\ubc84\ub4e4\uc5d0 \uc758\ud574 \ucda9\uc871\ub420 \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.
http.417.reason=Expectation Failed
http.421.desc=\uc694\uccad\uc774 \uc751\ub2f5\uc744 \uc0dd\uc131\ud560 \uc218 \uc5c6\ub294 \uc11c\ubc84\ub85c \uc804\ub2ec\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
http.421.reason=\uc798\ubabb \uc548\ub0b4\ub41c \uc694\uccad
http.422.desc=\uc11c\ubc84\uac00 \uc694\uccad \uc5d4\ud2f0\ud2f0\uc758 Content-Type\uc744 \uc774\ud574\ud558\uace0, \uc694\uccad \uc5d4\ud2f0\ud2f0\uc758 \ubb38\ubc95\uc774 \uc62c\ubc14\ub974\uac8c \ub418\uc5b4 \uc788\uc9c0\ub9cc, \ud3ec\ud568\ub41c instruction\ub4e4\uc744 \ucc98\ub9ac\ud560 \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.
http.422.reason=\ucc98\ub9ac\ud560 \uc218 \uc5c6\ub294 \uc5d4\ud2f0\ud2f0
http.423.desc=\uba54\uc18c\ub4dc\uc758 \uc6d0\ubcf8 \ub610\ub294 \ub300\uc0c1 \ub9ac\uc18c\uc2a4\uac00 \uc7a0\uae08 \uc0c1\ud0dc\uc785\ub2c8\ub2e4.
http.423.reason=\uc7a0\uaca8\uc9d0
http.424.desc=\uc694\uccad\ub41c \uc561\uc158\uc774 \uc774\ubbf8 \uc2e4\ud328\ud55c \ub610 \ub2e4\ub978 \uc561\uc158\uc5d0 \uc758\uc874\ud558\uace0 \uc788\uc5c8\uae30 \ub54c\ubb38\uc5d0, \ud574\ub2f9 \ub9ac\uc18c\uc2a4\uc5d0 \ub300\ud574 \uc774 \uba54\uc18c\ub4dc\ub97c \uc218\ud589\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
http.424.reason=\uc2e4\ud328\ud55c \uc758\uc874\uc801 \uc694\uccad
http.426.desc=\uc11c\ubc84\uac00 \ud604\uc7ac\uc758 \ud504\ub85c\ud1a0\ucf5c\uc744 \uc0ac\uc6a9\ud558\uc5ec \uc694\uccad\uc744 \ucc98\ub9ac\ud558\uae30\ub97c \uac70\ubd80\ud588\uc9c0\ub9cc, \ud074\ub77c\uc774\uc5b8\ud2b8\uac00 \ub2e4\ub978 \ud504\ub85c\ud1a0\ucf5c\ub85c \uc5c5\uadf8\ub808\uc774\ub4dc\ud55c \ud6c4\uc5d0 \ucc98\ub9ac\ud558\ub824 \ud560 \uc218\ub3c4 \uc788\uc2b5\ub2c8\ub2e4.
http.426.reason=\uc5c5\uadf8\ub808\uc774\ub4dc\uac00 \uc694\uad6c\ub428
http.428.desc=Origin \uc11c\ubc84\ub294 \uc694\uccad\uc774 \uc0ac\uc804 \uc870\uac74\uc801\uc774\uae30\ub97c \uc694\uad6c\ud569\ub2c8\ub2e4 (\uc608: If-Match\uc640 \uac19\uc740 \ud5e4\ub354).
http.428.reason=\uc0ac\uc804\uc870\uac74\uc774 \ud544\uc218\uc801\uc785\ub2c8\ub2e4.
http.429.desc=\uc0ac\uc6a9\uc790\uac00 \uc8fc\uc5b4\uc9c4 \uc2dc\uac04 \ub3d9\uc548 \ub108\ubb34 \ub9ce\uc740 \uc694\uccad\uc744 \ubcf4\ub0c8\uc2b5\ub2c8\ub2e4. ("rate limiting")
http.429.reason=\ub108\ubb34 \ub9ce\uc740 \uc694\uccad\ub4e4
http.431.desc=\uc694\uccad \ub0b4\uc758 \ud5e4\ub354 \ud544\ub4dc\ub4e4\uc774 \ub108\ubb34 \ucee4\uc11c \uc11c\ubc84\uac00 \ucc98\ub9ac\ud558\ub824 \ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
http.431.reason=\uc694\uccad\uc758 \ud5e4\ub354 \ud544\ub4dc\ub4e4\uc774 \ub108\ubb34 \ud07c
http.451.desc=\uc11c\ubc84\uac00 \ubc95\uc801\uc778 \uc0ac\uc720\ub4e4\ub85c \uc774 \uc694\uccad\uc744 \uac70\ubd80\ud588\uc2b5\ub2c8\ub2e4.
http.451.reason=\ubc95\uc801\uc778 \uc0ac\uc720\ub4e4\ub85c \uc778\ud558\uc5ec \uac00\uc6a9\ud558\uc9c0 \uc54a\uc74c
http.500.desc=\uc11c\ubc84\uac00, \ud574\ub2f9 \uc694\uccad\uc744 \ucda9\uc871\uc2dc\ud0a4\uc9c0 \ubabb\ud558\uac8c \ud558\ub294 \uc608\uae30\uce58 \uc54a\uc740 \uc870\uac74\uc744 \ub9de\ub2e5\ub728\ub838\uc2b5\ub2c8\ub2e4.
http.500.reason=\ub0b4\ubd80 \uc11c\ubc84 \uc624\ub958
http.501.desc=\uc11c\ubc84\uac00 \uc774 \uc694\uccad\uc744 \ucda9\uc871\uc2dc\ud0a4\ub294\ub370 \ud544\uc694\ud55c \ud544\uc218\uc801\uc778 \uae30\ub2a5\uc744 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
http.501.reason=\uad6c\ud604\ub418\uc9c0 \uc54a\uc74c
http.502.desc=\uc11c\ubc84\uac00 \uac8c\uc774\ud2b8\uc6e8\uc774 \ub610\ub294 \ud504\ub85d\uc2dc\ub85c\uc11c \ub3d9\uc791\ud558\uba74\uc11c \uc694\uccad\uc744 \ucc98\ub9ac\ud558\ub824 \uc2dc\ub3c4\ud558\ub294 \ub3d9\uc548, inbound \uc11c\ubc84\ub85c\ubd80\ud130 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \uc751\ub2f5\uc744 \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
http.502.reason=\uc798\ubabb\ub41c \uac8c\uc774\ud2b8\uc6e8\uc774
http.503.desc=\uc77c\uc2dc\uc801\uc778 \uc11c\ubc84 \ubd80\ud558 \ub610\ub294 \uc608\uc815\ub41c \uc720\uc9c0\ubcf4\uc218 \uc791\uc5c5\uc73c\ub85c \uc778\ud558\uc5ec, \uc11c\ubc84\uac00 \ud604\uc7ac \uc694\uccad\uc744 \ucc98\ub9ac\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc7a0\uc2dc \uc9c0\uc5f0\ub41c \ub4a4\uc5d0 \uc0c1\ud669\uc774 \ub098\uc544\uc9c8 \uac83\uc73c\ub85c \ubcf4\uc785\ub2c8\ub2e4.
http.503.reason=\uc11c\ube44\uc2a4\uac00 \uac00\uc6a9\ud558\uc9c0 \uc54a\uc74c
http.504.desc=\uc11c\ubc84\uac00 \uac8c\uc774\ud2b8\uc6e8\uc774 \ub610\ub294 \ud504\ub85d\uc2dc\ub85c \ub3d9\uc791\ud558\ub294 \ub3d9\uc548, \uc694\uccad\uc744 \ucc98\ub9ac \uc644\ub8cc\ud558\uae30 \uc704\ud574 \uc811\uadfc\ud574\uc57c \ud558\ub294 \uc0c1\uc704 \uc11c\ubc84\ub85c\ubd80\ud130, \ud544\uc694\ud55c \uc751\ub2f5\uc744 \uc801\uc808\ud55c \uc2dc\uac04 \ub0b4\uc5d0 \ubc1b\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
http.504.reason=\uac8c\uc774\ud2b8\uc6e8\uc774 \uc81c\ud55c \uc2dc\uac04 \ucd08\uacfc
http.505.desc=\uc11c\ubc84\uac00 \uc694\uccad \uba54\uc2dc\uc9c0\uc5d0\uc11c \uc0ac\uc6a9\ub41c HTTP\uc758 major \ubc84\uc804\uc744 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\uac70\ub098, \ub610\ub294 \uc9c0\uc6d0\ud558\uae30\ub97c \uac70\ubd80\ud569\ub2c8\ub2e4.
http.505.reason=HTTP \ubc84\uc804\uc774 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc74c
http.506.desc=\uc11c\ubc84\uc5d0 \ub0b4\ubd80 \uc124\uc815 \uc624\ub958\uac00 \uc788\uc2b5\ub2c8\ub2e4: \uc120\ud0dd\ub41c \ubcc0\ud615(variant) \ub9ac\uc18c\uc2a4\uac00, \ud22c\uba85\ud55c \ucee8\ud150\ud2b8 \uad50\uc12d(negotiation) \uadf8 \uc790\uccb4\uc5d0 \uad00\uc5ec\ud558\ub3c4\ub85d \uc124\uc815\ub418\uc5b4 \uc788\ub294\ub370, \uadf8\ub85c \uc778\ud558\uc5ec \uad50\uc12d \ud504\ub85c\uc138\uc2a4\uc5d0 \uc801\uc808\ud55c \uc5d4\ub4dc\ud3ec\uc778\ud2b8\uac00 \uc544\ub2d9\ub2c8\ub2e4.
http.506.reason=Variant Also Negotiates
http.507.desc=\uc11c\ubc84\uac00 \uc694\uccad \ucc98\ub9ac\ub97c \uc131\uacf5\uc801\uc73c\ub85c \uc644\ub8cc\ud558\uae30 \uc704\ud574 \ud544\uc694\ud55c representation\uc744 \uc800\uc7a5\ud560 \uc218 \uc5c6\uae30 \ub54c\ubb38\uc5d0, \ud574\ub2f9 \uba54\uc18c\ub4dc\uac00 \ud574\ub2f9 \ub9ac\uc18c\uc2a4\uc5d0 \ub300\ud574 \ucc98\ub9ac\ub420 \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.
http.507.reason=\ucda9\ubd84\ud558\uc9c0 \uc54a\uc740 \uc800\uc7a5 \uacf5\uac04
http.508.desc=\uc11c\ubc84\uac00 "Depth: infinity"\ub97c \uac00\uc9c4 \uc694\uccad\uc744 \ucc98\ub9ac\ud558\ub294 \ub3c4\uc911, \ubb34\ud55c \ub8e8\ud504\ub97c \ub9de\ub2e5\ub728\ub9ac\ub294 \ubc14\ub78c\uc5d0 \uc624\ud37c\ub808\uc774\uc158\uc744 \uc885\ub8cc\uc2dc\ucf30\uc2b5\ub2c8\ub2e4.
http.508.reason=\ub8e8\ud504\uac00 \ud0d0\uc9c0\ub428
http.510.desc=\uc694\uccad\uc774, \ub9ac\uc18c\uc2a4\uc5d0 \uc811\uadfc\ud558\uae30 \uc704\ud55c policy\ub97c \ucda9\uc871\uc2dc\ud0a4\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
http.510.reason=\ud655\uc7a5 \uc548\ub428
http.511.desc=\ud074\ub77c\uc774\uc5b8\ud2b8\uac00 \ub124\ud2b8\uc6cc\ud06c\uc5d0 \uc811\uadfc\ud558\uae30 \uc704\ud574\uc11c\ub294 \uc778\uc99d\uc744 \ud574\uc57c \ud569\ub2c8\ub2e4.
http.511.reason=\ub124\ud2b8\uc6cc\ud06c \uc778\uc99d\uc774 \ud544\uc694\ud568

jdbcAccessLogValve.close=\ub370\uc774\ud130\ubca0\uc774\uc2a4\ub97c \ub2eb\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
jdbcAccessLogValve.exception=\uc811\uadfc \uc5d4\ud2b8\ub9ac\ub97c \ucd94\uac00\ud558\ub294 \uc911 \uc608\uc678 \ubc1c\uc0dd

persistentValve.filter.failure=\ud544\ud130\ub97c \ucef4\ud30c\uc77c\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4: [{0}]

remoteCidrValve.invalid=[{0}]\uc744(\ub97c) \uc704\ud574 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \uc124\uc815\uc774 \uc81c\uacf5\ub418\uc5c8\uc2b5\ub2c8\ub2e4. \uc0c1\uc138 \uc815\ubcf4\ub97c \ubcf4\uc2dc\ub824\uba74 \uc774\uc804 \uba54\uc2dc\uc9c0\ub4e4\uc744 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
remoteCidrValve.noRemoteIp=\ud074\ub77c\uc774\uc5b8\ud2b8\uac00 IP \uc8fc\uc18c\ub97c \uac00\uc9c0\uace0 \uc788\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc694\uccad\uc740 \uac70\uc808\ub418\uc5c8\uc2b5\ub2c8\ub2e4.

remoteIpValve.invalidHostHeader=HTTP \ud5e4\ub354 [{1}] \ub0b4\uc5d0 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \uac12\uc774 \ubc1c\uacac\ub418\uc5c8\uc2b5\ub2c8\ub2e4: [{0}]
remoteIpValve.invalidHostWithPort=HTTP \ud5e4\ub354 [{1}] \ub0b4\uc758 \ud638\uc2a4\ud2b8 \uac12 [{0}]\uc774(\uac00) \ud3ec\ud2b8 \ubc88\ud638\ub97c \ud3ec\ud568\ud588\ub294\ub370, \uc774\ub294 \ubb34\uc2dc\ub420 \uac83\uc785\ub2c8\ub2e4.
remoteIpValve.invalidPortHeader=HTTP \ud5e4\ub354 [{1}] \ub0b4\uc5d0 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \ud3ec\ud2b8 \ubc88\ud638 \uac12\uc785\ub2c8\ub2e4: [{0}]

requestFilterValve.configInvalid=Remote[Addr|Host]Valve\ub97c \uc704\ud574 \ud558\ub098 \uc774\uc0c1\uc758 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \uc124\uc815\uc774 \uc81c\uacf5\ub418\uc5c8\ub294\ub370, \uc774\ub294 \ud574\ub2f9 Valve\uc640 \ubd80\ubaa8 \ucee8\ud14c\uc774\ub108\ub4e4\uc774 \uc2dc\uc791\ub418\uc9c0 \ubabb\ud558\uac8c \ud588\uc2b5\ub2c8\ub2e4.
requestFilterValve.deny=\ud504\ub85c\ud37c\ud2f0 [{1}]\uc5d0 \uae30\ubc18\ud558\uc5ec, [{0}]\uc744(\ub97c) \uc704\ud55c \uc694\uccad\uc744 \uac70\uc808\ud569\ub2c8\ub2e4.

sslValve.certError=java.security.cert.X509Certificate \uac1d\uccb4\ub97c \uc0dd\uc131\ud558\uae30 \uc704\ud55c \uc778\uc99d\uc11c \ubb38\uc790\uc5f4 [{0}]\uc744(\ub97c) \ucc98\ub9ac\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
sslValve.invalidProvider=[{0}]\uc758 \uc774 \uc694\uccad\uacfc \uc5f0\uad00\ub41c Connector\uc5d0 \uc9c0\uc815\ub41c SSL provider\ub294 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ud574\ub2f9 \uc778\uc99d\uc11c \ub370\uc774\ud130\uac00 \ucc98\ub9ac\ub420 \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.

stuckThreadDetectionValve.notifyStuckThreadCompleted=\uc4f0\ub808\ub4dc [{0}] (ID=[{3}])\uc774(\uac00) \uc774\uc804\uc5d0 stuck \uc0c1\ud0dc\ub85c \ubcf4\uace0\ub41c \ubc14 \uc788\uc73c\ub098 \uc774\uc81c \uc644\ub8cc\ub418\uc5c8\uc2b5\ub2c8\ub2e4. \ud574\ub2f9 \uc4f0\ub808\ub4dc\ub294 \ub300\ub7b5 [{1}] \ubc00\ub9ac\ucd08 \ub3d9\uc548 \ud65c\uc131\ud654\ub418\uc5b4 \uc788\uc5c8\uc2b5\ub2c8\ub2e4. {2,choice,0#|0< \uc774 Valve\uc5d0 \uc758\ud574 \ubaa8\ub2c8\ud130\ub9c1\ub418\ub294 \uc4f0\ub808\ub4dc\ub4e4\uc774 \uc5ec\uc804\ud788 [{2}]\uac1c\uac00 \uc788\uace0, \uadf8\uac83\ub4e4\uc740 \uc5b4\uca4c\uba74 stuck \uc0c1\ud0dc\uc5d0 \uc788\uc744 \uc218 \uc788\uc2b5\ub2c8\ub2e4.}
stuckThreadDetectionValve.notifyStuckThreadDetected=\uc4f0\ub808\ub4dc [{0}] (id=[{6}])\uc774(\uac00), [{4}]\uc744(\ub97c) \uc704\ud55c \ub3d9\uc77c\ud55c \uc694\uccad\uc744 \ucc98\ub9ac\ud558\uae30 \uc704\ud574, ([{2}] \uc774\ud6c4) [{1}] \ubc00\ub9ac\ucd08 \ub3d9\uc548 \ud65c\uc131\ud654\ub418\uc5b4 \uc788\uc5c8\uc73c\uba70, \ud574\ub2f9 \uc4f0\ub808\ub4dc\uac00 stuck\ub41c \uc0c1\ud0dc\uc5d0 \uc788\uc744 \uc218 \uc788\uc2b5\ub2c8\ub2e4.\n\
(\uc774 StuckThreadDetectionValve\ub97c \uc704\ud55c stuck \uc0c1\ud0dc \uc9c4\uc785 \uae30\uc900\uc810\uc740 [{5}] \ucd08\uc785\ub2c8\ub2e4.) \uc774 Valve\uc5d0 \uc758\ud574 \ubaa8\ub2c8\ud130\ub418\ub294 \uc804\uccb4 \uc4f0\ub808\ub4dc\ub4e4 \uc911 [{3}] \uac1c\uc758 \uc4f0\ub808\ub4dc\uac00 stuck \uc0c1\ud0dc\uc77c \uc218 \uc788\uc2b5\ub2c8\ub2e4.
stuckThreadDetectionValve.notifyStuckThreadInterrupted=\uc4f0\ub808\ub4dc [{0}](id=[{5}])\uc774(\uac00), [{1}] \ubc00\ub9ac\ucd08 \ub3d9\uc548 \ub3d9\uc77c \uc694\uccad\uc744 \ucc98\ub9ac\ud558\uae30 \uc704\ud574 ([{2}] \uc774\ud6c4\ub85c) [{3}] \ub3d9\uc548 \ud65c\uc131\ud654\ub418\uc5b4 \uc788\uc5c8\uc73c\ub098, \ud544\uc2dc stuck \uc0c1\ud0dc\uc5d0 \uc788\uc744 \ubc95\ud55c \uc4f0\ub808\ub4dc\uc774\uae30 \ub54c\ubb38\uc5d0 \uc911\ub2e8\ub418\uc5c8\uc2b5\ub2c8\ub2e4. (\uc774 StuckThreadDetectionValve\ub97c \uc704\ud55c \uc911\ub2e8 \ud55c\uacc4\uce58\ub294 [{4}] \ucd08\ub85c \uc124\uc815\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.)
