# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

accessLogValve.alreadyExists=\u00c9chec de renommage du journal d''acc\u00e8s de [{0}] en [{1}], le fichier existe d\u00e9j\u00e0.
accessLogValve.closeFail=\u00c9chec de fermeture du fichier de journal d'acc\u00e8s
accessLogValve.deleteFail=Impossible d''effacer l''ancien journal d''acc\u00e8s [{0}]
accessLogValve.invalidLocale=Impossible de d\u00e9finir les param\u00e8tres r\u00e9gionaux sur [{0}]
accessLogValve.invalidPortType=Type de port [{0}] invalide, utilisation du port (local) de serveur
accessLogValve.openDirFail=Echec de cr\u00e9ation du r\u00e9pertoire [{0}] pour les journaux d''acc\u00e8s
accessLogValve.openFail=Echec \u00e0 l''ouverture du journal d''acc\u00e8s [{0}]
accessLogValve.renameFail=\u00c9chec de renommage du journal d''acc\u00e8s de [{0}] en [{1}]
accessLogValve.rotateFail=\u00c9chec de rotation des journaux d'acc\u00e8s
accessLogValve.unsupportedEncoding=Impossible de changer l''encodage en [{0}], le jeu de caract\u00e8res par d\u00e9faut du syst\u00e8me sera utilis\u00e9
accessLogValve.writeFail=Impossible d''\u00e9crire le message de log [{0}]

errorReportValve.description=description
errorReportValve.exception=exception
errorReportValve.exceptionReport=Rapport d'exception
errorReportValve.message=message
errorReportValve.noDescription=Pas de description disponible
errorReportValve.note=note
errorReportValve.rootCause=cause m\u00e8re
errorReportValve.rootCauseInLogs=La trace compl\u00e8te de la cause m\u00e8re de cette erreur est disponible dans les fichiers journaux de ce serveur.
errorReportValve.statusHeader=\u00c9tat HTTP {0} \u2013 {1}
errorReportValve.statusReport=Rapport d'\u00e9tat
errorReportValve.type=Type
errorReportValve.unknownReason=Raison inconnue.

extendedAccessLogValve.badXParam=Le format du param\u00e8tre \u00e9tendu est invalide, il doit \u00eatre de la forme  'x-#(...)'
extendedAccessLogValve.badXParamValue=La valeur du param\u00e8tre \u00e9tendu est invalide pour la requ\u00eate de Servlet [{0}]
extendedAccessLogValve.decodeError=Impossible de d\u00e9coder les caract\u00e8res restants \u00e0 partir de [{0}]
extendedAccessLogValve.emptyPattern=Le mod\u00e8le est vide
extendedAccessLogValve.noClosing=Une parenth\u00e8se de fermeture n'a pas \u00e9t\u00e9 trouv\u00e9e lors du d\u00e9codage
extendedAccessLogValve.patternParseError=Erreur lors de l''analyse du mod\u00e8le [{0}]

http.400.desc=La requ\u00eate envoy\u00e9e par le client \u00e9tait syntaxiquement incorrecte.
http.400.reason=Requ\u00eate invalide
http.401.desc=La requ\u00eate n\u00e9cessite une authentification HTTP.
http.401.reason=Non authoris\u00e9
http.402.desc=Un paiement est demand\u00e9 pour acc\u00e9der \u00e0 cette ressource.
http.402.reason=Paiement requis
http.403.desc=L'acc\u00e8s \u00e0 la ressource demand\u00e9e a \u00e9t\u00e9 interdit.
http.403.reason=Interdit
http.404.desc=La ressource demand\u00e9e n'est pas disponible.
http.404.reason=Non trouv\u00e9
http.405.desc=La m\u00e9thode HTTP sp\u00e9cifi\u00e9e n'est pas autoris\u00e9e pour la ressource demand\u00e9e.
http.405.reason=M\u00e9thode non autoris\u00e9e
http.406.desc=La ressource identifi\u00e9e par cette requ\u00eate n'est capable de g\u00e9n\u00e9rer des r\u00e9ponses qu'avec des caract\u00e9ristiques incompatible avec la directive "accept" pr\u00e9sente dans l'ent\u00eate de requ\u00eate.
http.406.reason=Inacceptable
http.407.desc=Le client doit d'abord s'authentifier aupr\u00e8s du relais.
http.407.reason=Authentification Proxy est requise
http.408.desc=Le client n'a pas produit de requ\u00eate pendant le temps d'attente du serveur.
http.408.reason=Timeout de la requ\u00eate
http.409.desc=La requ\u00eate ne peut \u00eatre finalis\u00e9e suite \u00e0 un conflit li\u00e9 \u00e0 l'\u00e9tat de la ressource.
http.409.reason=Conflit
http.410.desc=La ressource demand\u00e9e n'est pas disponible, et aucune adresse de rebond (forwarding) n'est connue.
http.410.reason=Disparu
http.411.desc=La requ\u00eate ne peut \u00eatre trait\u00e9e sans d\u00e9finition d'une taille de contenu (content length).
http.411.reason=Une longueur est requise
http.412.desc=Une condition pr\u00e9alable demand\u00e9e n'est pas satisfaite pour cette requ\u00eate.
http.412.reason=Erreur dans la pr\u00e9-condition
http.413.desc=L'entit\u00e9 de requ\u00eate est plus importante que ce que le serveur veut ou peut traiter.
http.413.reason=Les donn\u00e9es sont trop grandes
http.414.desc=Le serveur a refus\u00e9 cette requ\u00eate car l'URI de requ\u00eate est trop longue.
http.414.reason=L'URI est trop longue
http.415.desc=Le serveur a refus\u00e9 cette requ\u00eate car l'entit\u00e9 de requ\u00eate est dans un format non support\u00e9 par la ressource demand\u00e9e avec la m\u00e9thode sp\u00e9cifi\u00e9e.
http.415.reason=Type de m\u00e9dia non support\u00e9
http.416.desc=La plage d'octets demand\u00e9e (byte range) ne peut \u00eatre satisfaite.
http.416.reason=Plage non r\u00e9alisable
http.417.desc=L'attente indiqu\u00e9e dans la directive "Expect" de l'ent\u00eate de requ\u00eate ne peut \u00eatre satisfaite.
http.417.reason=L'expectation a \u00e9chou\u00e9e
http.421.desc=La requ\u00eate a \u00e9t\u00e9 dirig\u00e9e vers un serveur qui est incapable de produire une r\u00e9ponse.
http.421.reason=Requ\u00eate mal dirig\u00e9e
http.422.desc=Le serveur a compris le type de contenu (content type) ainsi que la syntaxe de la requ\u00eate mais a \u00e9t\u00e9 incapable de traiter les instructions contenues.
http.422.reason=Impossible de traiter cette entit\u00e9
http.423.desc=La ressource source ou destination de la m\u00e9thode est verrouill\u00e9e.
http.423.reason=Verrouill\u00e9
http.424.desc=La m\u00e9thode n'a pas pu \u00eatre ex\u00e9cut\u00e9e sur la ressource parce qu'elle d\u00e9pendait d'une autre action qui a \u00e9chou\u00e9e
http.424.reason=Echec de d\u00e9pendence
http.426.desc=Le serveur a refus\u00e9 de traiter cette requ\u00eate en utilisant le protocole actuel mais pourrait le faire si le client en utilise un autre
http.426.reason=Mise \u00e0 jour du protocole requise
http.428.desc=Le serveur d'origine exige que la requ\u00eate soit conditionnelle
http.428.reason=Pr\u00e9condition requise
http.429.desc=L'utilisateur a effectu\u00e9 une nombre de requ\u00eates trop \u00e9lev\u00e9 dans un laps de temps trop court (limitation de fr\u00e9quence)
http.429.reason=Trop de requ\u00eates
http.431.desc=Le serveur refuse de traiter la requ\u00eate parce que ses champs d'en-t\u00eate sont trop gros
http.431.reason=Les champs d'en-t\u00eate de la requ\u00eate sont trop gros
http.451.desc=Le serveur a refus\u00e9 cette requ\u00eate pour des raisons l\u00e9gales
http.451.reason=Indisponible pour des raisons l\u00e9gales
http.500.desc=Le serveur a rencontr\u00e9 une erreur interne qui l'a emp\u00each\u00e9 de satisfaire la requ\u00eate.
http.500.reason=Erreur interne du serveur
http.501.desc=Le serveur ne supporte pas la fonctionnalit\u00e9 demand\u00e9e pour satisfaire cette requ\u00eate.
http.501.reason=Non impl\u00e9ment\u00e9e
http.502.desc=Le serveur a re\u00e7u une r\u00e9ponse invalide d'un serveur qu'il consultait en tant que relais ou passerelle.
http.502.reason=Mauvaise passerelle
http.503.desc=Le service demand\u00e9 n'est pas disponible actuellement.
http.503.reason=Service indisponible
http.504.desc=Le serveur a re\u00e7u un d\u00e9passement de d\u00e9lai (timeout) d'un serveur amont qu'il consultait en tant que relais ou passerelle.
http.504.reason=Timeout de la passerelle
http.505.desc=Le serveur ne supporte pas la version demand\u00e9e du protocole HTTP.
http.505.reason=Version HTTP non support\u00e9e
http.506.desc=Le serveur a rencontr\u00e9 une erreur de configuration interne : la variante choisie de la ressource est configur\u00e9e pour mener elle-m\u00eame la n\u00e9gociation de contenu de mani\u00e8re transparente, et n'est donc pas le bon endroit pour la n\u00e9gociation elle-m\u00eame
http.506.reason=506 Variant Also Negotiates (RFC 2295) (r\u00e9f\u00e9rence circulaire)
http.507.desc=L'espace disponible est insuffisant pour enregistrer l'\u00e9tat de la ressource apr\u00e8s ex\u00e9cution de cette m\u00e9thode.
http.507.reason=Stockage insuffisant
http.508.desc=Le serveur a mis fin \u00e0 une op\u00e9ration car il a rencontr\u00e9 une boucle infinie en traitant une requ\u00eate avec "Depth : infinity"
http.508.reason=Boucle d\u00e9tect\u00e9e
http.510.desc=La requ\u00eate ne correspond pas \u00e0 la politique d'acc\u00e8s pour cette ressource
http.510.reason=Non \u00e9tendu
http.511.desc=Le client doit s'authentifier pour acc\u00e9der au r\u00e9seau.
http.511.reason=L\u2019authentification du r\u00e9seau est n\u00e9cessaire

jdbcAccessLogValve.close=Echec de fermeture de la base de donn\u00e9e
jdbcAccessLogValve.exception=Exception en ins\u00e9rant l'entr\u00e9e de l'acc\u00e8s

persistentValve.filter.failure=Impossible de compiler le filtre=[{0}]

remoteCidrValve.invalid=La configuration fournie pour [{0}] est invalide, voir les pr\u00e9c\u00e9dents messages pour plus de d\u00e9tails
remoteCidrValve.noRemoteIp=Le client n'a pas d'adresse IP, requ\u00eate interdite

remoteIpValve.invalidHostHeader=La valeur invalide [{0}] a \u00e9t\u00e9 trouv\u00e9e pour le Host dans l''en-t\u00eate HTTP [{1}]
remoteIpValve.invalidHostWithPort=La valeur de Host [{0}] dans l''en-t\u00eate HTTP [{1}] contenait un num\u00e9ro de port qui sera ingnor\u00e9
remoteIpValve.invalidPortHeader=La valeur de port [{0}] trouv\u00e9e dans l''en-t\u00eate HTTP [{1}] est invalide

requestFilterValve.configInvalid=Un ou plusieurs param\u00e8tres de configuration sp\u00e9cifi\u00e9s pour ce Remote[Addr|Host]Valve ont emp\u00each\u00e9 la Valve et le conteneur parent de d\u00e9marrer
requestFilterValve.deny=Refus de la requ\u00eate pour [{0}] bas\u00e9 sur la propri\u00e9t\u00e9 [{1}]

sslValve.certError=Impossible de traiter le certificat [{0}] pour cr\u00e9er un objet java.security.cert.X509Certificate
sslValve.invalidProvider=Le fournisseur SSL sp\u00e9cifi\u00e9 pour le connecteur associ\u00e9 avec cette requ\u00eate de [{0}] est invalide, le certificat n''a pas pu \u00eatre trait\u00e9

stuckThreadDetectionValve.notifyStuckThreadCompleted=Le Thread [{0}] (id=[{3}]) qui a \u00e9t\u00e9 pr\u00e9alablement rapport\u00e9 comme \u00e9tant bloqu\u00e9 s''est termin\u00e9, il a \u00e9t\u00e9 actif pendant approximativement [{1}] millisecondes, il y a [{2}] thread(s) au total qui sont surveill\u00e9s par cette valve et qui pourraient \u00eatre bloqu\u00e9s
stuckThreadDetectionValve.notifyStuckThreadDetected=Le Thread [{0}] (id=[{6}]) a \u00e9t\u00e9 actif depuis [{1}] millisecondes (depuis [{2}]) pour traiter la m\u00eame requ\u00eate pour [{4}] et pourrait \u00eatre bloqu\u00e9 (le seuil configurable est de [{5}] secondes pour cette StuckThreadDetectionValve), il y a [{3}] thread(s) au total qui sont surveill\u00e9s par cette valve et qui pourraient \u00eatre bloqu\u00e9s
stuckThreadDetectionValve.notifyStuckThreadInterrupted=Le Thread [{0}] (id=[{5}]) a \u00e9t\u00e9 interrompu car il a \u00e9t\u00e9 actif depuis [{1}] millisecondes (depuis [{2}]) pour traiter la m\u00eame requ\u00eate pour [{3}] et \u00e9tait probablement bloqu\u00e9 (le seuil configurable est de [{4}] secondes pour cette StuckThreadDetectionValve)
