# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

accessLogValve.closeFail=No pude cerrar fichero de historial
accessLogValve.invalidLocale=Fallo al fijar locales a [{0}]\n
accessLogValve.openDirFail=No pude crear directorio [{0}] para historiales de acceso
accessLogValve.openFail=Fallo al abrir el archivo access log [{0}]\n
accessLogValve.rotateFail=No se pudo rotar el historial de acceso

errorReportValve.description=Descripci\u00f3n
errorReportValve.exception=excepci\u00f3n
errorReportValve.exceptionReport=Informe de Excepci\u00f3n
errorReportValve.message=mensaje
errorReportValve.note=nota
errorReportValve.rootCause=causa ra\u00edz
errorReportValve.rootCauseInLogs=La traza completa de la causa de este error se encuentra en los archivos de registro del servidor.
errorReportValve.statusHeader=Estado HTTP {0} \u2013 {1}
errorReportValve.statusReport=Informe de estado
errorReportValve.type=Tipo

http.400.desc=El requerimiento enviado por el cliente era sint\u00e1cticamente incorrecto.
http.401.desc=Este requerimiento requiere autenticaci\u00f3n HTTP.
http.401.reason=No autorizado
http.402.desc=Este c\u00f3digo de estado est\u00e1 reservado para uso futuro.
http.403.desc=El acceso al recurso especificado ha sido prohibido.
http.404.desc=El recurso requerido no est\u00e1 disponible.
http.404.reason=No encontrado
http.405.desc=El m\u00e9todo HTTP especificado no est\u00e1 permitido para el recurso requerido.
http.406.desc=El recurso identificado por este requerimiento s\u00f3lo es capaz de generar respuestas con caracter\u00edsticas no aceptables con arreglo a las cabeceras "accept" de requerimiento.
http.407.desc=El cliente debe de ser primero autenticado en el apoderado.
http.407.reason=Se requiere autenticaci\u00f3n de proxy
http.408.desc=El cliente no produjo un requerimiento dentro del tiempo en que el servidor estaba preparado esperando.
http.409.desc=El requerimiento no pudo ser completado debido a un conflicto con el estado actual del recurso.
http.410.desc=El recurso requerido ya no est\u00e1 disponible y no se conoce direcci\u00f3n de reenv\u00edo.
http.411.desc=Este requerimiento no puede ser manejado sin un tama\u00f1o definido de contenido.
http.412.desc=Una precondici\u00f3n especificada ha fallado para este requerimiento.
http.412.reason=La precon
http.413.desc=La entidad de requerimiento es mayor de lo que el servidor quiere o puede procesar.
http.414.desc=El servidor rechaz\u00f3 este requerimiento porque la URI requerida era demasiado larga.
http.415.desc=El servidor rechaz\u00f3 este requerimiento porque la entidad requerida se encuentra en un formato no soportado por el recurso requerido para el m\u00e9todo requerido.
http.415.reason=Tipo de medio no soportado
http.416.desc=El rango de byte requerido no puede ser satisfecho.
http.417.desc=Lo que se espera dado por la cabecera "Expect" de requerimiento no pudo ser completado.
http.421.desc=La solicitud ha sido dirigida a un servidor que no fue capaz de producir una respuesta
http.422.desc=El servidor entendi\u00f3 el tipo de contenido y la sint\u00e1xis del requerimiento pero no pudo procesar las instrucciones contenidas.
http.423.desc=La fuente o recurso de destino de un m\u00e9todo est\u00e1 bloqueada.
http.423.reason=Bloqueado
http.426.reason=Se requiere actualizaci\u00f3n
http.428.desc=El servidor de origen requiere que la petici\u00f3n sea condicional
http.429.reason=Demasiadas peticiones
http.431.reason=Los campos de cabecera solicitados son muy largos
http.500.desc=El servidor encontr\u00f3 un error interno que hizo que no pudiera rellenar este requerimiento.
http.501.desc=El servidor no soporta la funcionalidad necesaria para rellenar este requerimiento.
http.502.desc=Este servidor recibi\u00f3 una respuesta inv\u00e1lida desde un servidor que consult\u00f3 cuando actuaba como apoderado o pasarela.
http.503.desc=El servicio requerido no est\u00e1 disponible en este momento.
http.504.desc=El servidor recibi\u00f3 un Tiempo Agotado desde un servidor superior cuando actuaba como pasarela o apoderado.
http.505.desc=El servidor no soporta la versi\u00f3n de protocolo HTTP requerida.
http.505.reason=Versi\u00f3n HTTP no soportada
http.507.desc=El recurso no tiene espacio suficiente para registrar el estado del recurso tras la ejecuci\u00f3n de este m\u00e9todo.
http.507.reason=El storage no es suficiente
http.511.desc=El cliente se tiene que autenticar para tener accesso a la red

jdbcAccessLogValve.exception=Excepci\u00f3n realizando entrada de acceso a inserci\u00f3n

remoteIpValve.invalidPortHeader=Valor inv\u00e1lido [{0}] hallado para el puerto en cabecera HTTP [{1}]

requestFilterValve.configInvalid=Uno o m\u00e1s par\u00e1metros de configuraci\u00f3n inv\u00e1lidos fueron prove\u00eddos para  Remote[Addr|Host]Valve lo cual impide que el Valve y sus contenedores padres puedan iniciar

sslValve.certError=No pude procesar cadena de certificado [{0}] para crear un objeto  java.security.cert.X509Certificate
sslValve.invalidProvider=El proveedor de SSL especificado en el conecto asociado con este requerimiento de [{0}] ies inv\u00e1lido. No se pueden procesar los datos del certificado.

stuckThreadDetectionValve.notifyStuckThreadCompleted=El hilo [{0}] (id=[{3}]), que previamente se report\u00f3 como atascado, se ha completado. Estuvo activo por aproximadamente [{1}] milisegundos. {2, choice,0#|0< Hay a\u00fan [{2}] hilo(s) que son monitorizados por esta V\u00e1lvula y pueden estar atascados.}
stuckThreadDetectionValve.notifyStuckThreadDetected=El hilo  [{0}] (id=[{6}]) ha estado activo durante [{1}] miilisegundos (desde [{2}]) para servir el mismo requerimiento para [{4}] y puede estar atascado (el umbral configurado para este StuckThreadDetectionValve es de [{5}] segundos). Hay [{3}] hilo(s) en total que son monitorizados por esta V\u00e1lvula y pueden estar atascados.
